[metadata]
creation_date = "2021/06/06"
maturity = "production"
updated_date = "2021/11/23"
integration = "gcp"

[rule]
author = ["Elastic", "Austin Songer"]
description = """
Identifies the unauthorized enumeration of kubernetes secrets by a user. A Kubernetes secret is an object that lets users
store and manage sensitive information, such as passwords and connection strings in the cluster. An Adversary who have 
permissions to retrieve the secrets from the API server (by using the pod service account, for example) can access sensitive
information that might include credentials to various services.
"""
from = "now-20m"
index = ["filebeat-*", "logs-gcp*"]
language = "kuery"
license = "Elastic License v2"
name = "GCP Kubernetes Secrets Enumeration"
note = """## Config

The GCP Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."""
references = [
    "https://cloud.google.com/kubernetes-engine/docs/how-to/audit-logging",
    "https://kubernetes.io/docs/reference/generated/kubernetes-api/v1.22/#secret-v1-core",
]
risk_score = 47
rule_id = "90b6cf41-801b-4979-9233-e9a234257cd9"
severity = "medium"
tags = ["Elastic", "Cloud", "GCP", "Continuous Monitoring", "SecOps", "Configuration Audit"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset:(googlecloud.audit or gcp.audit) and event.action:("io.k8s.core.v1.secrets.get",""io.k8s.core.v*.secrets.list","io.k8s.core.v*.secrets.read") and event.outcome:success
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"


