[metadata]
creation_date = "2021/06/23"
integration = ["cyberarkpas"]
maturity = "production"
promotion = true
updated_date = "2025/01/15"

[rule]
author = ["Elastic"]
description = """
Identifies the occurrence of a CyberArk Privileged Access Security (PAS) non-error level audit event which is
recommended for monitoring by the vendor. The event.code correlates to the CyberArk Vault Audit Action Code.
"""
false_positives = ["To tune this rule, add exceptions to exclude any event.code which should not trigger this rule."]
from = "now-30m"
index = ["filebeat-*", "logs-cyberarkpas.audit*"]
language = "kuery"
license = "Elastic License v2"
name = "CyberArk Privileged Access Security Recommended Monitor"
note = """## Setup

The CyberArk Privileged Access Security (PAS) Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.

## Triage and analysis

This is a promotion rule for CyberArk events, which the vendor recommends should be monitored.
Consult vendor documentation on interpreting specific events.
"""
references = [
    "https://docs.cyberark.com/Product-Doc/OnlineHelp/PAS/Latest/en/Content/PASREF/Vault%20Audit%20Action%20Codes.htm?tocpath=Administration%7CReferences%7C_____3#RecommendedActionCodesforMonitoring",
]
risk_score = 73
rule_id = "c5f81243-56e0-47f9-b5bb-55a5ed89ba57"
rule_name_override = "event.action"
severity = "high"
tags = [
    "Data Source: CyberArk PAS",
    "Use Case: Log Auditing",
    "Use Case: Threat Detection",
    "Tactic: Privilege Escalation",
    "Resources: Investigation Guide",
]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset:cyberarkpas.audit and
  event.code:(4 or 22 or 24 or 31 or 38 or 57 or 60 or 130 or 295 or 300 or 302 or
              308 or 319 or 344 or 346 or 359 or 361 or 378 or 380 or 411) and
  not event.type:error
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1078"
name = "Valid Accounts"
reference = "https://attack.mitre.org/techniques/T1078/"


[rule.threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"
[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
id = "TA0001"
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0001/"

