[hunt]
author = "Elastic"
description = """
This hunting query identifies when a user denies multiple push notifications for multi-factor authentication (MFA) in rapid succession. Adversaries may attempt to deny push notifications to flood the target user's device with notifications, causing the user to ignore legitimate notifications or potentially disable MFA. This query identifies when a user denies more than 5 push notifications in a single hour.
"""
integration = ["okta"]
uuid = "7c51fe3e-6ae9-11ef-919d-f661ea17fbcc"
name = "Multi-Factor Authentication (MFA) Push Notification Bombing"
language = ["ES|QL"]
license = "Elastic License v2"
notes = [
    "`okta.actor.alternate_id` would be target of the threat adversary",
    "Pivoting into a potential compromise requires an additional search for `okta.outcome.result` being `SUCCESS` for any `user.authentication*` value for `okta.event_type`",
    "For a smaller window (rapid denies), reduce from 1 hour to 30 minutes or lower"
]
mitre = ['T1556.006']
query = ['''
from logs-okta.system*
| where @timestamp > NOW() - 7 day
| where event.dataset == "okta.system"
    and okta.event_type == "policy.evaluate_sign_on"
    and okta.outcome.result in ("ALLOW", "SUCCESS")
| eval time_window = DATE_TRUNC(15 minutes, @timestamp)
| stats country_count = count_distinct(client.geo.country_name) by okta.actor.alternate_id, time_window
| where country_count < 2
''']