[metadata]
creation_date = "2021/05/17"
maturity = "development"
updated_date = "2021/05/17"

[rule]
author = ["Elastic"]
description = """
Identifies accounts with high number of Single Sign ON (SSO) logon errors. Excessive logon errors may indicate 
attempts to bruteforce of password or single sign on token hijack or reuse.
"""

from = "now-30m"
index = ["filebeat-*", "logs-o365*"]
language = "eql"
license = "Elastic License v2"
name = "O365 User with Excessive SSO Logon Errors"
note = """## Config
The Microsoft 365 Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."""
risk_score = 73
rule_id = "2de10e77-c144-4e69-afb7-344e7127abd0"
severity = "high"
tags = ["Elastic", "Cloud", "Microsoft 365", "Continuous Monitoring", "SecOps", "Identity and Access"]
type = "eql"


query = '''
sequence by source.ip with maxspan=15m
[ authentication where event.action == "SsoArtifactInvalidOrExpired" ] by user.name
[ authentication where event.action == "SsoArtifactInvalidOrExpired" ] by user.name
[ authentication where event.action == "SsoArtifactInvalidOrExpired" ] by user.name
[ authentication where event.action == "SsoArtifactInvalidOrExpired" ] by user.name
[ authentication where event.action == "SsoArtifactInvalidOrExpired" ] by user.name
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1110"
name = "Brute Force"
reference = "https://attack.mitre.org/techniques/T1110/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

