[metadata]
creation_date = "2023/07/14"
integration = ["system"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2023/07/14"

[rule]
author = ["Elastic"]
description = """
Identifies multiple consecutive logon failures, targeting multiple user accounts, from the same source 
address within a short period of time. 

Adversaries may use brute force techniques to gain access to accounts when passwords are unknown or 
when password hashes are obtained. Without knowledge of the password for an account or set of accounts, 
an adversary may systematically guess the password using a repetitive or iterative mechanism. Brute 
forcing passwords can take place via interaction with a service that will check the validity of those 
credentials or offline against previously acquired credential data, such as password hashes.

Brute forcing credentials may take place at various points during a breach. For example, adversaries 
may attempt to brute force access to Valid Accounts within a victim environment leveraging knowledge 
gathered from other post-compromise behaviors such as OS Credential Dumping, Account Discovery, or 
Password Policy Discovery. Adversaries may also combine brute forcing activity with behaviors such 
as External Remote Services as part of Initial Access.
"""
false_positives = []
from = "now-540s"
index = ["auditbeat-*", "winlogbeat-*", "logs-system.security-*", "logs-system.auth-*"]
language = "kuery"
license = "Elastic License v2"
max_signals = 100
name = "Potential Brute Force Attack Currently in Progress"
note = """# Triage and analysis
## Possible investigation steps
* Investigate the logon failure reason code and the targeted user names.
* Investigate the source IP address of the failed Network Logon attempts.
* Investigate other alerts associated with the user/host during the past 48 hours.
* Identify the source and the target computer and their roles in the IT environment.
* Identify the location and IP address of the target device to ensure it has not inadvertently been exposed to the internet.
## False positive analysis
* Authentication misconfiguration or obsolete credentials.
* Service account password expired.
* Trust relationship between the primary domain and the trusted domain issue.
* Infrastructure or availability issue.
## Response and remediation
* Initiate the incident response process based on the outcome of the triage.
* If the host is a domain controller (DC):
  * Activate your incident response plan for total Active Directory compromise.
  * Review the privileges assigned to users that can access the DCs, to ensure that the least privilege principle is being followed and to reduce the attack surface.
* Isolate the involved hosts to prevent further post-compromise behavior.
* Investigate credential exposure on systems compromised or used by the attacker to ensure all compromised accounts are identified. Reset passwords for these accounts and other potentially compromised credentials, such as email, business systems, and web services.
* Run a full antimalware scan. This may reveal additional artifacts left in the system, persistence mechanisms, and malware components.
* Determine the initial vector abused by the attacker and take action to prevent reinfection through the same vector.
* Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the mean time to respond (MTTR).
"""
references = [
    "https://owasp.org/www-community/attacks/Brute_force_attack",
    "https://owasp.org/www-community/attacks/Password_Spraying_Attack",
    "https://owasp.org/www-community/attacks/Credential_stuffing"
]
risk_score = 99
rule_id = "1503453d-7d0e-45d6-bad2-237b2ed544c3"
severity = "critical"
tags = ["Domain: Endpoint", "OS: Linux", "OS: Windows", "OS: macOS", "Use Case: Threat Detection", "Tactic: Credential Access"]
timestamp_override = "event.ingested"
type = "threshold"

query = '''
event.category:authentication and 
event.action:(log_on or logon-failed or ssh_login) and 
event.outcome:failure and 
source.ip:(* and not (127.0.0.1 or "::1")) and 
user.name:(* and not (- or "ANONYMOUS LOGON" or *$)) and 
not user.domain:"NT AUTHORITY" and 
not winlog.event_data.Status:(0XC000005E or 0XC0000133 or 0XC0000192 or 0xC000015B or 0xc000035b)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1110"
name = "Brute Force"
reference = "https://attack.mitre.org/techniques/T1110/"
[[rule.threat.technique.subtechnique]]
id = "T1110.001"
name = "Password Guessing"
reference = "https://attack.mitre.org/techniques/T1110/001/"
[[rule.threat.technique.subtechnique]]
id = "T1110.003"
name = "Password Spraying"
reference = "https://attack.mitre.org/techniques/T1110/003/"
[[rule.threat.technique.subtechnique]]
id = "T1110.004"
name = "Credential Stuffing"
reference = "https://attack.mitre.org/techniques/T1110/004/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"


[rule.threshold]
field = ["host.name", "source.ip"]
value = 1
[[rule.threshold.cardinality]]
field = "user.name"
value = 10
