[metadata]
creation_date = "2026/03/26"
integration = ["endpoint"]
maturity = "production"
updated_date = "2026/03/26"

[rule]
author = ["Elastic"]
description = """
Detects the execution of suspicious shell commands via the Python interpreter. Attackers 
may use Python to execute shell commands to gain access to the system or to perform other
malicious activities, such as credential access, data exfiltration, or lateral movement.
"""
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "eql"
license = "Elastic License v2"
name = "Suspicious Python Shell Command Execution"
risk_score = 47
rule_id = "b42e4b88-fc4a-417b-a45e-4d4a3db9fd41"
severity = "medium"
tags = [
    "Domain: Endpoint",
    "OS: Linux",
    "OS: macOS",
    "Use Case: Threat Detection",
    "Tactic: Execution",
    "Data Source: Elastic Defend",
]
type = "eql"
query = '''
process where event.type == "start" and event.action == "exec" andprocess.parent.name like "python*" and
process.name in ("bash", "dash", "sh", "tcsh", "csh", "zsh", "ksh", "fish", "busybox") and
process.args in ("-c", "-cl", "-lc") and
(
  process.command_line like ("*printenv*", "*showconf*", "*kubectl *") or (
    process.command_line like ("*curl *", "*wget *") and (
      process.command_line regex ".*[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}.*" or
      process.command_line like ("*http*", "*ftp*", "*telnet*")
    ) and
    not process.command_line like ("*10.*", "*172.16.*", "*192.168.*", "*localhost*", "*127.0.0.1*")
  ) or
  (
    process.command_line regex~ """.*grep .*\([a-z]{1,15}\|[a-z]{1,15}\|[a-z]{1,15}.*\).*"""
  ) or
  (
    process.command_line like "*find *" and
    process.command_line like (
      "*/run/secrets/kubernetes.io/serviceaccount/*", "*password*", "*secret*", "*token*",
      "*private_key*", "*id_rsa*", "*id_dsa*", "*id_ecdsa*", "*id_ed25519*", "*begin private*",
      "*begin openssh private*", "*begin rsa private*", "*begin dsa private*", "*begin ec private*", 
      "*/.aws/*", "*/.git/*", "*/.env*", "*/.azure/*"
    )
  ) or
  process.args in ("hostname", "env", "whoami", "id")
)
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"

[[rule.threat.technique.subtechnique]]
id = "T1059.006"
name = "Python"
reference = "https://attack.mitre.org/techniques/T1059/006/"

[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
