[metadata]
creation_date = "2025/11/11"
maturity = "production"
updated_date = "2025/11/11"


[rule]
author = ["Elastic"]
description = "This detection correlate security alerts from different datasources related to the same destination address and from different datasources."
from = "now-9m"
language = "esql"
license = "Elastic License v2"
name = "Multiple Security Alerts by Destination Address"
note = """## Triage and analysis

### Investigating Multiple Security Alerts by Destination Address

This detection correlate security alerts from different datasources related to the same destination address.

### Possible investigation steps

- Review the specific involved destination.address reputation and relevance in your environment.
- Examine the involved correlated rules captured by Esql.kibana_alert_rule_name_values.
- Examine the involved datasources captured by Esql.event_dataset_values.
- Examine the involved process executable details (reputation and relevance).
- Review alerts from the involved agents Esql.agent_id_values.

### False positive analysis

- Normal expected network traffics.
- Company internal servers and proxy gateway.

### Response and remediation

- Isolate the affected user account immediately to prevent further unauthorized access.
- Block the domain in your network security devices to stop any ongoing malicious activity.
- Conduct a thorough review of the affected user's recent activities and access logs to identify any unauthorized actions or data access. This will help in understanding the scope of the compromise.
- Remove any malicious software or unauthorized tools that may have been installed on the user's system. Use endpoint detection and response (EDR) tools to scan and clean the system.
- Restore any altered or deleted data from backups, ensuring that the restored data is free from any malicious modifications.
- Notify relevant stakeholders, including IT security teams and management, about the incident and the steps being taken to address it. This ensures that everyone is aware and can provide support if needed.
- Implement additional monitoring on the affected user account and related systems to detect any further suspicious activities. This includes setting up alerts for unusual login attempts or data access patterns.
- Review and update access controls and permissions for the affected user and similar accounts to prevent future incidents. Ensure that least privilege principles are applied."""

risk_score = 73
rule_id = "ac0ad276-68e6-456e-9d4a-216e157d6ad4"
severity = "high"
tags = ["Use Case: Threat Detection", "Use Case : Multi Domain", "Rule Type: Higher-Order Rule", "Resources: Investigation Guide"]
timestamp_override = "event.ingested"
type = "esql"

query = '''
FROM .alerts-security.alerts* metadata _id
| where kibana.alert.rule.name is not NULL AND destination.address IS NOT NULL and kibana.alert.rule.type != "threat_match"
| stats
   cc = count(*),
   Esql.event_module_count_distinct = COUNT_DISTINCT(event.module),
   Esql.kibana_alert_rule_name_count_distinct = COUNT_DISTINCT(kibana.alert.rule.name),
   Esql.agent_id_count_distinct = COUNT_DISTINCT(agent.id),
   Esql.process_executable_count_distinct = COUNT_DISTINCT(process.executable),
   Esql.event_module_values = VALUES(event.module),
   Esql.event_dataset_values = VALUES(event.dataset),
   Esql.kibana_alert_rule_name_values = VALUES(kibana.alert.rule.name),
   Esql.process_executable_values = VALUES(process.executable),
   Esql.agent_id_values = VALUES(agent.id)
  by destination.ip
// Same destination address reported by at least by two unique integrations and from more than 2 datasources and rules
// One of the datasource captures process.executable information to correlate endpoint with network
| where Esql.event_module_count_distinct >= 2 and Esql.kibana_alert_rule_name_count_distinct >= 2 and
        Esql.agent_id_count_distinct >= 2 and Esql.agent_id_count_distinct <= 5 and Esql.process_executable_count_distinct >= 1
'''



[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
reference = "https://attack.mitre.org/tactics/TA0011/"
id = "TA0011"
name = "Command and Control"

