[metadata]
creation_date = "2025/11/13"
maturity = "production"
updated_date = "2025/11/13"


[rule]
author = ["Elastic"]
description = "This detection correlate Azure or Office365 alerts with other external alerts sharing same source.ip."
from = "now-9m"
language = "esql"
license = "Elastic License v2"
name = "Cloud and Network Alert by Source Address"
note = """## Triage and analysis

### Investigating Cloud and Network Alert by Source Address

This detection correlate security alerts from different datasources related to the same source address.

### Possible investigation steps

- Review the specific involved source.ip reputation and relevance in your environment.
- Review all alerts related to the same source.ip.
- Examine the involved correlated rules captured by Esql.kibana_alert_rule_name_values.
- Examine the involved datasources captured by Esql.event_dataset_values.

### False positive analysis

- Normal expected network traffics.
- Company internal servers and proxy gateway.

### Response and remediation

- Isolate the affected user account immediately to prevent further unauthorized access.
- Block the source.ip in your network security devices to stop any malicious activity.
- Conduct a thorough review of the affected user's recent activities and access logs to identify any unauthorized actions or data access. This will help in understanding the scope of the compromise.
- Notify relevant stakeholders, including IT security teams and management, about the incident and the steps being taken to address it. This ensures that everyone is aware and can provide support if needed.
- Implement additional monitoring on the affected user account and related systems to detect any further suspicious activities. This includes setting up alerts for unusual login attempts or data access patterns.
- Review and update access controls and permissions for the affected user and similar accounts to prevent future incidents. Ensure that least privilege principles are applied."""

risk_score = 73
rule_id = "ac0ad276-68e6-456e-9d4a-216e157d6ad4"
severity = "high"
tags = ["Use Case: Threat Detection", "Use Case : Multi Domain", "Rule Type: Higher-Order Rule", "Resources: Investigation Guide"]
timestamp_override = "event.ingested"
type = "esql"

query = '''
FROM .alerts-security.* metadata _id

| where kibana.alert.rule.name is not NULL and source.ip is not null and kibana.alert.rule.type != "threat_match" and
  (event.dataset like "o365.*" or event.dataset like "azure.*" or event.dataset like "aws.*" or event.dataset like "github.*" or event.dataset like "okta.*" or kibana.alert.rule.name == "External Alerts") and
  not CIDR_MATCH(TO_IP(source.ip), "10.0.0.0/8", "127.0.0.0/8", "169.254.0.0/16", "172.16.0.0/12", "192.0.0.0/24", "192.0.0.0/29",
                 "192.0.0.8/32", "192.0.0.9/32", "192.0.0.10/32", "192.0.0.170/32", "192.0.0.171/32", "192.0.2.0/24", "192.31.196.0/24",
                 "192.52.193.0/24", "192.168.0.0/16", "192.88.99.0/24", "224.0.0.0/4", "100.64.0.0/10", "192.175.48.0/24","198.18.0.0/15",
                 "198.51.100.0/24", "203.0.113.0/24", "240.0.0.0/4", "::1","FE80::/10", "FF00::/8", "8.8.8.8")
| keep event.dataset, event.category, source.ip, kibana.alert.rule.name, cluster_uuid
| eval
  o365_src_ip = case(event.dataset like "o365.*", source.ip, null),
  azure_src_ip = case(event.dataset like "azure.*", source.ip, null),
  aws_src_ip = case(event.dataset == "aws.*", source.ip, null),
  github_src_ip = case(event.dataset like "github.*", source.ip, null),
  okta_src_ip = CASE(event.dataset like "okta.*", source.ip, null),
  external_alert_src_ip = case(kibana.alert.rule.name == "External Alerts", source.ip, null)

| stats
  Esql.alerts_count = COUNT(*),
  Esql.event_dataset_distinct_count = COUNT_DISTINCT(event.dataset),
  Esql.is_o365_distinct_count = COUNT_DISTINCT(o365_src_ip),
  Esql.is_azure_distinct_count = COUNT_DISTINCT(azure_src_ip),
  Esql.is_aws_distinct_count = COUNT_DISTINCT(aws_src_ip),
  Esql.is_github_distinct_count = COUNT_DISTINCT(github_src_ip),
  Esql.is_okta_distinct_count = COUNT_DISTINCT(okta_src_ip),
  Esql.external_alert_distinct_count = COUNT_DISTINCT(external_alert_src_ip),

  Esql.event_dataset_values = VALUES(event.dataset),
  Esql.kibana_alert_rule_name_values = VALUES(kibana.alert.rule.name),
  Esql.event_category_values = VALUES(event.category) by source.ip, cluster_uuid

// At least one cloud alert and one external alert for the same source.ip
| where Esql.external_alert_distinct_count >= 1 and Esql.event_dataset_distinct_count >= 2 and Esql.alerts_count <= 100 and (Esql.is_o365_distinct_count > 0 or Esql.is_azure_distinct_count > 0 or Esql.is_aws_distinct_count > 0 or Esql.is_github_distinct_count > 0 or Esql.is_okta_distinct_count > 0)
| keep Esql.event_dataset_values, Esql.event_category_values, Esql.kibana_alert_rule_name_values, source.ip, Esql.alerts_count
'''


