[metadata]
creation_date = "2020/08/18"
ecs_version = ["1.5.0"]
maturity = "development"
updated_date = "2020/08/18"

[rule]
author = ["Loginsoft Research Unit"]
description = "Detecting suspicious error log events which lead to potential security threats"
index = ["filebeat-*"]
language = "kuery"
license = "Elastic License"
name = "Detecting Anomalies from Nginx logs( High Severity )"
risk_score = 65
rule_id = "d9123b02-516a-4a93-a8ca-99a55e0075e1"
severity = "high"
tags = ["nginx"]
type = "query"

query = '''
event.dataset: "nginx.error" and message:("http invalid header:" or "client sent invalid header:" or "zero size buf" or "zero size buf in writer" or "rt signal queue overflow recovered" or "auth http server sent invalid response" or "memcached sent invalid trailer" or "http charset invalid utf" or "client sent too large request" or "upstream sent invalid header" or "client intended to send body data larger than declared" or "receive buffer overrun" or "request reference counter overflow while processing" or "http2 preread buffer overflow" or "upstream sent too large http2 header name length" or "upstream sent too large http2 header value length" or "header is too large" or "client sent invalid host in request line" or "no OCSP responder URL in certificate" or "empty host in OCSP responder in certificate")
'''

