[metadata]
creation_date = "2020/08/18"
ecs_version = ["1.5.0"]
maturity = "development"
updated_date = "2020/08/18"

[rule]
author = ["Loginsoft Research Unit"]
description = "Detecting suspicious error log events which lead to potential security threats"
index = ["filebeat-*"]
language = "kuery"
license = "Elastic License"
name = "Detecting Anomalies from Nginx logs( Critical Severity )"
risk_score = 76
rule_id = "e648ae30-b4fc-435c-8484-190ceb7cbf6d"
severity = "critical"
tags = ["nginx"]
type = "query"

query = '''
event.dataset:nginx.error and message:("http alloc large header buffer" or "SSL renegotiation" or "buffer overflow" or  "client sent invalid chunked body" or "client sent too long URI" or "http large header alloc:" or "http large header copy:" or "http large header free:")
'''

