[metadata]
creation_date = "2020/08/18"
ecs_version = ["1.5.0"]
maturity = "development"
updated_date = "2020/08/18"

[rule]
author = ["Loginsoft Research Unit"]
description = "Detecting suspicious error log events which may lead to potential security threats"
index = ["filebeat-*"]
language = "kuery"
license = "Elastic License"
name = "Detecting Anomalies from Nginx logs( Low Severity )"
risk_score = 19
rule_id = "60d27527-8604-403a-989d-60f0890fc8ad"
severity = "low"
tags = ["nginx"]
type = "query"

query = '''
event.dataset : "nginx.error" and message : "peer started SSL renegotiation"
'''

