[metadata]
creation_date = "2020/12/21"
maturity = "production"
updated_date = "2020/12/21"

[rule]
author = ["Elastic"]
description = """
Adversaries may modify the standard authentication module for persistence via patching the normal authorization process
or modifying the login configuration to allow unauthorized access or elevate privileges.
"""
false_positives = ["Trusted system module updates or allowed Pluggable Authentication Module (PAM) daemon configuration changes."]
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Modification of Standard Authentication Module or Configuration"
references = [
    "https://github.com/zephrax/linux-pam-backdoor",
    "https://github.com/eurialo/pambd",
    "http://0x90909090.blogspot.com/2016/06/creating-backdoor-in-pam-in-5-line-of.html",
    "https://www.trendmicro.com/en_us/research/19/i/skidmap-linux-malware-uses-rootkit-capabilities-to-hide-cryptocurrency-mining-payload.html",
]
risk_score = 47
rule_id = "93f47b6f-5728-4004-ba00-625083b3dcb0"
severity = "medium"
tags = ["Elastic", "Host", "macOS", "Linux", "Threat Detection", "Credential Access", "Persistence"]
type = "query"

query = '''
event.category:file and event.type:change and
process.executable:* and 
(file.name:pam_*.so or file.path:(/etc/pam.d/* or /private/etc/pam.d/*)) and 
not process.executable:
           (/bin/yum or 
            "/usr/sbin/pam-auth-update" or 
            /usr/libexec/packagekitd or 
            /usr/bin/dpkg or 
            /usr/bin/vim or 
            /usr/libexec/xpcproxy or 
            /usr/bin/bsdtar or 
            /usr/local/bin/brew)
'''

[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1543"
name = "Create or Modify System Process"
reference = "https://attack.mitre.org/techniques/T1543/"

[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1556"
name = "Modify Authentication Process"
reference = "https://attack.mitre.org/techniques/T1556/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"
