[metadata]
creation_date = "2020/11/18"
ecs_version = ["1.6.0"]
maturity = "development"
updated_date = "2020/11/18"

[rule]
author = ["Anabella Cristaldi"]
description = """
Identifies the creation of new users. This is sometimes done either by attackers to increase access to a system or a
domain or by a legal admin and the activity needs to be audited when strong security regulations are in place.
"""
index = ["winlogbeat-*", "auditbeat-*"]
language = "kuery"
license = "Elastic License"
name = "User Account Created"
risk_score = 21
rule_id = "73ccc727-dc70-4112-85f1-aa91f86548f0"
severity = "low"
tags = ["Windows", "Linux", "Elastic"]
type = "query"

query = '''
event.category:iam and event.type:(creation and user) and event.outcome:success
'''

