[metadata]
creation_date = "2020/12/01"
integration = ["o365"]
maturity = "production"
updated_date = "2025/01/10"

[rule]
author = ["Elastic"]
description = """
Identifies a high number (25) of failed Microsoft 365 user authentication attempts from a single IP address within 30
minutes, which could be indicative of a password spraying attack. An adversary may attempt a password spraying attack to
obtain unauthorized access to user accounts.
"""
false_positives = [
    """
    Automated processes that attempt to authenticate using expired credentials and unbounded retries may lead to false
    positives.
    """,
]
from = "now-30m"
index = ["filebeat-*", "logs-o365*"]
language = "kuery"
license = "Elastic License v2"
name = "Deprecated - Potential Password Spraying of Microsoft 365 User Accounts"
note = """## Triage and analysis

> **Disclaimer**:
> This investigation guide was created using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.

### Investigating Deprecated - Potential Password Spraying of Microsoft 365 User Accounts

Microsoft 365 is a cloud-based suite offering productivity and collaboration tools. Adversaries may exploit its authentication mechanisms through password spraying, a technique involving multiple login attempts with common passwords across many accounts. This detection rule identifies such attempts by monitoring failed logins from a single IP, flagging potential unauthorized access efforts.

### Possible investigation steps

- Review the IP address associated with the failed login attempts to determine if it is known or has been flagged in previous incidents.
- Analyze the event logs for the specific event.dataset:o365.audit to identify patterns or anomalies in the failed login attempts, such as the frequency and timing of the attempts.
- Check the user accounts targeted by the failed login attempts to assess if they have been compromised or if there are any unusual activities associated with them.
- Investigate the event.provider field to determine if the attempts were made through Exchange or AzureActiveDirectory, which may provide additional context on the attack vector.
- Correlate the failed login attempts with other security events or alerts to identify if this is part of a larger attack campaign or if there are other related security incidents.

### False positive analysis

- High volume of legitimate login attempts from a single IP address can trigger false positives, such as when a large organization uses a centralized proxy or VPN. To mitigate, exclude known IP addresses of trusted proxies or VPNs from the rule.
- Automated scripts or applications performing frequent login checks for service accounts may cause false positives. Identify and whitelist these service accounts to prevent unnecessary alerts.
- Users with incorrect password storage in password managers may repeatedly attempt logins with outdated credentials. Encourage users to update their stored passwords and consider excluding these accounts if they are known to cause frequent alerts.
- Security testing or penetration testing activities might mimic password spraying behavior. Coordinate with security teams to schedule these activities and temporarily adjust the rule to avoid false positives during testing periods.

### Response and remediation

- Immediately block the IP address identified in the alert to prevent further unauthorized login attempts.
- Reset passwords for all user accounts targeted by the failed login attempts to ensure any compromised credentials are no longer valid.
- Enable multi-factor authentication (MFA) for all affected accounts to add an additional layer of security against unauthorized access.
- Review and update conditional access policies to restrict login attempts from suspicious or untrusted locations.
- Notify the security operations team to monitor for any further suspicious activity related to the identified IP address or user accounts.
- Escalate the incident to the IT security manager for further investigation and to determine if additional resources are needed for a comprehensive response.
- Conduct a post-incident review to identify any gaps in the current security posture and implement measures to prevent similar attacks in the future.

This rule has been deprecated in favor of `Attempts to Brute Force a Microsoft 365 User Account` (26f68dba-ce29-497b-8e13-b4fde1db5a2d)."""
risk_score = 73
rule_id = "3efee4f0-182a-40a8-a835-102c68a4175d"
severity = "high"
tags = [
    "Domain: Cloud",
    "Data Source: Microsoft 365",
    "Use Case: Identity and Access Audit",
    "Tactic: Credential Access",
]
timestamp_override = "event.ingested"
type = "threshold"

query = '''
event.dataset:o365.audit and event.provider:(Exchange or AzureActiveDirectory) and event.category:authentication and
event.action:("UserLoginFailed" or "PasswordLogonInitialAuthUsingPassword")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1110"
name = "Brute Force"
reference = "https://attack.mitre.org/techniques/T1110/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

[rule.threshold]
field = ["source.ip"]
value = 25

