[metadata]
creation_date = "2025/05/01"
integration = ["o365"]
maturity = "production"
updated_date = "2025/07/16"

[rule]
author = ["Elastic"]
description = """
Identifies sign-ins on behalf of a principal user to the Microsoft Graph API from multiple IPs using the Microsoft
Authentication Broker or Visual Studio Code application. This behavior may indicate an adversary using a phished OAuth
refresh token.
"""
from = "now-60m"
interval = "59m"
language = "esql"
license = "Elastic License v2"
name = "Suspicious Microsoft 365 UserLoggedIn via OAuth Code"
note = """## Triage and analysis

### Investigating Suspicious Microsoft 365 UserLoggedIn via OAuth Code

### Possible Investigation Steps:

- `o365.audit.UserId`: The identity value the application is acting on behalf of principal user.
- `unique_ips`: Analyze the list of unique IP addresses used within the 30-minute window. Determine whether these originate from different geographic regions, cloud providers, or anonymizing infrastructure (e.g., Tor or VPNs).
- `target_time_window`: Use the truncated time window to pivot into raw events to reconstruct the full sequence of resource access events, including exact timestamps and service targets.
- `azure.auditlogs` to check for device join or registration events around the same timeframe.
- `azure.identityprotection` to identify correlated risk detections, such as anonymized IP access or token replay.
- Any additional sign-ins from the `ips` involved, even outside the broker, to determine if tokens have been reused elsewhere.

### False Positive Analysis

- Developers or IT administrators working across environments may also produce similar behavior.

### Response and Remediation

- If confirmed unauthorized, revoke all refresh tokens for the affected user and remove any devices registered during this session.
- Notify the user and determine whether the device join or authentication activity was expected.
- Audit Conditional Access and broker permissions (`29d9ed98-a469-4536-ade2-f981bc1d605e`) to ensure policies enforce strict access controls.
- Consider blocking token-based reauthentication to Microsoft Graph and DRS from suspicious locations or user agents.
- Continue monitoring for follow-on activity like lateral movement or privilege escalation.
"""
references = [
    "https://www.volexity.com/blog/2025/04/22/phishing-for-codes-russian-threat-actors-target-microsoft-365-oauth-workflows/",
    "https://github.com/dirkjanm/ROADtools",
    "https://dirkjanm.io/phishing-for-microsoft-entra-primary-refresh-tokens/",
]
risk_score = 73
rule_id = "36188365-f88f-4f70-8c1d-0b9554186b9c"
setup = """## Setup

The Office 365 Logs Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.
"""
severity = "high"
tags = [
    "Domain: Cloud",
    "Domain: Email",
    "Domain: Identity",
    "Data Source: Microsoft 365",
    "Data Source: Microsoft 365 Audit Logs",
    "Use Case: Identity and Access Audit",
    "Use Case: Threat Detection",
    "Resources: Investigation Guide",
    "Tactic: Defense Evasion",
]
timestamp_override = "event.ingested"
type = "esql"

query = '''
FROM logs-o365.audit-*
| WHERE
    event.dataset == "o365.audit" AND
    event.action == "UserLoggedIn" AND
    source.ip IS NOT NULL AND
    o365.audit.UserId IS NOT NULL AND
    o365.audit.ApplicationId IS NOT NULL AND
    o365.audit.UserType IN ("0", "2", "3", "10") AND
    o365.audit.ApplicationId IN ("aebc6443-996d-45c2-90f0-388ff96faa56", "29d9ed98-a469-4536-ade2-f981bc1d605e") AND
    o365.audit.ObjectId IN ("00000003-0000-0000-c000-000000000000")
| EVAL
    Esql.o365.audit.ExtendedProperties.RequestType = o365.audit.ExtendedProperties.RequestType,
    Esql.o365.audit.ExtendedProperties.ResultStatusDetail = o365.audit.ExtendedProperties.ResultStatusDetail,
    Esql.time_window.date_trunc = DATE_TRUNC(30 minutes, @timestamp),
    Esql.oauth.authorize.user_id.case = CASE(
        Esql.o365.audit.ExtendedProperties.RequestType == "OAuth2:Authorize" AND Esql.o365.audit.ExtendedProperties.ResultStatusDetail == "Redirect",
        o365.audit.UserId,
        null
    ),
    Esql.oauth.token.user_id.case = CASE(
        Esql.o365.audit.ExtendedProperties.RequestType == "OAuth2:Token",
        o365.audit.UserId,
        null
    )
| STATS
    Esql.source.ip.count_distinct = COUNT_DISTINCT(source.ip),
    Esql.source.ip.values = VALUES(source.ip),
    Esql.o365.audit.ApplicationId.values = VALUES(o365.audit.ApplicationId),
    Esql.source.`as`.organization.name.values = VALUES(source.`as`.organization.name),
    Esql.oauth.token.count_distinct = COUNT_DISTINCT(Esql.oauth.token.user_id.case),
    Esql.oauth.authorize.count_distinct = COUNT_DISTINCT(Esql.oauth.authorize.user_id.case)
  BY
    o365.audit.UserId,
    Esql.time_window.date_trunc,
    o365.audit.ApplicationId,
    o365.audit.ObjectId
| KEEP
    Esql.time_window.date_trunc,
    Esql.source.ip.values,
    Esql.source.ip.count_distinct,
    Esql.o365.audit.ApplicationId.values,
    Esql.source.`as`.organization.name.values,
    Esql.oauth.token.count_distinct,
    Esql.oauth.authorize.count_distinct
| WHERE
    Esql.source.ip.count_distinct >= 2 AND
    Esql.oauth.token.count_distinct > 0 AND
    Esql.oauth.authorize.count_distinct > 0
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1550"
name = "Use Alternate Authentication Material"
reference = "https://attack.mitre.org/techniques/T1550/"
[[rule.threat.technique.subtechnique]]
id = "T1550.001"
name = "Application Access Token"
reference = "https://attack.mitre.org/techniques/T1550/001/"



[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

