[metadata]
creation_date = "2021/07/15"
maturity = "development"
updated_date = "2021/10/13"
integration = "o365"

[rule]
author = ["Austin Songer"]
description = """
Identifies when Microsoft Cloud App Security reports that a single user performs more than 50 downloads within 1 minute.
"""
false_positives = ["Unknown"]
from = "now-30m"
index = ["filebeat-*", "logs-o365*"]
language = "kuery"
license = "Elastic License v2"
name = "Microsoft 365 Mass download by a single user"
note = """## Config

The Office 365 Logs Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.
"""
references = [
    "https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy",
    "https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference",
]
risk_score = 47
rule_id = "571ff456-aa7f-4e48-8a88-39698bb5418f"
severity = "medium"
tags = ["Elastic", "Cloud", "Microsoft 365", "Continuous Monitoring", "SecOps", "Configuration Audit"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset:o365.audit and event.provider:SecurityComplianceCenter and event.category:web and event.action:"Mass download by a single user" and event.outcome:success
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
name = "Exfiltration"
reference = "https://attack.mitre.org/tactics/TA0010/"
id = "TA0010"
