[metadata]
creation_date = "2021/07/15"
maturity = "production"
updated_date = "2021/10/05"
integration = "o365"

[rule]
author = ["Austin Songer"]
description = """
Identifies when Microsoft Cloud App Security reports that a user has uploaded files to the cloud that might be infected
with ransomware.
"""
false_positives = [
    """
    If Cloud App Security identifies, for example, a high rate of file uploads or file deletion activities it may represent an adverse
    encryption process.
    """,
]
from = "now-30m"
index = ["filebeat-*", "logs-o365*"]
language = "kuery"
license = "Elastic License v2"
name = "Microsoft 365 Potential ransomware activity"
note = """## Config

The Office 365 Logs Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.
"""
references = [
    "https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy",
    "https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference",
]
risk_score = 47
rule_id = "721999d0-7ab2-44bf-b328-6e63367b9b29"
severity = "medium"
tags = ["Elastic", "Cloud", "Microsoft 365", "Continuous Monitoring", "SecOps", "Configuration Audit"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset:o365.audit and event.provider:SecurityComplianceCenter and event.category:web and event.action:"Potential ransomware activity" and event.outcome:success
'''

[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
name = "Data Encrypted for Impact"
reference = "https://attack.mitre.org/techniques/T1486/"
id = "T1486"


[rule.threat.tactic]
name = "Impact"
reference = "https://attack.mitre.org/tactics/TA0040/"
id = "TA0040"
