[metadata]
creation_date = "2021/07/15"
maturity = "production"
updated_date = "2021/10/05"
integration = "o365"

[rule]
author = ["Austin Songer"]
description = """
Identifies when a user has been restricted from sending email due to exceeding sending limits of the service policies per the Security Compliance Center.
"""
false_positives = ["A user sending emails using personal distribution folders may trigger the event."]
from = "now-30m"
index = ["filebeat-*", "logs-o365*"]
language = "kuery"
license = "Elastic License v2"
name = "Microsoft 365 User Restricted from Sending Email"
note = """## Config

The Office 365 Logs Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.
"""
references = [
    "https://docs.microsoft.com/en-us/cloud-app-security/anomaly-detection-policy",
    "https://docs.microsoft.com/en-us/cloud-app-security/policy-template-reference",
]
risk_score = 47
rule_id = "0136b315-b566-482f-866c-1d8e2477ba16"
severity = "medium"
tags = ["Elastic", "Cloud", "Microsoft 365", "Continuous Monitoring", "SecOps", "Configuration Audit"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset:o365.audit and event.provider:SecurityComplianceCenter and event.category:web and event.action:"User restricted from sending email" and event.outcome:success
'''

[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
name = "Valid Accounts"
reference = "https://attack.mitre.org/techniques/T1078/"
id = "T1078"


[rule.threat.tactic]
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0001/"
id = "TA0001"
