[metadata]
creation_date = "2020/09/01"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/09/01"

[rule]
author = ["Elastic"]
description = """
Identifies when an Azure Conditional Access policy is modified. Azure Conditional Access policies control access to
resources via if-then statements. For example, if a user wants to access a resource, then they must complete an action
such as using multi-factor authentication to access it. An adversary may modify a Conditional Access policy in order to
weaken their target's security controls.
"""
from = "now-25m"
index = ["filebeat-*"]
language = "kuery"
license = "Elastic License"
name = "Azure Conditional Access Policy Modified"
note = "The Azure Filebeat module must be enabled to use this rule."
references = ["https://docs.microsoft.com/en-us/azure/active-directory/conditional-access/overview"]
risk_score = 47
rule_id = "bc48bba7-4a23-4232-b551-eca3ca1e3f20"
severity = "medium"
tags = ["Elastic", "Azure", "Continuous Monitoring", "SecOps", "Configuration Audit"]
type = "query"

query = '''
event.module:azure and event.dataset:azure.activitylogs and event.category:Administrative and azure.activitylogs.operation_name:"Update policy" and azure.activitylogs.properties.result:success
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1098"
name = "Account Manipulation"
reference = "https://attack.mitre.org/techniques/T1098/"


[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"
