[metadata]
creation_date = "2021/05/05"
maturity = "development"
updated_date = "2021/05/05"

[rule]
author = ["Elastic", "Austin Songer"]
description = """
New Service Principal Credentials Added. In most organizations, credentials will be added to service principals
infrequently. Service Principals can have delegated or application permissions associated with them. Hijacking an 
application (by adding a rogue secret or certificate) with granted permissions will allow the attacker to access 
data that is normally protected by MFA requirements.
"""
false_positives = ["Unknown"]
from = "now-25m"
index = ["filebeat-*", "logs-azure*"]
interval = "10m"
language = "kuery"
license = "Elastic License v2"
name = "Azure Service Principal Credentials Added"
note = "The Azure Fleet Integration or Filebeat module must be enabled to use this rule."
references = ["https://www.fireeye.com/content/dam/collateral/en/wp-m-unc2452.pdf"]
risk_score = 47
rule_id = "f766ffaf-9568-4909-b734-75d19b35cbf4"
severity = "medium"
tags = ["Elastic", "Cloud", "Azure", "Continuous Monitoring", "SecOps", "Identity and Access"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset: azure.auditlogs and azure.auditlogs.operation_name : "Add service principal credentials." and event.outcome: (success or Success)
'''

[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
reference = "https://attack.mitre.org/techniques/T1496/"
id = "T1496"
name = "Resource Hijacking"


[rule.threat.tactic]
reference = "https://attack.mitre.org/tactics/TA0040/"
id = "TA0040"
name = "Impact"
