[hunt]
author = "Elastic"
integration = "logs-windows.sysmon_operational-*"
uuid = "0545f23f-84a7-4b88-9b5b-b8cfcfdc9276"
name = "CreateRemoteThread by source process with low occurrence"
language = "ES|QL"
notes = [
    "This hunt aggregate Sysmon CreateRemoteThread events by source process and returns the ones that we observed in only one unique host. This may indicate remote process injection.",
    "adding winlog.event_data.TargetImage to the group by clause can be beneficial but may introduce more legit hits.",
]
mitre = [ "T1055",]

query = '''
from logs-windows.sysmon_operational-* 
| where @timestamp > now() - 7 day
| where host.os.family == "windows" and event.category == "process" and event.action == "CreateRemoteThread"
| eval source_process = replace(process.executable, """[cC]:\\[uU][sS][eE][rR][sS]\\[a-zA-Z0-9ñ\.\-\_\$~ ]+\\""", "C:\\\\users\\\\user\\\\")
| stats cc = count(*), hosts = count_distinct(host.id) by source_process
 /* unique source and target process combin observed in 1 host*/
| where hosts == 1 and cc == 1
'''