[hunt]
author = "Elastic"
integration = ["windows"]
uuid = "6bb90aba-af6b-4128-a9b2-160e164a15ff"
name = "Drivers Load with low occurrence frequency - Sysmon"
language = "ES|QL"
license = "Elastic License v2"
notes = [
    "This hunt helps identify drivers loaded once, on a unique host and with a unique hash over a 15 days period of time. Further investigation can be done pivoting by dll.pe.imphash or dll.name. Advanced adversaries may leverage legit vulnerable driver to tamper with existing defences or execute code in Kernel mode.",
    "dll.Ext.relative_file_creation_time is used in the first query to limit the result to recently dropped drivers (populated in Elastic Defend).",
    "aggregation can be done also by dll.hash.sha256 / file.hash.sha256 but will return more results.",
    "Bring Your Own Vulnerable Driver (BYOVD) are all signed and not malicious, further investigation should be done to check the surrounding events (service creation, process that dropped the driver etc.).",
]
mitre = [ "T1068",]

query = '''
from logs-windows.sysmon_operational-* 
| where @timestamp > now() - 15 day
| where host.os.family == "windows" and event.category == "driver" 
| stats host_count = count_distinct(host.id), total_count = count(*), hash_count = count_distinct(file.hash.sha256) by file.name
| where host_count == 1 and total_count == 1 and hash_count == 1
'''