[hunt]
author = "Elastic"
integration = ["endpoint", "windows"]
uuid = "6949135b-76d7-47a3-ae95-ef482508fb7c"
name = "Excessive SMB Network Activity by process Id"
language = "ES|QL"
license = "Elastic License v2"
notes = [
    "This hunt looks for high number of SMB connections from same process to more than a defined threshold of unique destination Ip addresses. This could be a sign of SMB scanning or some lateral movement via remote services that depend on SMB protocol.",
    "Further investigation can done pivoting by process.entity_id and host.id.",
    "Maximum number of unique destination.ip by process can be adjusted to your environment to reduce normal noisy hosts by Id.",]
mitre = [ "T1021", "T1021.002",]

query = '''
from logs-endpoint.events.network-*, logs-windows.sysmon_operational-* 
| where @timestamp > now() - 7 day and 
  host.os.family == "windows" and event.category == "network" and network.direction == "egress" and 
  network.transport == "tcp"and destination.port == 445 and source.port >= 49152 and process.pid == 4
| keep destination.ip, process.entity_id, host.id
| stats count_unique_dst = count_distinct(destination.ip) by process.entity_id, host.id
 /* threshold set to 20 but can be adjusted to reduce normal baseline in your env */
| where count_unique_dst >= 20
'''