[hunt]
author = "Elastic"
description = """
This hunt looks for Microsoft Office child processes with low occurrence frequency. This could be a normal rare behavior as well as potential execution via a malicious document. Adversaries may use Microsoft Office applications to execute malicious code, such as macros, scripts, or other payloads.
"""
integration = ["endpoint", "windows", "system"]
uuid = "f1b8519a-4dae-475f-965a-f53559233eab"
name = "Microsoft Office Child Processes with Low Occurrence Frequency by Unique Agent"
language = ["ES|QL"]
license = "Elastic License v2"
notes = [
    "Certain processes like `WerFault.exe`, `dw20.exe` and `dwwin.exe` are often related to application crash.",
    "Closer attention should be attributed to lolbins and unsigned executables (Windows 4688 is not capturing process code signature information).",
]
mitre = [ "T1566", "T1566.001"]
query = [
'''
from logs-endpoint.events.process-*, logs-windows.sysmon_operational-*, logs-system.security-*
| where host.os.family == "windows" and @timestamp > NOW() - 15 day and
  event.category == "process" and event.action in ("start", "Process creation", "created-process") and
  to_lower(process.parent.name) in ("winword.exe", "excel.exe", "powerpnt.exe") and not starts_with(process.executable, "C:\\Program Files")
// normalize user home profile paths
| eval process_path = replace(to_lower(process.executable), """[c]:\\[u][s][e][r][s]\\[a-zA-Z0-9\.\-\_\$]+\\""", "c:\\\\users\\\\user\\\\")
| stats occurrences = count(*), agents = count_distinct(agent.id) by process_path, process.parent.name
| where occurrences == 1 and agents == 1
'''
]