[hunt]
author = "Elastic"
integration = "logs-endpoint.events.file-*"
uuid = "ef9def35-0671-4599-8a18-5a1b833ef4c4"
name = "PE File Transfer via SMB_Admin Shares by User"
language = "ES|QL"
notes = [
    "This hunt looks for high number of executable file transfer via the SMB protocol by the same user.name to more than a defined maxium threshold of targets. This could be a sign of lateral movement via the Windows Admin Shares.",
    "PE File Transfer via SMB/Admin Shares by User",
]
mitre = [ "T1021", "T1021.002",]

query = '''
from logs-endpoint.events.file-*
| where  @timestamp > now() - 7 day 
| where host.os.family == "windows" and event.category == "file" and event.action != "deletion" and process.pid == 4 and 
  starts_with(file.Ext.header_bytes, "4d5a*") and (starts_with(user.id, "S-1-5-21-") or starts_with(user.id, "S-1-12-1-")) 
| stats agents = count_distinct(host.id), total = count(*) by user.name
 /* threshold set to 10 but can be adjusted to reduce normal baseline in your env */
| where agents >= 10
'''