[hunt]
author = "Elastic"
integration = ["endpoint", "windows"]
uuid = "ebf79207-16dc-44f8-b10c-317d4a034bad"
name = "Unique Windows Services Creation by ServiceFileName - Elastic Defend Registry - Sysmon"
language = "ES|QL"
license = "Elastic License v2"
notes = [
    "This hunt identify services registry modification by unusual process based on number of hosts and occurrences history.",
]
mitre = [ "T1543", "T1543.003",]

query = '''
from logs-endpoint.events.registry-*, logs-windows.sysmon_operational-* 
| where  @timestamp > now() - 7 day
| where host.os.family == "windows" and event.category == "registry" and event.action in ("modification",  "RegistryEvent (Value Set)") and 
  registry.value in ("ServiceDLL", "ImagePath") and starts_with(registry.path, "HKLM\\SYSTEM\\") and 
  process.executable != "C:\\Windows\\System32\\services.exe"
| eval process_path = replace(process.executable, """[cC]:\\[uU][sS][eE][rR][sS]\\[a-zA-Z0-9ñ\.\-\_\$~ ]+\\""", "C:\\\\users\\\\user\\\\")
| stats hosts = count_distinct(host.id), occurrences = count(*) by process_path
/* unique process.executable found in one agent */
| where hosts == 1 and occurrences == 1
'''