[hunt]
author = "Elastic"
integration = "logs-endpoint.events.process-*, logs-windows.sysmon_operational-*, logs-system.security-*"
uuid = "de929347-c04a-4a94-8be2-cbe87b25bb25"
name = "Windows Command and Scripting Interpreter from unusual parent"
language = "ES|QL"
license = "Elastic License v2"
notes = [
    "Pivoting can be done via process.parent.name.",
    "Certain Microsoft binaries like LSASS, winlogon, spoolsv and others should never spawn cmd.exe powershell.exe or conhost.exe, if so it's highly likely malicious.",
]
mitre = [ "T1059", "T1059.001", "T1059.003",]

query = '''
from logs-endpoint.events.process-*, logs-windows.sysmon_operational-*, logs-system.security-*
| where  @timestamp > now() - 7 day
| where host.os.family == "windows" and event.category == "process" and event.action in ("start", "Process creation", "created-process") and 
  process.name.caseless in ("cmd.exe", "powershell.exe", "conhost.exe") and 
  (starts_with(process.parent.executable.caseless, "c:\\windows\\system32") or starts_with(process.parent.executable.caseless, "c:\\windows\\syswow64"))
| keep process.name, process.parent.name, host.id
| stats hosts = count_distinct(host.id), cc = count(*) by process.parent.name
| where cc <= 10 and hosts == 1
'''