[metadata]
creation_date = "2023/07/10"
integration = ["endpoint"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2023/07/26"

[rule]
author = ["Elastic"]
building_block_type = "default"
description = """
Identifies potentially malicious processes communicating via a port paring typically not associated with HTTP/HTTPS.
For example, HTTP over port 8443 or port 440 as opposed to the traditional port 80 , 443.
Adversaries may make changes to the standard port a protocol uses to bypass filtering or
muddle analysis/parsing of network data.
"""
from = "now-119m"
interval = "60m"
index = ["logs-endpoint.events.*"]
language = "eql"
license = "Elastic License v2"
name = "Potential Non-Standard Port HTTP/HTTPS connection"
risk_score = 21
rule_id = "62b68eb2-1e47-4da7-85b6-8f478db5b272"
severity = "low"
tags = ["Domain: Endpoint", "OS: Linux", "OS: macOS", "Use Case: Threat Detection", "Tactic: Command and Control", "Rule Type: BBR", "Data Source: Elastic Defend"]
timestamp_override = "event.ingested"
type = "eql"
query = '''
network where process.name : ("http", "https")
  and destination.port not in (80, 443)
  and event.action in ("connection_attempted", "connection_accepted")
  and destination.ip != "127.0.0.1"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1571"
name = "Non-Standard Port"
reference = "https://attack.mitre.org/techniques/T1571/"

[[rule.threat.technique]]
id = "T1071"
name = "Application Layer Protocol"
reference = "https://attack.mitre.org/techniques/T1071/"
[[rule.threat.technique.subtechnique]]
id = "T1071.001"
name = "Web Protocols"
reference = "https://attack.mitre.org/techniques/T1071/001/"

[[rule.threat.technique]]
id = "T1573"
name = "Encrypted Channel"
reference = "https://attack.mitre.org/techniques/T1573/"
[[rule.threat.technique.subtechnique]]
id = "T1573.001"
name = "Symmetric Cryptography"
reference = "https://attack.mitre.org/techniques/T1573/001/"
[[rule.threat.technique.subtechnique]]
id = "T1573.002"
name = "Asymmetric Cryptography"
reference = "https://attack.mitre.org/techniques/T1573/002/"



[rule.threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"
