[metadata]
bypass_bbr_timing = true
creation_date = "2020/08/18"
integration = ["endpoint", "windows", "system"]
min_stack_comments = "Breaking change at 8.14.0 for the Windows Integration."
min_stack_version = "8.14.0"
maturity = "production"
updated_date = "2025/01/10"

[rule]
author = ["Elastic"]
building_block_type = "default"
description = """
Identifies the Internet Information Services (IIS) command-line tool, AppCmd, being used to list passwords. An attacker
with IIS web server access via a web shell can decrypt and dump the IIS AppPool service account password using AppCmd.
"""
from = "now-9m"
index = [
    "winlogbeat-*",
    "logs-endpoint.events.process-*",
    "logs-windows.*",
    "endgame-*",
    "logs-system.security*",
]
language = "eql"
license = "Elastic License v2"
name = "Microsoft IIS Service Account Password Dumped"
references = ["https://blog.netspi.com/decrypting-iis-passwords-to-break-out-of-the-dmz-part-1/"]
risk_score = 21
rule_id = "0564fb9d-90b9-4234-a411-82a546dc1343"
severity = "low"
tags = [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Credential Access",
    "Data Source: Elastic Endgame",
    "Data Source: Elastic Defend",
    "Rule Type: BBR",
    "Data Source: System",
]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where host.os.type == "windows" and event.type == "start" and
   (process.name : "appcmd.exe" or ?process.pe.original_file_name == "appcmd.exe") and
   process.args : "list" and process.args : "/text*"
'''
note = """## Triage and analysis

> **Disclaimer**:
> This investigation guide was created using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.

### Investigating Microsoft IIS Service Account Password Dumped

Microsoft Internet Information Services (IIS) is a web server platform used to host websites and applications. AppCmd is a command-line tool for managing IIS configurations, including application pools. Adversaries with access to IIS can exploit AppCmd to extract service account passwords, potentially leading to credential theft. The detection rule identifies suspicious use of AppCmd by monitoring process execution patterns indicative of password dumping activities, thereby alerting security teams to potential credential access threats.

### Possible investigation steps

- Review the alert details to confirm the presence of "appcmd.exe" in the process name or original file name, and check if the process arguments include "list" and "/text*".
- Identify the user account under which the "appcmd.exe" process was executed to determine if it aligns with expected administrative activity or if it indicates potential unauthorized access.
- Examine the source IP address and host from which the "appcmd.exe" process was initiated to assess if it is a known and trusted source or if it requires further scrutiny.
- Check for any recent changes or anomalies in the IIS configuration or application pools that might suggest tampering or unauthorized access.
- Investigate any associated web shell activity or other indicators of compromise on the IIS server that could have facilitated the unauthorized use of AppCmd.
- Correlate this event with other security alerts or logs to identify any patterns or additional suspicious activities that might indicate a broader attack campaign.

### False positive analysis

- Routine administrative tasks using AppCmd may trigger alerts. If AppCmd is regularly used for legitimate configuration management, consider excluding these specific process executions by identifying the responsible user accounts or scheduled tasks.
- Automated scripts that manage IIS configurations and use AppCmd with similar arguments might be flagged. Review and whitelist these scripts by verifying their source and ensuring they are part of authorized operations.
- Development or testing environments where AppCmd is frequently used for debugging or configuration purposes can generate false positives. Implement exclusions for these environments by filtering based on hostnames or IP addresses.
- Security tools or monitoring solutions that simulate attacks for testing purposes might mimic the behavior detected by this rule. Coordinate with security teams to identify and exclude these benign activities from triggering alerts.

### Response and remediation

- Immediately isolate the affected IIS server from the network to prevent further unauthorized access or lateral movement.
- Terminate any suspicious processes related to appcmd.exe that are currently running on the server to halt any ongoing credential dumping activities.
- Change the passwords for all service accounts associated with the IIS application pools to prevent unauthorized access using potentially compromised credentials.
- Conduct a thorough review of IIS server logs and other relevant system logs to identify any additional indicators of compromise or unauthorized access attempts.
- Restore the IIS server from a known good backup taken before the incident, ensuring that all patches and security updates are applied.
- Implement network segmentation to limit access to the IIS server, allowing only necessary traffic and users to interact with it.
- Escalate the incident to the security operations center (SOC) or incident response team for further investigation and to determine if additional systems may be affected."""


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1003"
name = "OS Credential Dumping"
reference = "https://attack.mitre.org/techniques/T1003/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

