[metadata]
creation_date = "2023/08/23"
integration = ["endpoint", "auditd_manager"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2024/02/22"

[rule]
author = ["Elastic"]
building_block_type = "default"
description = """
Identify activity related where adversaries can add the 'hidden' flag to files to hide
them from the user in an attempt to evade detection.
"""
from = "now-119m"
interval = "60m"
index = ["logs-endpoint.events.*", "endgame-*", "auditbeat-*", "logs-auditd_manager.auditd-*"]
language = "eql"
license = "Elastic License v2"
name = "Hidden Files and Directories via Hidden Flag"
risk_score = 21
rule_id = "5124e65f-df97-4471-8dcb-8e3953b3ea97"
severity = "low"
tags = [
        "Domain: Endpoint",
        "OS: Linux",
        "OS: macOS",
        "Use Case: Threat Detection",
        "Tactic: Defense Evasion",
        "Rule Type: BBR",
        "Data Source: Elastic Defend",
        "Data Source: Elastic Endgame",
        "Data Source: Auditd Manager"
        ]
timestamp_override = "event.ingested"
type = "eql"
query = '''
file where event.type == "creation" and process.name == "chflags"
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1564"
name = "Hide Artifacts"
reference = "https://attack.mitre.org/techniques/T1564/"

[[rule.threat.technique.subtechnique]]
id = "T1564.001"
name = "Hidden Files and Directories"
reference = "https://attack.mitre.org/techniques/T1564/001/"

[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"
