[metadata]
bypass_bbr_timing = true
creation_date = "2024/06/22"
integration = ["aws"]
maturity = "production"
updated_date = "2025/01/10"

[rule]
author = ["Elastic"]
building_block_type = "default"
description = """
Identifies when an AWS RDS DB Snapshot is created. This can be used to evade defenses by allowing an attacker to bypass access controls
or cover their tracks by reverting an instance to a previous state. This is a [building block
rule](https://www.elastic.co/guide/en/security/current/building-block-rule.html) and does not generate alerts on
its own. It is meant to be used for correlation with other rules to detect suspicious activity. To generate alerts, create a
rule that uses this signal as a building block.
"""
false_positives = [
    """
    Legitimate manual or automated snapshots created for backups can trigger this rule. Ensure that the snapshots are authorized and align with your organization's policies.
    """,
]
from = "now-60m"
index = ["filebeat-*", "logs-aws.cloudtrail-*"]
interval = "10m"
language = "kuery"
license = "Elastic License v2"
name = "AWS RDS DB Snapshot Created"
risk_score = 21
rule_id = "68c5c9d1-38e5-48bb-b1b2-8b5951d39738"
severity = "low"
tags = [
    "Domain: Cloud",
    "Data Source: AWS",
    "Data Source: Amazon Web Services",
    "Data Source: AWS RDS",
    "Use Case: Asset Visibility",
    "Tactic: Defense Evasion",
    "Rule Type: BBR",
]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset: "aws.cloudtrail" and event.provider: "rds.amazonaws.com" 
    and event.action: ("CreateDBSnapshot" or "CreateDBClusterSnapshot") and event.outcome: "success" 
'''
note = """## Triage and analysis

> **Disclaimer**:
> This investigation guide was generated using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.

### Investigating AWS RDS DB Snapshot Created
AWS RDS DB Snapshots are backups of databases that ensure data recovery and continuity. However, adversaries may exploit this feature to bypass security controls or erase traces by reverting databases to previous states. The detection rule monitors successful snapshot creation events, serving as a foundational element to correlate with other alerts, thereby identifying potential misuse indicative of defense evasion tactics.

### Possible investigation steps

- Review the event details in AWS CloudTrail for the specific snapshot creation event, focusing on the event.provider as "rds.amazonaws.com" and event.action as "CreateDBSnapshot" or "CreateDBClusterSnapshot" to confirm the snapshot creation.
- Identify the IAM user or role (event.userIdentity) associated with the snapshot creation to determine if the action was performed by an authorized entity or if it appears suspicious.
- Check the event.sourceIPAddress to verify the origin of the request and assess if it aligns with expected network locations or if it indicates potential unauthorized access.
- Investigate the timing of the snapshot creation event in relation to other activities in the AWS environment to identify any unusual patterns or sequences that might suggest malicious intent.
- Correlate this snapshot creation event with other security alerts or logs to identify any concurrent or subsequent actions that could indicate an attempt to evade defenses or cover tracks.
- Review the AWS RDS instance's recent activity and configuration changes to assess if there have been any unauthorized modifications or access attempts that could be related to the snapshot creation.

### False positive analysis

- Routine database maintenance activities by authorized personnel can trigger snapshot creation events. To manage this, create exceptions for known maintenance schedules or specific user accounts responsible for these tasks.
- Automated backup solutions may regularly create snapshots as part of their operation. Identify and exclude these automated processes by filtering events based on the source or associated tags.
- Development and testing environments often involve frequent snapshot creation for testing purposes. Exclude these environments by using environment-specific identifiers or tags in your filtering criteria.
- Third-party integrations or services that require snapshot creation for functionality can generate false positives. Review and whitelist these services by their unique identifiers or API calls.
- Ensure that any exclusion rules are regularly reviewed and updated to reflect changes in infrastructure or operational practices to maintain security integrity.

### Response and remediation

- Immediately review the AWS CloudTrail logs to identify the source of the snapshot creation, including the IAM user or role involved, and verify if the action was authorized.
- Temporarily revoke or restrict permissions for the identified IAM user or role to prevent further unauthorized snapshot creations.
- Assess the integrity of the database by comparing the current state with the snapshot to ensure no unauthorized changes have been made.
- If unauthorized activity is confirmed, initiate a rollback to a known good state using a verified snapshot, ensuring that the compromised snapshot is not used.
- Notify the security operations team and relevant stakeholders about the incident for further investigation and potential escalation.
- Implement additional monitoring and alerting for unusual snapshot creation activities, focusing on deviations from normal patterns.
- Review and update IAM policies to enforce the principle of least privilege, ensuring only necessary permissions are granted for snapshot creation."""


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1578"
name = "Modify Cloud Compute Infrastructure"
reference = "https://attack.mitre.org/techniques/T1578/"
[[rule.threat.technique.subtechnique]]
id = "T1578.001"
name = "Create Snapshot"
reference = "https://attack.mitre.org/techniques/T1578/001/"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"
