[metadata]
creation_date = "2023/08/23"
integration = ["endpoint"]
maturity = "production"
updated_date = "2025/01/10"

[rule]
author = ["Elastic"]
building_block_type = "default"
description = "Identifies processes running with unusual extensions that are not typically valid for Windows executables.\n"
from = "now-119m"
index = ["logs-endpoint.events.process-*"]
interval = "60m"
language = "eql"
license = "Elastic License v2"
name = "Unusual Process Extension"
risk_score = 21
rule_id = "800e01be-a7a4-46d0-8de9-69f3c9582b44"
severity = "low"
tags = [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Defense Evasion",
    "Data Source: Elastic Defend",
    "Rule Type: BBR",
]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where host.os.type == "windows" and event.type == "start" and
  process.executable : "?*" and
  not process.name : ("*.exe", "*.com", "*.scr", "*.tmp", "*.dat") and
  not process.executable :
    (
      "MemCompression",
      "Registry",
      "vmmem",
      "vmmemWSL",
      "?:\\Program Files\\Dell\\SupportAssistAgent\\*.p5x",
      "?:\\Program Files\\Docker\\Docker\\com.docker.service",
      "?:\\Users\\*\\AppData\\Local\\Intel\\AGS\\Libs\\AGSRunner.bin",
      "\\Device\\Mup\\*\\Software Management\\Select.Html.dep",
      "?:\\DJJApplications\\MedicalRecords\\bin\\Select.Html.dep",
      "?:\\ProgramData\\Software Management\\Select.Html.dep",
      "?:\\Program Files (x86)\\EnCase Applications\\Examiner Service\\EnCase64\\enhkey.dll",
      "?:\\Program Files (x86)\\Panda Security\\WAC\\PSNAEInj64.dll",
      "?:\\Program Files (x86)\\Johnson Controls\\LicenseActivator\\crp32002.ngn"
    ) and
  not (
    (process.name : "C9632CF058AE4321B6B0B5EA39B710FE" and process.code_signature.subject_name == "Dell Inc") or
    (process.name : "*.upd" and process.code_signature.subject_name == "Bloomberg LP") or
    (process.name: "FD552E21-686E-413C-931D-3B82A9D29F3B" and process.code_signature.subject_name: "Adobe Inc.") or
    (process.name: "3B91051C-AE82-43C9-BCEF-0309CD2DD9EB" and process.code_signature.subject_name: "McAfee, LLC") or
    (process.name: "soffice.bin" and process.code_signature.subject_name: "The Document Foundation") or
    (process.name: ("VeeamVixProxy_*", "{????????-????-????-????-????????????}") and process.code_signature.subject_name: "Veeam Software Group GmbH") or
    (process.name: "1cv8p64.bin" and process.code_signature.subject_name: "LLC 1C-Soft") or
    (process.name: "AGSRunner.bin" and process.code_signature.subject_name: "Intel Corporation")
  )
'''
note = """## Triage and analysis

> **Disclaimer**:
> This investigation guide was created using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.

### Investigating Unusual Process Extension

In Windows environments, processes typically run with standard executable extensions like .exe or .com. Adversaries may exploit this by using non-standard extensions to disguise malicious activities, evading detection. The 'Unusual Process Extension' rule identifies such anomalies by flagging processes with uncommon extensions, excluding known legitimate cases, thus helping to uncover potential masquerading tactics.

### Possible investigation steps

- Review the process executable path and name to determine if it matches any known legitimate software or if it appears suspicious or unfamiliar.
- Check the process code signature details, if available, to verify the authenticity of the process and identify the publisher. Pay special attention to any discrepancies or unsigned executables.
- Investigate the parent process that initiated the unusual process to understand the context of its execution and assess if the parent process is legitimate or potentially compromised.
- Search for any related network activity or connections initiated by the process to identify potential communication with malicious or suspicious external hosts.
- Examine the file creation and modification timestamps of the process executable to determine if it aligns with expected software updates or installations.
- Cross-reference the process with threat intelligence sources to identify if it is associated with known malware or threat actors.
- Review system logs and other endpoint data for additional indicators of compromise or related suspicious activities that may provide further context to the alert.

### False positive analysis

- Processes with extensions like .p5x, .bin, or .dep from known software such as Dell SupportAssist, Intel AGS, or Docker may trigger false positives. Users can mitigate this by adding these specific paths to the exclusion list.
- Signed executables from trusted vendors like Dell Inc, Bloomberg LP, Adobe Inc, and McAfee, LLC may be flagged. Verify the code signature and add these to exceptions if they are legitimate.
- Processes related to software management or security tools, such as those from Veeam Software Group GmbH or Panda Security, might be incorrectly identified. Confirm their legitimacy and exclude them if necessary.
- Regularly review and update the exclusion list to include new legitimate software that may use uncommon extensions, ensuring the rule remains effective without generating unnecessary alerts.

### Response and remediation

- Isolate the affected system from the network to prevent further spread of potential malicious activity.
- Terminate any suspicious processes identified with unusual extensions that do not match known legitimate cases.
- Conduct a thorough scan of the affected system using updated antivirus and anti-malware tools to identify and remove any malicious files.
- Review and restore any altered system configurations or files to their original state, ensuring system integrity.
- Escalate the incident to the security operations team for further analysis and to determine if additional systems are affected.
- Implement application whitelisting to prevent execution of unauthorized or unusual file extensions in the future.
- Update and enhance endpoint detection and response (EDR) solutions to improve detection capabilities for similar masquerading tactics."""


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1036"
name = "Masquerading"
reference = "https://attack.mitre.org/techniques/T1036/"
[[rule.threat.technique.subtechnique]]
id = "T1036.008"
name = "Masquerade File Type"
reference = "https://attack.mitre.org/techniques/T1036/008/"



[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

