[metadata]
creation_date = "2023/07/06"
integration = ["windows", "endpoint"]
maturity = "production"
min_stack_comments = "Multiple field support in the New Terms rule type was added in Elastic 8.6"
min_stack_version = "8.6.0"
updated_date = "2023/09/20"
bypass_bbr_timing = true

[rule]
author = ["Elastic"]
description = """
Detects the execution of commands used to discover information about the system, which attackers may use after
compromising a system to gain situational awareness.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "kuery"
license = "Elastic License v2"
name = "Windows System Information Discovery"
risk_score = 21
rule_id = "51176ed2-2d90-49f2-9f3d-17196428b169"
severity = "low"
tags = ["Domain: Endpoint",
        "OS: Windows",
        "Use Case: Threat Detection",
        "Tactic: Discovery",
        "Rule Type: BBR",
        "Data Source: Elastic Defend"]
timestamp_override = "event.ingested"
type = "new_terms"
building_block_type = "default"

query = '''
host.os.type:windows and event.category:process and event.type:start and (
  process.name.caseless:"cmd.exe" and process.args:ver* or 
  process.name.caseless:("hostname.exe" or "systeminfo.exe") or 
  process.name.caseless:"wmic.exe" and process.args:("get" and "os")
)
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1082"
name = "System Information Discovery"
reference = "https://attack.mitre.org/techniques/T1082/"

[rule.threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"

[rule.new_terms]
field = "new_terms_fields"
value = ["user.id", "process.command_line"]

[[rule.new_terms.history_window_start]]
field = "history_window_start"
value = "now-14d"
