[metadata]
creation_date = "2023/07/11"
integration = ["endpoint"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2023/07/11"

[rule]
author = ["Elastic"]
building_block_type = "default"
description = """
Adversaries may use built-in applications to get a listing of local system or domain accounts and groups.
"""
from = "now-119m"
interval = "60m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Account or Group Discovery via Built-In Tools"
risk_score = 21
rule_id = "f638a66d-3bbf-46b1-a52c-ef6f39fb6caf"
severity = "low"
tags = ["Domain: Endpoint", "OS: Linux", "OS: macOS", "OS: Windows", "Use Case: Threat Detection", "Tactic: Discovery", "Rule Type: BBR"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type== "start" and
  ((
    ((process.name : "net.exe" or process.pe.original_file_name== "net.exe") or
      ((process.name : "net1.exe" or process.pe.original_file_name == "net1.exe") and not process.parent.name : "net.exe"))
      and process.args:("user", "localgroup", "group"))
    or process.name: ("groups","id")
    or (process.name : "dscl" and process.args : ("/Active Directory/*", "/Users*", "/Groups*"))
    or (process.name: "dscacheutil" and process.args:("user", "group"))
    or process.args:("/etc/passwd", "/etc/master.passwd", "/etc/sudoers")
    or (process.name: "getent" and process.args:("passwd", "group"))
    or (process.name:("dsquery.exe", "dsget.exe") and process.args:("*members*", "user"))
    or (process.name:"dsquery.exe" and process.args:"*filter*")
    or process.name:("quser.exe", "qwinsta.exe"))
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1069"
name = "Permission Groups Discovery"
reference = "https://attack.mitre.org/techniques/T1069/"
[[rule.threat.technique.subtechnique]]
id = "T1069.001"
name = "Local Groups"
reference = "https://attack.mitre.org/techniques/T1069/001/"
[[rule.threat.technique.subtechnique]]
id = "T1069.002"
name = "Domain Groups"
reference = "https://attack.mitre.org/techniques/T1069/002/"

[[rule.threat.technique]]
id = "T1087"
name = "Account Discovery"
reference = "https://attack.mitre.org/techniques/T1087/"
[[rule.threat.technique.subtechnique]]
id = "T1087.001"
name = "Local Account"
reference = "https://attack.mitre.org/techniques/T1087/001/"
[[rule.threat.technique.subtechnique]]
id = "T1087.002"
name = "Domain Account"
reference = "https://attack.mitre.org/techniques/T1087/002/"


[rule.threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"
