[metadata]
creation_date = "2023/10/11"
integration = ["github"]
maturity = "production"
min_stack_comments = "Multiple field support in the New Terms rule type was added in Elastic 8.6"
min_stack_version = "8.6.0"
updated_date = "2023/10/11"
bypass_bbr_timing = true

[rule]
author = ["Elastic"]
description = """
Detects a new repo interaction for a GitHub user not seen in the last 30 days.
"""
from = "now-9m"
index = ["logs-github.audit-*"]
language = "kuery"
license = "Elastic License v2"
name = "New Repo Interaction for GitHub User"
risk_score = 21
rule_id = "01c49712-25bc-49d2-a27d-d7ce52f5dc49"
severity = "low"
tags = ["Domain: Cloud",
        "Use Case: Threat Detection",
        "Tactic: Execution",
        "Rule Type: BBR",
        "Data Source: Github"
        ]
timestamp_override = "event.ingested"
type = "new_terms"
building_block_type = "default"

query = '''
event.dataset:"github.audit" and event.category:"configuration" and
github.repo:* and user.name:*
'''

[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1648"
name = "Serverless Execution"
reference = "https://attack.mitre.org/techniques/T1648/"


[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"


[rule.new_terms]
field = "new_terms_fields"
value = ["github.repo", "user.name"]

[[rule.new_terms.history_window_start]]
field = "history_window_start"
value = "now-30d"