[metadata]
creation_date = "2023/08/21"
integration = ["endpoint", "windows", "system"]
maturity = "production"
updated_date = "2025/01/10"
min_stack_version = "8.14.0"
min_stack_comments = "Breaking change at 8.14.0 for the Windows Integration."

[rule]
author = ["Elastic"]
building_block_type = "default"
description = """
Identifies use of at.exe to interact with the task scheduler on remote hosts. Remote task creations, modifications or
execution could be indicative of adversary lateral movement.
"""
from = "now-119m"
index = [
    "logs-endpoint.events.process-*",
    "winlogbeat-*",
    "logs-windows.*",
    "endgame-*",
    "logs-system.security*",
]
interval = "60m"
language = "eql"
license = "Elastic License v2"
name = "At.exe Command Lateral Movement"
risk_score = 21
rule_id = "b483365c-98a8-40c0-92d8-0458ca25058a"
severity = "low"
tags = [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Lateral Movement",
    "Data Source: Elastic Defend",
    "Rule Type: BBR",
    "Data Source: Elastic Endgame",
    "Data Source: System",
]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where host.os.type == "windows" and event.type == "start" and process.name : "at.exe" and process.args : "\\\\*"
'''
note = """## Triage and analysis

> **Disclaimer**:
> This investigation guide was created using generative AI technology and has been reviewed to improve its accuracy and relevance. While every effort has been made to ensure its quality, we recommend validating the content and adapting it to suit your specific environment and operational needs.

### Investigating At.exe Command Lateral Movement

The `at.exe` utility is a legacy Windows command-line tool used to schedule tasks on local or remote systems. Adversaries may exploit this tool to execute tasks on remote hosts, facilitating lateral movement within a network. The detection rule identifies suspicious use of `at.exe` by monitoring for its execution with arguments indicating remote task scheduling. This helps in pinpointing potential unauthorized task creations or modifications, which could signal malicious activity.

### Possible investigation steps

- Review the process execution details to confirm the use of at.exe, focusing on the process name and arguments, especially looking for remote task scheduling indicators such as "\\\\\\\\*".
- Identify the source host from which the at.exe command was executed and determine if it is a known and authorized system within the network.
- Investigate the target host(s) specified in the process arguments to assess if they are legitimate and expected targets for task scheduling from the source host.
- Check the user account associated with the at.exe execution to verify if it has the necessary permissions and if the activity aligns with the user's typical behavior.
- Examine the scheduled task details on the target host(s) to identify any unauthorized or suspicious tasks that may have been created or modified.
- Correlate this event with other security alerts or logs to identify any patterns or additional indicators of lateral movement or compromise within the network.

### False positive analysis

- Scheduled administrative tasks: Routine administrative tasks scheduled by IT departments using at.exe on remote systems can trigger this rule. To manage this, identify and document legitimate scheduled tasks and create exceptions for these specific processes.
- Automated software updates: Some software may use at.exe for automated updates or maintenance tasks across multiple systems. Verify the legitimacy of these updates and exclude them from the rule if they are confirmed to be safe.
- Backup operations: Backup solutions might leverage at.exe for scheduling backups on remote machines. Confirm the backup processes and whitelist these operations to prevent false positives.
- Monitoring and management tools: Certain network monitoring or management tools may utilize at.exe for legitimate purposes. Review these tools and their usage patterns, and exclude them if they are part of authorized network management activities.

### Response and remediation

- Immediately isolate the affected system from the network to prevent further lateral movement by the adversary.
- Terminate any suspicious processes related to `at.exe` on the affected system to halt unauthorized task execution.
- Review and remove any unauthorized scheduled tasks created via `at.exe` on both the local and remote systems.
- Conduct a thorough investigation of the affected system to identify any additional indicators of compromise or persistence mechanisms.
- Reset credentials for any accounts that were used to execute the `at.exe` command, especially if they have administrative privileges.
- Escalate the incident to the security operations center (SOC) or incident response team for further analysis and to determine the scope of the breach.
- Implement enhanced monitoring and logging for `at.exe` usage across the network to detect and respond to similar threats in the future."""


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1021"
name = "Remote Services"
reference = "https://attack.mitre.org/techniques/T1021/"


[rule.threat.tactic]
id = "TA0008"
name = "Lateral Movement"
reference = "https://attack.mitre.org/tactics/TA0008/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1053"
name = "Scheduled Task/Job"
reference = "https://attack.mitre.org/techniques/T1053/"
[[rule.threat.technique.subtechnique]]
id = "T1053.002"
name = "At"
reference = "https://attack.mitre.org/techniques/T1053/002/"

[[rule.threat.technique.subtechnique]]
id = "T1053.005"
name = "Scheduled Task"
reference = "https://attack.mitre.org/techniques/T1053/005/"



[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"

