[metadata]
bypass_bbr_timing = true
creation_date = "2023/10/23"
integration = ["system"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2023/10/23"

[rule]
author = ["Elastic"]
building_block_type = "default"
description = """
This rule monitors the syslog log file for messages related to instances of a tainted kernel module load. Rootkits often
leverage kernel modules as their main defense evasion technique. Detecting tainted kernel module loads is crucial for
ensuring system security and integrity, as malicious or unauthorized modules can compromise the kernel and lead to
system vulnerabilities or unauthorized access.
"""
from = "now-9m"
index = ["logs-system.auth-*"]
language = "kuery"
license = "Elastic License v2"
name = "Tainted Kernel Module Load"
risk_score = 21
rule_id = "05cad2fb-200c-407f-b472-02ea8c9e5e4a"
severity = "low"
tags = [
        "Domain: Endpoint",
        "OS: Linux",
        "Use Case: Threat Detection",
        "Tactic: Credential Access"
        ]
type = "kuery"
query = '''
host.os.type:linux and event.dataset:"system.syslog" and process.name:kernel and 
message:"module verification failed: signature and/or required key missing - tainting kernel"
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1547"
name = "Boot or Logon Autostart Execution"
reference = "https://attack.mitre.org/techniques/T1547/"

[[rule.threat.technique.subtechnique]]
id = "T1547.006"
name = "Kernel Modules and Extensions"
reference = "https://attack.mitre.org/techniques/T1547/006/"

[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

