[metadata]
creation_date = "2024/03/24"
integration = ["endpoint"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2024/03/27"
promotion = true

[rule]
author = ["Elastic"]
description = """
Generates a detection alert each time an Elastic Endpoint Security alert for ransomware are received. Enabling this rule allows you to
immediately begin investigating your Endpoint ransomware alerts. This rule identifies Endpoint Security ransomware preventions only, and does not include detection only alerts.
"""
enabled = true
from = "now-10m"
index = ["logs-endpoint.alerts-*"]
language = "kuery"
license = "Elastic License v2"
max_signals = 10000
name = "Ransomware - Prevented - Endpoint Security"
references = [
    "https://github.com/elastic/protections-artifacts/tree/main/ransomware",
    "https://docs.elastic.co/en/integrations/endpoint"
]
risk_score = 21
rule_id = "10f3d520-ea35-11ee-a417-f661ea17fbce"
rule_name_override = "message"
severity = "low"
tags = ["Data Source: Elastic Defend"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.kind:alert and event.module:(endpoint and not endgame) and event.code: ransomware and message: *prevention*
'''


[[rule.exceptions_list]]
id = "endpoint_list"
list_id = "endpoint_list"
namespace_type = "agnostic"
type = "endpoint"

[[rule.risk_score_mapping]]
field = "event.risk_score"
operator = "equals"
value = ""

[[rule.severity_mapping]]
field = "event.severity"
operator = "equals"
severity = "low"
value = "21"

[[rule.severity_mapping]]
field = "event.severity"
operator = "equals"
severity = "medium"
value = "47"

[[rule.severity_mapping]]
field = "event.severity"
operator = "equals"
severity = "high"
value = "73"

[[rule.severity_mapping]]
field = "event.severity"
operator = "equals"
severity = "critical"
value = "99"


