[metadata]
creation_date = "2025/09/26"
integration = []
maturity = "development"
updated_date = "2025/09/26"

[rule]
actions = []
author = ["468064154"]
description = "An example of an IP-matching rule for testing."
enabled = true
exceptions_list = []
false_positives = []
filters = []
from = "now-6m"
index = [
    "apm-*-transaction*",
    "auditbeat-*",
    "endgame-*",
    "filebeat-*",
    "logs-*",
    "packetbeat-*",
    "traces-apm*",
    "winlogbeat-*",
    "-*elastic-cloud-logs-*",
]
interval = "5m"
language = "kuery"
license = ""
max_signals = 100
name = "example IP rule"
references = []
related_integrations = []
required_fields = []
risk_score = 21
risk_score_mapping = []
rule_id = "2dff2577-9600-4e6d-98ed-d7a6ca8393cd"
setup = ""
severity = "low"
severity_mapping = []
tags = []
to = "now"
type = "query"

query = '''
destination.ip: "3.250.243.68"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1071"
name = "Application Layer Protocol"
reference = "https://attack.mitre.org/techniques/T1071/"
[[rule.threat.technique.subtechnique]]
id = "T1071.001"
name = "Web Protocols"
reference = "https://attack.mitre.org/techniques/T1071/001/"



[rule.threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"

[rule.meta]
kibana_siem_app_url = "https://home-lab.kb.europe-north1.gcp.elastic-cloud.com/app/security"

