[metadata]
creation_date = "2021/05/05"
maturity = "production"
updated_date = "2021/05/05"

[rule]
author = ["Elastic", "Austin Songer"]
description = "Identifies when threat actors tamper with S3 data management in Amazon Web Services"
false_positives = ["Unknown"]
from = "now-10m"
index = ["filebeat-*", "logs-aws*"]
interval = "10m"
language = "kuery"
license = "Elastic License v2"
name = "AWS S3 Data Management Tampering"
references = ["https://docs.aws.amazon.com/AmazonS3/latest/API/API_Operations.html"]
risk_score = 21
rule_id = "f3d8d0e1-5f9a-4afe-9722-d10bd28b18d2"
severity = "low"
tags = ["Elastic", "Cloud", "AWS", "Continuous Monitoring", "SecOps", "Asset Visibility"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset:aws.cloudtrail and event.provider:iam.amazonaws.com and 
  event.action:(PutBucketLogging or 
                PutBucketWebsite or 
                PutEncryptionConfiguration or 
                PutLifecycleConfiguration or 
                PutReplicationConfiguration or 
                ReplicateObject or 
                RestoreObject) and 
   event.outcome:success
'''

[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
name = "Transfer Data to Cloud Account"
reference = "https://attack.mitre.org/techniques/T1537/"
id = "T1537"


[rule.threat.tactic]
name = "Exfiltration"
reference = "https://attack.mitre.org/tactics/TA0010/"
id = "TA0010"
