[metadata]
creation_date = "2021/06/06"
maturity = "production"
updated_date = "2021/06/06"

[rule]
author = ["Elastic"]
description = """
Identifies the export of an Amazon Relational Database Service (RDS) Aurora database snapshot.
"""
false_positives = [
    """
    Export Snapshots may be done by a system or network administrator. 
    """,
]
from = "now-60m"
index = ["filebeat-*", "logs-aws*"]
interval = "10m"
language = "kuery"
license = "Elastic License v2"
name = "AWS RDS Snapshot Export"
note = """## Config

The AWS Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."""
references = [
    "https://docs.aws.amazon.com/AmazonRDS/latest/APIReference/API_StartExportTask.html",
]
risk_score = 21
rule_id = "119c8877-8613-416d-a98a-96b6664ee73a5"
severity = "low"
tags = ["Elastic", "Cloud", "AWS", "Continuous Monitoring", "SecOps", "Asset Visibility"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset:aws.cloudtrail and 
event.provider:rds.amazonaws.com and 
event.action: 
    (
    StartExportTask
    ) and 
event.outcome:success
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
id = "TA0010"
name = "Exfiltration"
reference = "https://attack.mitre.org/tactics/TA0010"
