[metadata]
creation_date = "2021/05/05"
maturity = "production"
updated_date = "2021/05/05"

[rule]
author = ["Elastic", "Austin Songer"]
description = """
Detects threat actors making configuration change to EC2 security groups. Threat actors may be able to maintain
persistence, exfiltrate, and pivot in a AWS environment.
"""
false_positives = ["Unknown"]
from = "now-30m"
index = ["filebeat-*", "logs-aws*"]
interval = "10m"
language = "kuery"
license = "Elastic License v2"
name = "AWS EC2 Security Group Configuration Change Detection"
note = """## Config

The AWS Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."""
references = ["https://docs.aws.amazon.com/AWSEC2/latest/WindowsGuide/ec2-security-groups.html"]
risk_score = 21
rule_id = "29052c19-ff3e-42fd-8363-7be14d7c5469"
severity = "low"
tags = ["Elastic", "Cloud", "AWS", "Continuous Monitoring", "SecOps", "Network Security"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset:aws.cloudtrail and event.provider:iam.amazonaws.com and 
    event.action:(AuthorizeSecurityGroupEgress or 
                           CreateSecurityGroup or 
                           ModifyInstanceAttribute or
                           ModifySecurityGroupRules or
                           RevokeSecurityGroupEgress or
                           RevokeSecurityGroupIngress) and 
    event.outcome:success
'''


[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
name = "Persistence"
id = "TA0003"
reference = "https://attack.mitre.org/tactics/TA0003/"
[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
name = "Defense Evasion"
id = "TA0005"
reference = "https://attack.mitre.org/tactics/TA0005/"
