[metadata]
creation_date = "2023/06/28"
integration = ["cloud_defend"]
maturity = "production"
min_stack_comments = "New Integration: Cloud Defend"
min_stack_version = "8.8.0"
updated_date = "2023/06/28"

[rule]
author = ["Elastic"]
description = "This rule detects the use of system search utilities like grep and find to search for AWS credentials inside a container. Unauthorized access to these sensitive files could lead to further compromise of the container environment or facilitate a container breakout to the underlying cloud environment."
from = "now-6m"
index = ["logs-cloud_defend*"]
interval = "5m"
language = "eql"
license = "Elastic License v2"
name = "AWS Credentials Searched For Inside A Container"
tags = ["Data Source: Elastic Defend for Containers", "Domain: Container", "OS: Linux", "Use Case: Threat Detection", "Tactic: Credential Access"]
references = [
    "https://sysdig.com/blog/threat-detection-aws-cloud-containers/",
]
risk_score = 47
rule_id = "d0b0f3ed-0b37-44bf-adee-e8cb7de92767"
severity = "medium"
timestamp_override = "event.ingested"
type = "eql"

query = """
process where event.module == "cloud_defend" and     
  event.type == "start" and
  
/*account for tools that execute utilities as a subprocess, in this case the target utility name will appear as a process arg*/
(process.name : ("grep", "egrep", "fgrep", "find", "locate", "mlocate") or process.args : ("grep", "egrep", "fgrep", "find", "locate", "mlocate")) and 
process.args : ("*aws_access_key_id*", "*aws_secret_access_key*", "*aws_session_token*", "*accesskeyid*", "*secretaccesskey*", "*access_key*", "*.aws/credentials*")
"""

[[rule.threat]]
framework = "MITRE ATT&CK"

  [rule.threat.tactic]
  id = "TA0006"
  reference = "https://attack.mitre.org/tactics/TA0006/"
  name = "Credential Access"

  [[rule.threat.technique]]
  id = "T1552"
  reference = "https://attack.mitre.org/techniques/T1552/"
  name = "Unsecured Credentials"

    [[rule.threat.technique.subtechnique]]
    id = "T1552.001"
    reference = "https://attack.mitre.org/techniques/T1552/001/"
    name = "Credentials In Files"
