[metadata]
creation_date = "2026/02/06"
integration = ["cloud_defend"]
maturity = "production"
min_stack_comments = "Defend for Containers integration was re-introduced in 9.3.0"
min_stack_version = "9.3.0"
updated_date = "2026/02/06"

[rule]
author = ["Elastic"]
description = """
This rule detects the execution of the "id", "whoami", "capsh", "getcap", and "lsns" commands inside a container.
These commands are used to enumerate the privilege boundary of the container, which can be used by an adversary to
gain information about the container and the services running inside it.
"""
false_positives = [
    """
    There is a potential for false positives if the "id", "whoami", "capsh", "getcap", or "lsns" commands are used for legitimate purposes,
    such as debugging or troubleshooting. For example, an operator may use the "id" command to verify the identity of the current user, or
    the "whoami" command to verify the current user. It is important to investigate any alerts generated by this rule to determine if they
    are indicative of malicious activity or part of legitimate container activity.
    """,
]
from = "now-6m"
index = ["logs-cloud_defend.process*"]
interval = "5m"
language = "eql"
license = "Elastic License v2"
name = "Privilege Boundary Enumeration from Interactive Process Detected via Defend for Containers"
risk_score = 21
rule_id = "737626a2-4dca-4195-8ecd-68ef96fd1bad"
severity = "low"
tags = [
    "Data Source: Elastic Defend for Containers",
    "Domain: Container",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Discovery",
]
timestamp_override = "event.ingested"
type = "eql"
query = '''
process where host.os.type == "linux" and event.type == "start" and event.action == "exec" and (
  (process.name in ("id", "whoami", "capsh", "getcap", "lsns")) or
  (process.args in (
     "id", "/bin/id", "/usr/bin/id", "/usr/local/bin/id",
     "whoami", "/bin/whoami", "/usr/bin/whoami", "/usr/local/bin/whoami",
     "capsh", "/bin/capsh", "/usr/bin/capsh", "/usr/local/bin/capsh",
     "getcap", "/bin/getcap", "/usr/bin/getcap", "/usr/local/bin/getcap",
     "lsns", "/bin/lsns", "/usr/bin/lsns", "/usr/local/bin/lsns"
   ) and
    /* default exclusion list to not FP on default multi-process commands */
    not process.args in (
      "man", "/bin/man", "/usr/bin/man", "/usr/local/bin/man",
      "chmod", "/bin/chmod", "/usr/bin/chmod", "/usr/local/bin/chmod",
      "chown", "/bin/chown", "/usr/bin/chown", "/usr/local/bin/chown"
    )
  )
) and container.id like "?*" and process.interactive == true
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1613"
name = "Container and Resource Discovery"
reference = "https://attack.mitre.org/techniques/T1613/"

[[rule.threat.technique]]
id = "T1082"
name = "System Information Discovery"
reference = "https://attack.mitre.org/techniques/T1082/"

[rule.threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"
