[metadata]
creation_date = "2023/04/26"
integration = ["cloud_defend"]
maturity = "production"
min_stack_comments = "New Integration: Cloud Defend"
min_stack_version = "8.8.0"
updated_date = "2023/04/26"

[rule]
author = ["Elastic"]
description = "This rule detects when an interactive shell is spawned inside a running container. This could indicate an attacker's attempt to gain unauthorized access to the container."
false_positives = ["""
  Legitimate users and processes, such as system administration tools, may utilize shell binaries inside a container resulting in false positives.
  """
]
from = "now-360s"
index = [ "logs-cloud_defend*" ]
interval = "5m"
language = "eql"
license = "Elastic License v2"
name = "Interactive Shell Spawned From Inside A Container"
tags = [
  "Elastic",
  "Host",
  "Linux",
  "Container",
  "Threat Detection",
  "Execution"
]
references = [ ]
risk_score = 47
rule_id = "8d3d0794-c776-476b-8674-ee2e685f6470"
severity = "medium"
type = "eql"

query = """
process where process.entry_leader.entry_meta.type== "container" and
event.type== "start" and event.action== "fork" and event.action== "exec" and not event.action== "end" 
and process.entry_leader.same_as_process== false and
(
(process.name: "*sh" and process.args: ("-i", "*sh")) or
/* account for tools like busybox, coreutils that package various utilities into a single executable*/
/* this also captures netcat reverse shell connections*/
process.args: ("*/*sh*")
)
"""

[[rule.threat]]
framework = "MITRE ATT&CK"

  [rule.threat.tactic]
  id = "TA0002"
  reference = "https://attack.mitre.org/tactics/TA0002/"
  name = "Execution"

  [[rule.threat.technique]]
  id = "T1059"
  reference = "https://attack.mitre.org/techniques/T1059/"
  name = "Command and Scripting Interpreter"

    [[rule.threat.technique.subtechnique]]
    id = "T1059.004"
    reference = "https://attack.mitre.org/techniques/T1059/004/"
    name = "Unix Shell"
