{"id":"31ae6bf0-8dbb-40fc-9c80-5987a4fc20bf","updated_at":"2025-08-29T10:55:32.959Z","updated_by":"1305697028","created_at":"2025-08-29T10:55:32.959Z","created_by":"1305697028","name":"Test Rule UUID","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"test rule","risk_score":50,"severity":"low","output_index":"","author":[],"false_positives":[],"from":"now-6m","rule_id":"be1c67d1-8557-4cdf-9ea1-033feb948209","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[{"id":"5b2bf431-724e-4cf0-a1d3-43f75a57b9bf","list_id":"test-exc-1756464833","type":"detection","namespace_type":"single"}],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["logs-*"],"query":"*:*","actions":[]}
{"_version":"WzUwNjUsMV0=","created_at":"2025-08-29T10:53:58.964Z","created_by":"1305697028","description":"test","id":"5b2bf431-724e-4cf0-a1d3-43f75a57b9bf","immutable":false,"list_id":"test-exc-1756464833","name":"Test Exception List","namespace_type":"single","os_types":[],"tags":[],"tie_breaker_id":"d022c8d7-3762-4c4d-91ad-dbac1a7edcfd","type":"detection","updated_at":"2025-08-29T10:53:58.964Z","updated_by":"1305697028","version":1}
{"exported_count":2,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":1,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
