[metadata]
creation_date = ""
maturity = "development"
updated_date = ""

[rule]
author = []
description = """
This rule is triggered when a DNS request is made for a domain in the list of typosquatting domains generated by
dnstwist. Adversaries may register homonym or homoglyph domains for the organization that they're targeting before
sending a phishing lure to a user in an attempt to infect their endpoint with malware or steal credentials.
"""
from = "now-10m"
index = ["packetbeat-*", "winlogbeat-*"]
interval = "9m"
language = "kuery"
license = "Elastic License v2"
name = "DNS Request for Typosquatting Domain"
note = """## Config

- Packetbeat or Winlogbeat must be configured to log DNS request events to be compatible with this rule.


## Triage and Analysis

- Determine the reason that the DNS request was made by the affected endpoint. For example, did the user visit the domain
after receiving a phishing email or did they mistype one of the organization's registered domains?
- Take appropriate security measures when investigating the domain in question, as it may host malware or an attacker
may be monitoring for potential victims visiting the domain. For example, Use open source intelligence such as the
WHOIS domain database to obtain information about the domain or interact with it using a malware sandbox service that
is segmented from any of your production systems.
"""
references = []
risk_score = 73
rule_id = ""
severity = "high"
tags = ["Elastic", "Network", "Continuous Monitoring", "SecOps", "Monitoring"]
timeline_id = "495ad7a7-316e-4544-8a0f-9c098daee76e"
timeline_title = "Generic Threat Match Timeline"
type = "threat_match"

threat_index = [ "dnstwist-*"]
threat_indicator_path = ""
threat_language = "kuery"

threat_query = "dns.question.registered_domain:*"

query = """
dns.question.registered_domain:*
"""

[[rule.threat_mapping]]
[[rule.threat_mapping.entries]]
field = "dns.question.registered_domain"
type = "mapping"
value = "dns.question.registered_domain"
