[metadata]
creation_date = "2025/04/07"
maturity = "development"
updated_date = "2025/04/07"

[rule]
index = [“logs-*”]
enabled = “true”
author = ["test"]
description = "derer"
language = "kuery"
name = "rere"
risk_score = 50
rule_id = "4ed8e743-3af3-4503-b710-497c16a53ed9"
severity = "high"
type = "query"

query = '''
event.category : "network"
'''

[[exceptions]]
[exceptions.container]
description = "Dac Vuln Scanners"
list_id = "dbc9b368-5d39-41fa-9a16-bfcb995fc866"
name = "vulnerability_scanners"
namespace_type = "single"
tags = []
type = "detection"

[[exceptions.items]]
comments = []
description = "Exception list item"
list_id = "dbc9b368-5d39-41fa-9a16-bfcb995fc866"
item_id = "7c823cd0-ca30-46ba-af35-3633219eed1f"
name = "qualys_scanners"
namespace_type = "single"
tags = []
type = "simple"

[[exceptions.items.entries]]
field = "source.ip"
type = "match"
operator = "included"
value = "192.168.1.10"


