[metadata]
creation_date = "2024/04/10"
integration = ["aws"]
maturity = "production"
min_stack_comments = "AWS integration breaking changes, bumping version to ^2.0.0"
min_stack_version = "8.3.0"
updated_date = "2024/04/10"

[rule]
author = ["Elastic"]
description = """
Identifies the first occurrence of a user identity in AWS sending `GetPassword` requests to an EC2 instance with an
assumed role. An attacker could create an EC2 instance and attach an IAM role that can then be accessed to steal the IAM
role credentials from the metadata endpoint.
"""
from = "now-9m"
index = ["filebeat-*", "logs-aws.cloudtrail*"]
language = "kuery"
license = "Elastic License v2"
name = "First Occurrence of User Identity Sending `GetPassword` Requests to EC2 Instance"
references = [
    "https://cloud.hacktricks.xyz/pentesting-cloud/aws-security/aws-privilege-escalation/aws-ec2-privesc",
]
risk_score = 47
rule_id = "8446517c-f789-11ee-8ad0-f661ea17fbce"
severity = "medium"
tags = [
    "Domain: Cloud",
    "Data Source: AWS",
    "Data Source: Amazon Web Services",
    "Data Source: Amazon EC2",
    "Use Case: Identity and Access Audit",
    "Resources: Investigation Guide",
    "Tactic: Credential Access",
]
timestamp_override = "event.ingested"
type = "new_terms"

query = '''
event.dataset: aws.cloudtrail
    and event.provider: "ec2.amazonaws.com" and event.action: "GetPasswordData"
    and aws.cloudtrail.user_identity.type: "AssumedRole"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1552"
name = "Unsecured Credentials"
reference = "https://attack.mitre.org/techniques/T1552/"
[[rule.threat.technique.subtechnique]]
id = "T1552.005"
name = "Cloud Instance Metadata API"
reference = "https://attack.mitre.org/techniques/T1552/005/"



[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

[rule.new_terms]
field = "new_terms_fields"
value = ["aws.cloudtrail.user_identity.session_context.session_issuer.arn"]
[[rule.new_terms.history_window_start]]
field = "history_window_start"
value = "now-7d"


