[metadata]
creation_date = "2024/04/20"
integration = ["aws"]
maturity = "production"
min_stack_comments = "AWS integration breaking changes, bumping version to ^2.0.0"
min_stack_version = "8.9.0"
updated_date = "2024/04/20"

[rule]
author = ["Elastic"]
description = """
Identifies when an AWS IAM Roles Anywhere Trust Anchor with an external certificate authority is created. AWS Roles
Anywhere profiles are legitimate profiles that can be created by administrators to allow access from any location. This
rule detects when a trust anchor is created with an external certificate authority that is not managed by AWS
Certificate Manager Private Certificate Authority (ACM PCA). Adversaries may accomplish this to maintain persistence in
the environment.
"""
false_positives = [
    """
    AWS IAM Roles Anywhere Trust Anchors are legitimate profiles that can be created by administrators to allow access
    from any location. Ensure that the trust anchor is created by a legitimate administrator and that the external
    certificate authority is authorized.
    """,
]
from = "now-30m"
index = ["filebeat-*", "logs-aws.cloudtrail-*"]
interval = "10m"
language = "kuery"
license = "Elastic License v2"
name = "AWS IAM Roles Anywhere Trust Anchor with External Certificate Authority Created"
references = [
    "https://docs.aws.amazon.com/rolesanywhere/latest/userguide/introduction.html",
    "https://docs.datadoghq.com/security/default_rules/cloudtrail-aws-iam-roles-anywhere-trust-anchor-created/",
    "https://ermetic.com/blog/aws/keep-your-iam-users-close-keep-your-third-parties-even-closer-part-1/",
]
risk_score = 21
rule_id = "71de53ea-ff3b-11ee-b572-f661ea17fbce"
severity = "low"
tags = [
    "Domain: Cloud",
    "Data Source: AWS",
    "Data Source: Amazon Web Services",
    "Data Source: AWS IAM",
    "Use Case: Identity and Access Audit",
    "Tactic: Persistence",
]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset: "aws.cloudtrail"
    and event.provider: rolesanywhere.amazonaws.com and event.action: CreateTrustAnchor and event.outcome: success
    and not aws.cloudtrail.request_parameters: *sourceType=AWS_ACM_PCA*
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1098"
name = "Account Manipulation"
reference = "https://attack.mitre.org/techniques/T1098/"
[[rule.threat.technique.subtechnique]]
id = "T1098.003"
name = "Additional Cloud Roles"
reference = "https://attack.mitre.org/techniques/T1098/003/"



[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

