[metadata]
creation_date = "2025/08/30"
integration = []
maturity = "production"
updated_date = "2025/08/30"

[rule]
actions = []
author = ["SOC"]
description = "One of the Windows Eventlogs has been cleared."
enabled = false
false_positives = [
    "Rollout of log collection agents (the setup routine often includes a reset of the local Eventlog)",
    "System provisioning (system reset before the golden image creation)",
]
from = "now-540s"
interval = "5m"
language = "esql"
license = ""
max_signals = 100
name = "Test02 - Windows Event Log Modified"
references = []
related_integrations = []
required_fields = []
risk_score = 47
risk_score_mapping = []
rule_id = "c18028f5-93b2-4f31-ac62-4680686cd707"
setup = ""
severity = "medium"
severity_mapping = []
tags = []
to = "now"
type = "esql"

query = '''
from logs-system.*, logs-windows.* metadata _id,_index,_version |
where event.code in ("104","517","1102") |
KEEP *
'''


[[rule.exceptions_list]]
id = "16dc0d49-cc0d-4967-942e-defa0f48f13a"
list_id = "3dc1a40f-0c64-4c69-98cf-cc7376ac5ce4"
namespace_type = "single"
type = "detection"

[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1070"
name = "Indicator Removal"
reference = "https://attack.mitre.org/techniques/T1070/"
subtechnique = []


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[rule.alert_suppression]
group_by = ["host.name"]
missing_fields_strategy = "suppress"

[rule.meta]
from = "4m"
kibana_siem_app_url = ""

[rule.alert_suppression.duration]
unit = "h"
value = 24

