[metadata]
creation_date = "2025/08/25"
integration = []
maturity = "production"
updated_date = "2025/08/25"

[rule]
actions = []
author = ["SOC"]
description = "Rule referencing timeline template"
enabled = false
false_positives = []
from = "now-540s"
interval = "5m"
language = "esql"
license = ""
max_signals = 100
name = "Test03 - Timeline Template Rule"
references = []
related_integrations = []
required_fields = []
risk_score = 47
risk_score_mapping = []
rule_id = "f5d1e8c2-1f77-4d7d-8c2e-123456789abc"
setup = ""
severity = "medium"
severity_mapping = []
tags = []
to = "now"
type = "esql"

query = '''
from logs-system.*, logs-windows.* metadata _id,_index,_version |
where event.code in ("104","517","1102") |
KEEP *
'''

timeline_id = "9f042e4d-9833-42ce-b90d-0da6a7181709"
timeline_title = "testtemplate"

[[rule.exceptions_list]]
id = "7a1e3121-45cb-4f19-9f11-1234567890ab"
list_id = "3dc1a40f-0c64-4c69-98cf-cc7376ac5ce4"
namespace_type = "single"
type = "detection"

[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1070"
name = "Indicator Removal"
reference = "https://attack.mitre.org/techniques/T1070/"
subtechnique = []

[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

[rule.alert_suppression]
group_by = ["host.name"]
missing_fields_strategy = "suppress"

[rule.meta]
from = "4m"
kibana_siem_app_url = ""

[rule.alert_suppression.duration]
unit = "h"
value = 24
