{"id":"8eacfc42-882b-480f-a66e-809886873289","updated_at":"2025-08-13T15:34:52.935Z","updated_by":"841510929","created_at":"2025-08-13T15:34:52.935Z","created_by":"841510929","name":"Test Anomalous Linux network activity","tags":["machine learning","Linux"],"interval":"5m","enabled":true,"revision":0,"description":"Generates alerts when the job discovers anomalies over 70","risk_score":70,"severity":"high","note":"Shut down the internet.","output_index":"","author":[],"false_positives":[],"from":"now-6m","rule_id":"ml_linux_network_high_threshold","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"This rule requires data coming in from Elastic Defend.","type":"machine_learning","anomaly_threshold":70,"machine_learning_job_id":["linux_anomalous_network_activity_ecs"],"actions":[]}
{"id":"9aa515af-9da8-4c92-9526-a4459ef3cce0","updated_at":"2025-08-13T15:35:43.923Z","updated_by":"841510929","created_at":"2025-08-13T15:35:43.923Z","created_by":"841510929","name":"Test rundll32.exe network connection","tags":["EQL","Windows","rundll32.exe"],"interval":"5m","enabled":true,"revision":0,"description":"Unusual rundll32.exe network connection","risk_score":21,"severity":"low","output_index":"","author":[],"false_positives":[],"from":"now-6m","index": ["logs-*"],"rule_id":"eql-outbound-rundll32-connections","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[{"name":"event.type","type":"keyword","ecs":true},{"name":"process.args","type":"keyword","ecs":true},{"name":"process.args_count","type":"long","ecs":true},{"name":"process.entity_id","type":"keyword","ecs":true},{"name":"process.name","type":"keyword","ecs":true},{"name":"process.pe.original_file_name","type":"keyword","ecs":true}],"setup":"","type":"eql","language":"eql","query":"sequence by process.entity_id with maxspan=2h [process where event.type in (\"start\", \"process_started\") and (process.name == \"rundll32.exe\" or process.pe.original_file_name == \"rundll32.exe\") and ((process.args == \"rundll32.exe\" and process.args_count == 1) or (process.args != \"rundll32.exe\" and process.args_count == 0))] [network where event.type == \"connection\" and (process.name == \"rundll32.exe\" or process.pe.original_file_name == \"rundll32.exe\")]","actions":[]}
{"id":"7874c12b-ccde-4aa6-8176-1c34caddec57","updated_at":"2025-08-13T15:32:57.909Z","updated_by":"841510929","created_at":"2025-08-13T15:32:57.909Z","created_by":"841510929","name":"Test Windows server prml-19","tags":["Brute force"],"interval":"2m","enabled":true,"revision":0,"description":"Detects when there are 20 or more failed login attempts from the same IP address with a 2 minute time frame.","risk_score":30,"severity":"low","output_index":"","author":[],"false_positives":[],"from":"now-180s","rule_id":"liv-win-ser-logins","max_signals":100,"risk_score_mapping":[],"severity_mapping":[{"field":"source.geo.city_name","operator":"equals","severity":"low","value":"Manchester"},{"field":"source.geo.city_name","operator":"equals","severity":"medium","value":"London"},{"field":"source.geo.city_name","operator":"equals","severity":"high","value":"Birmingham"},{"field":"source.geo.city_name","operator":"equals","severity":"critical","value":"Wallingford"}],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[{"id":"int-ips","list_id":"int-ips","type":"detection","namespace_type":"single"}],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[{"name":"source.ip","type":"ip","ecs":true}],"setup":"","type":"threshold","language":"kuery","index":["winlogbeat-*"],"query":"host.name:prml-19 and event.category:authentication and event.outcome:failure","threshold":{"field":["source.ip"],"value":20},"actions":[]}
{"id":"f0ab157a-0fe4-4130-b5d3-7885fb715ce1","updated_at":"2025-08-13T15:36:09.971Z","updated_by":"841510929","created_at":"2025-08-13T15:36:09.971Z","created_by":"841510929","name":"Test Bad IP threat match","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Checks for bad IP addresses listed in the ip-threat-list index","risk_score":50,"severity":"medium","output_index":"","author":[],"false_positives":[],"from":"now-6m","rule_id":"4c589d81-2622-4036-8cc7-372ea8f0e038","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"threat_language": "kuery","to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[{"name":"destination.ip","type":"ip","ecs":true},{"name":"destination.port","type":"long","ecs":true},{"name":"host.ip","type":"ip","ecs":true}],"setup":"","type":"threat_match","language":"kuery","index":["packetbeat-*"],"query":"destination.ip:* or host.ip:*","threat_query":"*:*","threat_mapping":[{"entries":[{"field":"destination.ip","type":"mapping","value":"destination.ip"},{"field":"destination.port","type":"mapping","value":"destination.port"}]},{"entries":[{"field":"source.ip","type":"mapping","value":"host.ip"}]}],"threat_index":["ip-threat-list"],"threat_indicator_path":"threat.indicator","actions":[]}
{"id":"5fd19059-b243-41f4-9b15-e4e7e7f51552","updated_at":"2025-08-13T15:36:30.005Z","updated_by":"841510929","created_at":"2025-08-13T15:36:30.005Z","created_by":"841510929","name":"Test New User IP Detected","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Detects a user associated with a new IP address","risk_score":21,"severity":"medium","output_index":"","author":[],"false_positives":[],"from":"now-6m","rule_id":"2390c9dd-ad90-4af6-97a4-1d607ba0f092","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[{"name":"user.id","type":"keyword","ecs":true},{"name":"source.ip","type":"ip","ecs":true}],"setup":"","type":"new_terms","query":"host.name:prml-19 and event.category:authentication and event.outcome:failure","new_terms_fields":["user.id","source.ip"],"history_window_start":"now-30d","index":["auditbeat*"],"language":"kuery","actions":[]}
{"id":"b150a992-97de-45fa-bc10-aa733ff62c8a","updated_at":"2025-08-13T15:38:46.127Z","updated_by":"841510929","created_at":"2025-08-13T15:31:19.397Z","created_by":"841510929","name":"Test MS Office child process","tags":["child process","ms office"],"interval":"1h","enabled":true,"revision":0,"description":"Process started by MS Office program - possible payload","risk_score":50,"severity":"low","output_index":"","author":[],"false_positives":[],"from":"now-70m","index": ["logs-*"],"rule_id":"process_started_by_ms_office_program","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[{"package":"o365","version":"^2.3.2"}],"required_fields":[{"name":"process.parent.name","type":"keyword","ecs":true}],"setup":"","type":"query","language":"kuery","query":"process.parent.name:EXCEL.EXE or process.parent.name:MSPUB.EXE or process.parent.name:OUTLOOK.EXE or process.parent.name:POWERPNT.EXE or process.parent.name:VISIO.EXE or process.parent.name:WINWORD.EXE","filters":[{"query":{"match":{"event.action":{"type":"phrase","query":"Process Create (rule: ProcessCreate)"}}}}],"actions":[]}
{"id":"36aeca4e-e6f8-4f61-a634-6b138b6c8ffe","updated_at":"2025-08-13T15:38:49.137Z","updated_by":"841510929","created_at":"2025-08-13T15:38:03.717Z","created_by":"841510929","name":"Test Suppression MS Office child process","tags":["child process","ms office"],"interval":"1h","enabled":true,"revision":0,"description":"Process started by MS Office program - possible payload","risk_score":50,"severity":"low","output_index":"","author":[],"false_positives":[],"from":"now-70m","index": ["logs-*"],"rule_id":"process_started_by_ms_office_program_supression","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","query":"process.parent.name:EXCEL.EXE or process.parent.name:MSPUB.EXE or process.parent.name:OUTLOOK.EXE or process.parent.name:POWERPNT.EXE or process.parent.name:VISIO.EXE or process.parent.name:WINWORD.EXE","filters":[{"query":{"match":{"event.action":{"type":"phrase","query":"Process Create (rule: ProcessCreate)"}}}}],"alert_suppression":{"group_by":["process.parent.name"],"duration":{"value":5,"unit":"h"},"missing_fields_strategy":"suppress"},"actions":[]}
{"id":"720452ee-5d99-4c95-b418-69c9f43798aa","updated_at":"2025-08-13T15:38:52.044Z","updated_by":"841510929","created_at":"2025-08-13T15:37:21.673Z","created_by":"841510929","name":"Test Find Excel events","tags":[],"interval":"5m","enabled":true,"revision":0,"description":"Find Excel events","risk_score":21,"severity":"low","output_index":"","author":[],"false_positives":[],"from":"now-360s","rule_id":"7e0f6dae-5847-465f-89e9-a6de0e9ef918","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[{"name":"process.parent.name","type":"keyword","ecs":true}],"setup":"","type":"esql","language":"esql","query":"from auditbeat-8.10.2 METADATA _id, _version, _index | KEEP process.parent.name | where process.parent.name == \"EXCEL.EXE\"","actions":[]}
