{
  "packages": [
    {
      "date": "15 Feb 2023",
      "new_rules": 29,
      "note": "This release includes new rules for Windows and Linux endpoints. Additionally, significant rule tuning for Windows and Linux rules has been added for better rule efficacy. A Google Workspace promotional rule was added to promote security alerts from the Alert Center. Machine learning rules related to failed logins have been adjusted for better scoring results. Additional investigation guides have been added for Windows and Linux rules. A New Terms rule has been created to identify loaded Windows drivers not seen in the last 30 days. A guided onboarding rule has been created to assist new SIEM users with getting started.",
      "update_version": "8.7.1",
      "updated_rules": 110,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-8-7-1-prebuilt-rules-8-7-1-summary.html"
    },
    {
      "date": "15 Feb 2023",
      "new_rules": 28,
      "note": "This release includes new rules for Windows and Linux endpoints. Additionally, significant rule tuning for Windows and Linux rules has been added for better rule efficacy. A Google Workspace promotional rule was added to promote security alerts from the Alert Center. Machine learning rules related to failed logins have been adjusted for better scoring results. Additional investigation guides have been added for Windows and Linux rules. A New Terms rule has been created to identify loaded Windows drivers not seen in the last 30 days.",
      "update_version": "8.6.1",
      "updated_rules": 110,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-8-6-1-prebuilt-rules-8-6-1-summary.html"
    },
    {
      "date": "14 Feb 2023",
      "new_rules": 27,
      "note": "This release includes new rules for Windows and Linux endpoints. Additionally, significant rule tuning for Windows and Linux rules has been added for better rule efficacy. A Google Workspace promotional rule was added to promote security alerts from the Alert Center. Machine learning rules related to failed logins have been adjusted for better scoring results. Additional investigation guides have been added for Windows and Linux rules.",
      "update_version": "8.5.1",
      "updated_rules": 110,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-8-5-1-prebuilt-rules-8-5-1-summary.html"
    },
    {
      "date": "14 Feb 2023",
      "new_rules": 27,
      "note": "This release includes new rules for Windows and Linux endpoints. Additionally, significant rule tuning for Windows and Linux rules has been added for better rule efficacy. A Google Workspace promotional rule was added to promote security alerts from the Alert Center. Machine learning rules related to failed logins have been adjusted for better scoring results. Additional investigation guides have been added for Windows and Linux rules.",
      "update_version": "8.4.3",
      "updated_rules": 110,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-8-4-3-prebuilt-rules-8-4-3-summary.html"
    },
    {
      "date": "24 Jan 2023",
      "new_rules": 5,
      "note": "This release includes new rules for Windows regarding Microsoft Exchange interaction via Powershell. Additionally, significant rule tuning for Windows rules has been added for better rule efficacy. A new rule for multiple alerts with different ATT&CK tactics on a single host has also been included. A new rule for multiple alerts involving a single user has been added. Related integration tags and recommended versions have been added to endpoint rules. Bug fixes for OSQuery execution in rule investigation guides has been added.",
      "update_version": "8.4.2",
      "updated_rules": 494,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-8-4-2-prebuilt-rules-8-4-2-summary.html"
    },
    {
      "date": "05 Dec 2022",
      "new_rules": 20,
      "note": "This release includes new rules for Linux regarding reverse shells. Additionally, new windows rules have been added to supply coverage for credential access and access token manipulation. Specific Windows and Linux rules have been tuned to reduce false-positive signals.",
      "update_version": "8.4.1",
      "updated_rules": 298,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-8-4-1-prebuilt-rules-8-4-1-summary.html"
    },
    {
      "date": "24 Jan 2023",
      "new_rules": 1,
      "note": "This release includes new rules for Windows regarding Microsoft Exchange interaction via PowerShell. A new rule for multiple alerts with different ATT&CK tactics on a single host has also been included. Additionally, a new rule for multiple alerts involving a single user has been added. This release also includes rule tuning for suspicious Windows Error Reporting child processes.",
      "update_version": "8.3.4",
      "updated_rules": 4,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-8-3-4-prebuilt-rules-8-3-4-summary.html"
    },
    {
      "date": "19 Jan 2023",
      "new_rules": 17,
      "note": "This release includes new rules for Windows regarding Microsoft Exchange interaction via PowerShell. Additionally, significant rule tuning for Windows rules has been added for better rule efficacy. Related integration tags and recommended versions have been added to endpoint rules. Bug fixes for OSQuery execution in rule investigation guides has been added.",
      "update_version": "8.3.3",
      "updated_rules": 500,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-8-3-3-prebuilt-rules-8-3-3-summary.html"
    },
    {
      "date": "06 Oct 2022",
      "new_rules": 25,
      "note": "This release includes new rules for Linux, Windows, Google Workspace and Kubernetes. Also included are expanded investigation guides for Linux, Windows and macOS rules.",
      "update_version": "8.3.2",
      "updated_rules": 232,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-8-3-2-prebuilt-rules-8-3-2-summary.html"
    },
    {
      "date": "26 Aug 2022",
      "new_rules": 0,
      "note": "This release includes new rules for Linux, Windows, Google Workspace and Kubernetes. Also included are expanded investigation and setup guides for Linux, Windows and macOS rules. Rule compatibility for required event fields and related Fleet integrations has also been included.",
      "update_version": "8.3.1",
      "updated_rules": 113,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-8-3-1-prebuilt-rules-8-3-1-summary.html"
    },
    {
      "date": "24 Aug 2022",
      "new_rules": 442,
      "note": "This release includes new rules for Windows, MacOS, Linux, Kubernetes, and considerable tuning efforts. Also included are expanded investigation guides for Windows, Azure and AWS rules.",
      "update_version": "8.2.1",
      "updated_rules": 96,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-8-2-1-prebuilt-rules-8-2-1-summary.html"
    },
    {
      "date": "24 Jun 2022",
      "new_rules": 14,
      "note": "This release includes new rules for Windows, MacOS, Linux and Kubernetes. Also included are expanded investigation guides for Windows rules. Additionally, this update includes new rules to help detect emerging threat BPFDoor. Updates to existing Windows rules were made to help detect exploitation attempts against CVE-2022-30190.",
      "update_version": "8.1.1",
      "updated_rules": 159,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-8-1-1-prebuilt-rules-8-1-1-summary.html"
    },
    {
      "date": "03 May 2022",
      "new_rules": 42,
      "note": "This release includes new rules for MacOS regarding initial access and persistence coverage. New rules to detect shell evasion in Linux have also been added. Also included are expanded investigation guides for Windows rules as well as new rules for credential theft and Active Directory (AD). Additionally, this update includes new rules to help detect the emerging threat CVE-2022-0847 (Dirty Pipe).",
      "update_version": "1.0.2",
      "updated_rules": 341,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-1-0-2-prebuilt-rules-1-0-2-summary.html"
    },
    {
      "date": "13 Dec 2021",
      "new_rules": 35,
      "note": "This release includes an update to an existing rule and adds a new rule to help detect CVE-2021-44228 (log4j2). Also included are updates and new rules for cloud integrations, windows, PowerShell, and others.",
      "update_version": "0.14.3",
      "updated_rules": 45,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-0-14-3-prebuilt-rules-0-14-3-summary.html"
    },
    {
      "date": "15 Oct 2021",
      "new_rules": 18,
      "note": "This release includes rules covering Windows endpoints, as well as several third-party integrations — including rules contributed by the community.",
      "update_version": "0.14.2",
      "updated_rules": 89,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-0-14-2-prebuilt-rules-0-14-2-summary.html"
    },
    {
      "date": "08 Sep 2021",
      "new_rules": 3,
      "note": "Included in this release is a rule to detect web shells, including ProxyShell activity.",
      "update_version": "0.14.1",
      "updated_rules": 71,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-0-14-1-prebuilt-rules-0-14-1-summary.html"
    },
    {
      "date": "22 Jul 2021",
      "new_rules": 4,
      "note": "Included in this release is a rule for Windows Defender Exclusions, which has been used in recent campaigns, as well as a rule to resiliently detect parent PID spoofing.",
      "update_version": "0.13.3",
      "updated_rules": 36,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-0-13-3-prebuilt-rules-0-13-3-summary.html"
    },
    {
      "date": "07 Jul 2021",
      "new_rules": 15,
      "note": "Included in this release are 3 new rules for the recently observed REvil activity as well as 4 new rules covering the recent PrintNightmare vulnerability.",
      "update_version": "0.13.2",
      "updated_rules": 6,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-0-13-2-prebuilt-rules-0-13-2-summary.html"
    },
    {
      "date": "21 Jun 2021",
      "new_rules": 4,
      "note": "",
      "update_version": "0.13.1",
      "updated_rules": 41,
      "url": "https://www.elastic.co/guide/en/security/current/prebuilt-rule-0-13-1-prebuilt-rules-0-13-1-summary.html"
    }
  ]
}
