[metadata]
creation_date = "2023/05/08"
integration = ["okta"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2023/05/08"

[rule]
author = ["Austin Songer"]
description = """
Detects when whether the source of a Push Challenge (the “source event” generated by the Okta SignIn Widget) comes from a different location than the 
Okta Verify client that accepts or rejects the challenge (destination event).
"""

index = ["filebeat-*", "logs-okta*"]
language = "kuery"
license = "Elastic License v2"
name = "Okta Threat Detected By Suspicious Push Challenge"
note = """## Setup

The Okta Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."""
references = [
    "https://developer.okta.com/docs/reference/api/system-log/",
    "https://developer.okta.com/docs/reference/api/event-types/",
    "https://sec.okta.com/pushfatigueworkflows",
]
risk_score = 47
rule_id = "0e530c09-2157-44a4-9cae-65ad2c441fdf"
severity = "medium"
tags = ["Elastic", "Identity", "Okta", "Continuous Monitoring", "SecOps", "Identity and Access"]
type = "sequence"
timestamp_override = "event.ingested"

query = '''
sequence with maxspan=10m
    [event.dataset:okta.system and event.action:system.push.send_factor_verify_push]
    [event.dataset:okta.system and event.action:user.authentication.auth_via_mfa and okta.debug_context.debug_data.factor:OKTA_VERIFY_PUSH]
'''



[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1078"
name = "Valid Accounts"
reference = "https://attack.mitre.org/techniques/T1078/"


[rule.threat.tactic]
id = "TA0001"
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0001/"
