[metadata]
creation_date = "2026/01/30"
integration = ["endpoint"]
maturity = "production"
updated_date = "2026/01/30"

[rule]
author = ["Elastic"]
description = """
Detects the use of curl to a Google Script endpoint for the purpose of downloading a second stage payload 
or tool. Threat actors utilize exposed Google Script endpoints to host payloads as Google URLs are 
generally whitelisted and bypass security controls.
"""
from = "now-9m"
index = ["logs-endpoint.events.process-*", "logs-endpoint.events.network-*"]
language = "eql"
license = "Elastic License v2"
name = "Suspicious Curl to Google App Script Endpoint"
references = [
    "https://www.google.com/script/start/",
    "https://attack.mitre.org/techniques/T1105/"
]
risk_score = 73
rule_id = "6b82a0ce-10ac-4cb7-8a66-0ba4d24540cf"
severity = "high"
tags = [
    "Domain: Endpoint",
    "OS: macOS",
    "Use Case: Threat Detection",
    "Tactic: Command and Control",
    "Data Source: Elastic Defend"
]
type = "eql"
query = '''
sequence by process.entity_id with maxspan=15s
  [process where host.os.type == "macos" and event.type == "start" and process.name in ("curl", "nscurl") and
    not process.Ext.effective_parent.executable like "/Library/Kandji/Kandji Agent.app/Contents/Helpers/Kandji Library Manager.app/Contents/MacOS/kandji-library-manager"]
  [network where host.os.type == "macos" and event.type == "start" and process.name in ("curl", "nscurl") and 
    destination.domain in ("script.google.com", "script.google.com.")]
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

  [rule.threat.tactic]
  name = "Command and Control"
  id = "TA0011"
  reference = "https://attack.mitre.org/tactics/TA0011/"

  [[rule.threat.technique]]
  name = "Ingress Tool Transfer"
  id = "T1105"
  reference = "https://attack.mitre.org/techniques/T1105/"

  [[rule.threat.technique]]
  name = "Web Service"
  id = "T1102"
  reference = "https://attack.mitre.org/techniques/T1102/"

    [[rule.threat.technique.subtechnique]]
    name = "Bidirectional Communication"
    id = "T1102.002"
    reference = "https://attack.mitre.org/techniques/T1102/002/"
