[metadata]
creation_date = "2026/01/30"
integration = ["endpoint"]
maturity = "production"
updated_date = "2026/01/30"

[rule]
author = ["Elastic"]
description = """
Detects when Docker makes an outbound network connection to a suspicious top level domain. These TLDs 
are commonly associated with malicious activity and may indicate container escape, supply chain compromise, 
or command and control communication.
"""
from = "now-9m"
index = ["logs-endpoint.events.process-*", "logs-endpoint.events.network-*"]
language = "eql"
license = "Elastic License v2"
name = "Docker Outbound Connection to Suspicious Top Level Domain"
risk_score = 47
rule_id = "c2d4e02a-8765-4f3c-9b1a-2e5f6g7h8i9j"
severity = "medium"
tags = [
    "Domain: Endpoint",
    "Domain: Container",
    "OS: macOS",
    "Use Case: Threat Detection",
    "Tactic: Command and Control",
    "Data Source: Elastic Defend"
]
type = "eql"
query = '''
sequence by process.entity_id with maxspan=1m
  [process where host.os.type == "macos" and event.type == "start" and event.action == "exec" and 
    process.name in ("docker", "Docker Desktop", "com.docker.backend")]
  [network where host.os.type == "macos" and event.type == "start" and
    destination.domain like~ ("*.vip", "*.info", "*.team", "*.lol", "*.kr", "*.ke", "*.nu", "*.space", 
                              "*.capital", "*.in", "*.cfd", "*.online", "*.ru", "*.top", "*.buzz", 
                              "*.xyz", "*.rest", "*.ml", "*.cf", "*.gq", "*.ga", "*.onion",
                              "*.network", "*.monster", "*.marketing", "*.cyou", "*.quest", "*.cc", 
                              "*.bar", "*.click", "*.cam", "*.surf", "*.tk", "*.shop", "*.club", 
                              "*.icu", "*.pw", "*.ws", "*.hair", "*.mom", "*.beauty", "*.boats", 
                              "*.fun", "*.life", "*.store")]
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

  [rule.threat.tactic]
  name = "Command and Control"
  id = "TA0011"
  reference = "https://attack.mitre.org/tactics/TA0011/"

  [[rule.threat.technique]]
  name = "Application Layer Protocol"
  id = "T1071"
  reference = "https://attack.mitre.org/techniques/T1071/"

    [[rule.threat.technique.subtechnique]]
    name = "Web Protocols"
    id = "T1071.001"
    reference = "https://attack.mitre.org/techniques/T1071/001/"

[[rule.threat]]
framework = "MITRE ATT&CK"

  [rule.threat.tactic]
  name = "Execution"
  id = "TA0002"
  reference = "https://attack.mitre.org/tactics/TA0002/"

  [[rule.threat.technique]]
  name = "Deploy Container"
  id = "T1610"
  reference = "https://attack.mitre.org/techniques/T1610/""
    reference = "https://attack.mitre.org/techniques/T1071/001/"
