[metadata]
creation_date = "2021/01/13"
maturity = "production"
updated_date = "2021/01/13"

[rule]
author = ["Elastic"]
description = """
Authorization plugins are used to extend the authorization services API and implement mechanisms that are not natively
supported by the OS such as multi-factor authentication with 3rd party software. Adversaries may abuse this feature to
persist and/or collect clear text credentials as they traverse the registered rogue plugin during user logon.
"""
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Authorization Plugin Modification"
references = [
    "https://developer.apple.com/documentation/security/authorization_plug-ins",
    "https://www.xorrior.com/persistent-credential-theft/",
]
risk_score = 47
rule_id = "e6c98d38-633d-4b3e-9387-42112cd5ac10"
severity = "medium"
tags = ["Elastic", "Host", "macOS", "Threat Detection", "Persistence", "Credential Access"]
type = "query"

query = '''
event.category:file and not event.type:deletion and
  file.path:/Library/Security/SecurityAgentPlugins/*
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1547"
name = "Boot or Logon Autostart Execution"
reference = "https://attack.mitre.org/techniques/T1547/"
[[rule.threat.technique.subtechnique]]
id = "T1547.002"
name = "Authentication Package"
reference = "https://attack.mitre.org/techniques/T1547/002/"



[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

