[metadata]
creation_date = "2020/11/16"
maturity = "production"
updated_date = "2020/11/16"

[rule]
author = ["Elastic"]
description = """
Identifies a high number (20) of macOS SSH KeyGen process executions from the same host. An adversary may attempt a brute
force attack to obtain unauthorized access to user accounts.
"""
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Potential SSH Brute Force Detected"
references = ["https://themittenmac.com/detecting-ssh-activity-via-process-monitoring/"]
risk_score = 47
rule_id = "ace1e989-a541-44df-93a8-a8b0591b63c0"
severity = "medium"
tags = ["Elastic", "Host", "macOS", "Threat Detection", "Credential Access"]
type = "threshold"

query = '''
event.category:process and event.type:start and process.name:"sshd-keygen-wrapper" and process.parent.name:launchd
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1110"
name = "Brute Force"
reference = "https://attack.mitre.org/techniques/T1110/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

[rule.threshold]
field = "host.id"
value = 20
