[metadata]
creation_date = "2020/08/14"
ecs_version = ["1.5.0"]
maturity = "production"
updated_date = "2020/08/14"

[rule]
author = ["Elastic"]
description = "Detects the use of kerberos cache manipulation kcc utility to dump cached kerberos tickets."
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Preparation of Keychain crednetials exfiltration"
references = [
    "https://github.com/EmpireProject/EmPyre/blob/master/lib/modules/collection/osx/kerberosdump.py",
    "https://opensource.apple.com/source/Heimdal/Heimdal-323.12/kuser/kcc-commands.in.auto.html",
]
risk_score = 73
rule_id = "ad88231f-e2ab-491c-8fc6-64746da26cfe"
severity = "high"
tags = ["Elastic", "MacOS"]
type = "query"

query = '''
event.category:process and not event.type:end and
  process.name:kcc and
  process.args:"copy_cred_cache"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1003"
name = "Credential Dumping"
reference = "https://attack.mitre.org/techniques/T1003/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

