[metadata]
creation_date = "2026/01/30"
integration = ["endpoint"]
maturity = "production"
updated_date = "2026/01/30"

[rule]
author = ["Elastic"]
description = """
Detects the use of grep to identify virtual machine environments by searching for VMware, Parallels, and 
VirtualBox indicators. Malware commonly performs this check to detect sandbox or analysis environments 
before executing malicious payloads.
"""
from = "now-9m"
index = ["logs-endpoint.events.process-*"]
language = "eql"
license = "Elastic License v2"
name = "Potential Virtual Machine Fingerprinting via Grep"
references = [
    "https://objective-see.com/blog/blog_0x4F.html"
]
risk_score = 47
rule_id = "72b92bc0-f031-48eb-91b6-e116eccd25f9"
severity = "medium"
tags = [
    "Domain: Endpoint",
    "OS: macOS",
    "Use Case: Threat Detection",
    "Tactic: Discovery",
    "Tactic: Defense Evasion",
    "Data Source: Elastic Defend"
]
timestamp_override = "event.ingested"
type = "eql"
query = '''
process where host.os.type == "macos" and event.type == "start" and
  process.name in ("grep", "egrep") and
  process.command_line like "*parallels*" and
  process.command_line like "*virtualbox*" and
  process.command_line like "*vmware*" and
  not process.parent.executable in ("/Applications/Docker.app/Contents/MacOS/Docker", "/usr/libexec/kcare/virt-what")
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

  [rule.threat.tactic]
  name = "Discovery"
  id = "TA0007"
  reference = "https://attack.mitre.org/tactics/TA0007/"

  [[rule.threat.technique]]
  name = "System Information Discovery"
  id = "T1082"
  reference = "https://attack.mitre.org/techniques/T1082/"

  [[rule.threat.technique]]
  name = "Virtualization/Sandbox Evasion"
  id = "T1497"
  reference = "https://attack.mitre.org/techniques/T1497/"

    [[rule.threat.technique.subtechnique]]
    name = "System Checks"
    id = "T1497.001"
    reference = "https://attack.mitre.org/techniques/T1497/001/"
