[metadata]
creation_date = "2020/08/14"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/08/14"

[rule]
author = ["Elastic"]
description = """
Adversaries may collect the keychain storage data from a system to acquire credentials. Keychains are the built-in way
for macOS to keep track of users' passwords and credentials for many services and features such as WiFi passwords,
websites, secure notes, certificates, and Kerberos.
"""
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Compression of Keychain Credentials Directories"
references = ["https://objective-see.com/blog/blog_0x25.html"]
risk_score = 73
rule_id = "96e90768-c3b7-4df6-b5d9-6237f8bc36a8"
severity = "high"
tags = ["Elastic", "MacOS"]
type = "query"

query = '''
event.category:process and event.type:(start or process_started) and
  process.name:(zip or tar or gzip or 7za or hdiutil) and
  process.args:("/Library/Keychains/" or "/Network/Library/Keychains/" or "~/Library/Keychains/")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1142"
name = "Keychain"
reference = "https://attack.mitre.org/techniques/T1142/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

