[metadata]
creation_date = "2020/01/12"
maturity = "production"
updated_date = "2020/01/12"

[rule]
author = ["Elastic"]
description = """
Identifies the use of the Bifrost Console, a known macOS Kerberos pentesting tool that can be used to dump cached Kerberos
tickets or attempt unauthorized authentication techniques such as pass-the-ticket/hash and kerberoasting.
"""
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Lateral Movement via Kerberos using Bifrost Console"
references = ["https://github.com/its-a-feature/bifrost"]
risk_score = 73
rule_id = "16904215-2c95-4ac8-bf5c-12354e047192"
severity = "high"
tags = ["Elastic", "Host", "macOS", "Threat Detection", "Credential Access", "Lateral Movement"]
type = "query"

query = '''
event.category:process and event.type:start and 
 process.args:("-action" and ("-kerberoast" or askhash or asktgs or asktgt or s4u or ("-ticket" and ptt) or (dump and (tickets or keytab))))
'''

[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1550"
name = "Use Alternate Authentication Material"
reference = "https://attack.mitre.org/techniques/T1550/"
[[rule.threat.technique.subtechnique]]
id = "T1550.003"
name = "Pass the Ticket"
reference = "https://attack.mitre.org/techniques/T1550/003/"

[rule.threat.tactic]
id = "TA0008"
name = "Lateral Movement"
reference = "https://attack.mitre.org/tactics/TA0008/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1558"
name = "Steal or Forge Kerberos Tickets"
reference = "https://attack.mitre.org/techniques/T1558/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"
