[metadata]
creation_date = "2020/01/05"
maturity = "production"
updated_date = "2020/01/05"

[rule]
author = ["Elastic"]
description = """
Identifies the creation of hidden launch agent or daemon. An adversary can establish persistence by installing a new
launch agent or daemon that executes at login.
"""
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "eql"
license = "Elastic License"
name = "Creation of a Hidden Launch Agent or Daemon"
references = [
    "https://developer.apple.com/library/archive/documentation/MacOSX/Conceptual/BPSystemStartup/Chapters/CreatingLaunchdJobs.html",
]
risk_score = 47
rule_id = "092b068f-84ac-485d-8a55-7dd9e006715f"
severity = "medium"
tags = ["Elastic", "Host", "macOS", "Threat Detection", "Persistence"]
type = "eql"

query = '''
file where event.type != "deletion" and
  wildcard(file.path,
            "/System/Library/LaunchAgents/.*.plist",
            "/Library/LaunchAgents/.*.plist",
            "/Users/*/Library/LaunchAgents/.*.plist",
            "/System/Library/LaunchDaemons/.*.plist",
            "/Library/LaunchDaemons/.*.plist")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1159"
name = "Launch Agent"
reference = "https://attack.mitre.org/techniques/T1159/"


[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

