[metadata]
creation_date = "2020/01/05"
maturity = "production"
updated_date = "2020/01/05"

[rule]
author = ["Elastic"]
description = """
Identify attempt to create a local account that will be hidden from the macOS logon window. This may indicate an attempt
to not attract user attention while persisting via a separate local account.
"""
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Attempt to Create a Hidden Local Account"
references = ["https://support.apple.com/en-us/HT203998"]
risk_score = 47
rule_id = "41b638a1-8ab6-4f8e-86d9-466317ef2db5"
severity = "medium"
tags = ["Elastic", "Host", "macOS", "Threat Detection", "Persistence"]
type = "query"

query = '''
event.category:process and event.type:(start or process_started) and
 process.name:dscl and process.args:(create and IsHidden) and process.args:(1 or true or yes)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1078"
name = "Valid Accounts"
reference = "https://attack.mitre.org/techniques/T1078/"
[[rule.threat.technique.subtechnique]]
id = "T1078.003"
name = "Local Accounts"
reference = "https://attack.mitre.org/techniques/T1078/003/"



[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

