[metadata]
creation_date = "2021/01/21"
maturity = "production"
updated_date = "2021/01/21"

[rule]
author = ["Elastic"]
description = """
Identifies the creation or modification of the Loin Window property list. Starting in Mac OS X 10.7 (Lion), users can
specify certain applications to be re-opened when a user reboots their machine.
"""
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Potential Persistence via Login Hook"
references = ["https://github.com/D00MFist/PersistentJXA/blob/master/LoginScript.js"]
risk_score = 47
rule_id = "ac412404-57a5-476f-858f-4e8fbb4f48d8"
severity = "medium"
tags = ["Elastic", "Host", "macOS", "Threat Detection", "Persistence"]
type = "query"

query = '''
event.category :"file" and not event.type:"deletion" and
 process.name:*  and
 file.name :"com.apple.loginwindow.plist" and
 not process.name:
           (systemmigrationd or
		    DesktopServicesHelper or
			diskmanagementd or
			rsync or
			launchd or
			cfprefsd or
			xpcproxy or
			ManagedClient or
			MCXCompositor)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1547"
name = "Boot or Logon Autostart Execution"
reference = "https://attack.mitre.org/techniques/T1547/"
[[rule.threat.technique.subtechnique]]
id = "T1547.011"
name = "Plist Modification"
reference = "https://attack.mitre.org/techniques/T1547/011/"



[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

