[metadata]
creation_date = "2021/01/13"
maturity = "production"
updated_date = "2021/01/13"

[rule]
author = ["Elastic"]
description = """
Identifies the creation of modification of a dsplug file. The DirectoryService daemon launches on each system boot, and
automatically reloads after crash. It scans bundles that are located in the DirectoryServices PlugIns folder and execute
them.
"""
false_positives = ["Trusted DirectoryService Plugins"]
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Persistence via DirectoryService Plugin Modification"
references = ["https://blog.chichou.me/2019/11/21/two-macos-persistence-tricks-abusing-plugins/"]
risk_score = 47
rule_id = "89fa6cb7-6b53-4de2-b604-648488841ab8"
severity = "medium"
tags = ["Elastic", "Host", "macOS", "Threat Detection", "Persistence"]
type = "query"

query = '''
event.category:file and not event.type:deletion and
  file.path:/Library/DirectoryServices/PlugIns/*.dsplug
'''


[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

