[metadata]
creation_date = "2020/07/06"
integration = ["network_traffic"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2023/08/01"

[rule]
author = ["Elastic"]
description = """
Halfbaked is a malware family used to establish persistence in a contested network. This rule detects a network activity
algorithm leveraged by Halfbaked implant beacons for command and control.
"""
false_positives = [
    """
    This rule should be tailored to exclude systems, either as sources or destinations, in which this behavior is
    expected.
    """,
]
from = "now-9m"
index = ["packetbeat-*", "auditbeat-*", "filebeat-*", "logs-network_traffic.*"]
language = "lucene"
license = "Elastic License v2"
name = "Halfbaked Command and Control Beacon"
note = """## Threat intel

This activity has been observed in FIN7 campaigns."""
references = [
    "https://www.fireeye.com/blog/threat-research/2017/04/fin7-phishing-lnk.html",
    "https://attack.mitre.org/software/S0151/",
]
risk_score = 73
rule_id = "2e580225-2a58-48ef-938b-572933be06fe"
severity = "high"
tags = ["Use Case: Threat Detection", "Tactic: Command and Control", "Domain: Endpoint"]
timestamp_override = "event.ingested"
type = "query"

query = '''
(event.dataset: (network_traffic.tls or network_traffic.http) or
  (event.category: (network or network_traffic) and network.protocol: http)) and
  network.transport:tcp and url.full:/http:\/\/[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}\/cd/ and
  destination.port:(53 or 80 or 8080 or 443)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1071"
name = "Application Layer Protocol"
reference = "https://attack.mitre.org/techniques/T1071/"

[[rule.threat.technique]]
id = "T1568"
name = "Dynamic Resolution"
reference = "https://attack.mitre.org/techniques/T1568/"
[[rule.threat.technique.subtechnique]]
id = "T1568.002"
name = "Domain Generation Algorithms"
reference = "https://attack.mitre.org/techniques/T1568/002/"



[rule.threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"

