[metadata]
creation_date = "2020/10/07"
ecs_version = ["1.6.0"]
maturity = "experimental"
query_schema_validation = false
updated_date = "2020/10/07"

[rule]
author = ["Elastic"]
description = """
A machine learning model has detected a domain in a DNS query that is likely using a Domain Generation Algorithm (DGA),
which could indicate command and control network activity.
"""
language = "kuery"
license = "Elastic License"
name = "Machine Learning Detected a DNS Request for a DGA Domain"
risk_score = 21
rule_id = "a020dadb-3da2-4252-91e9-b0fc148823e2"
severity = "low"
tags = ["Elastic", "ML-DGA"]
type = "query"

query = '''
event.category:network and network.protocol:dns and predicted_label.predicted_value:true
'''

