[metadata]
creation_date = "2020/07/06"
maturity = "production"
updated_date = "2021/05/10"

[rule]
author = ["Elastic"]
description = """
Halfbaked is a malware family used to establish persistence in a contested network. This rule detects a network activity
algorithm leveraged by Halfbaked implant beacons for command and control.
"""
false_positives = [
    """
    This rule should be tailored to exclude systems, either as sources or destinations, in which this behavior is
    expected.
    """,
]
from = "now-9m"
index = ["auditbeat-*", "filebeat-*", "packetbeat-*", "logs-endpoint.events.*"]
language = "lucene"
license = "Elastic License v2"
name = "Halfbaked Command and Control Beacon"
note = """## Threat intel

This activity has been observed in FIN7 campaigns."""
references = [
    "https://www.fireeye.com/blog/threat-research/2017/04/fin7-phishing-lnk.html",
    "https://attack.mitre.org/software/S0151/",
]
risk_score = 73
rule_id = "2e580225-2a58-48ef-938b-572933be06fe"
severity = "high"
tags = ["Elastic", "Network", "Threat Detection", "Command and Control", "Host"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.category:(network OR network_traffic) AND network.protocol:http AND
  network.transport:tcp AND url.full:/http:\/\/[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}\/cd/ AND
  destination.port:(53 OR 80 OR 8080 OR 443)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
name = "Application Layer Protocol"
reference = "https://attack.mitre.org/techniques/T1071/"
id = "T1071"

[[rule.threat.technique]]
name = "Dynamic Resolution"
reference = "https://attack.mitre.org/techniques/T1568/"
id = "T1568"
[[rule.threat.technique.subtechnique]]
name = "Domain Generation Algorithms"
reference = "https://attack.mitre.org/techniques/T1568/002/"
id = "T1568.002"



[rule.threat.tactic]
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"
id = "TA0011"
