[metadata]
creation_date = "2020/02/18"
ecs_version = ["1.5.0"]
maturity = "production"
updated_date = "2020/05/14"

[rule]
author = ["Elastic"]
description = """
This rule detects network events that may indicate the use of Telnet traffic. Telnet is commonly used by system
administrators to remotely control older or embed ed systems using the command line shell. It should almost never be
directly exposed to the Internet, as it is frequently targeted and exploited by threat actors as an initial access or
back-door vector. As a plain-text protocol, it may also expose usernames and passwords to anyone capable of observing
the traffic.
"""
false_positives = [
    """
    IoT (Internet of Things) devices and networks may use telnet and can be excluded if desired. Some business
    work-flows may use Telnet for administration of older devices. These often have a predictable behavior. Telnet
    activity involving an unusual source or destination may be more suspicious. Telnet activity involving a production
    server that has no known associated Telnet work-flow or business requirement is often suspicious.
    """,
]
index = ["filebeat-*", "packetbeat-*"]
language = "kuery"
license = "Elastic License"
name = "Telnet Port Activity"
risk_score = 47
rule_id = "34fde489-94b0-4500-a76f-b8a157cf9269"
severity = "medium"
tags = ["Elastic", "Network"]
type = "query"

query = '''
event.category:(network or network_traffic) and network.transport:tcp and destination.port:23
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1043"
name = "Commonly Used Port"
reference = "https://attack.mitre.org/techniques/T1043/"


[rule.threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1021"
name = "Remote Services"
reference = "https://attack.mitre.org/techniques/T1021/"


[rule.threat.tactic]
id = "TA0008"
name = "Lateral Movement"
reference = "https://attack.mitre.org/tactics/TA0008/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1190"
name = "Exploit Public-Facing Application"
reference = "https://attack.mitre.org/techniques/T1190/"


[rule.threat.tactic]
id = "TA0011"
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0011/"
