[metadata]
creation_date = "2020/07/06"
ecs_version = ["1.5.0"]
maturity = "production"
updated_date = "2020/07/06"

[rule]
author = ["Elastic"]
description = """
Cobalt Strike is a threat emulation platform commonly modified and used by adversaries to conduct network attack and
exploitation campaigns. This rule detects a network activity algorithm leveraged by Cobalt Strike implant beacons for
command and control.
"""
false_positives = [
    """
    This rule should be tailored to either exclude systems, as sources or destinations, in which this behavior is
    expected.
    """,
]
index = ["packetbeat-*"]
language = "lucene"
license = "Elastic License"
name = "Cobalt Strike Command and Control Beacon"
note = "This activity has been observed in FIN7 campaigns."
references = [
    "https://blog.morphisec.com/fin7-attacks-restaurant-industry",
    "https://www.fireeye.com/blog/threat-research/2017/04/fin7-phishing-lnk.html",
]
risk_score = 73
rule_id = "cf53f532-9cc9-445a-9ae7-fced307ec53c"
severity = "high"
tags = ["Elastic", "Network"]
type = "query"

query = '''
event.category:(network OR network_traffic) AND type:(tls OR http) AND network.transport:tcp AND destination.domain : /[a-z]{3}.stage.[0-9]{8}\.(.*)/
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1071"
name = "Standard Application Layer Protocol"
reference = "https://attack.mitre.org/techniques/T1071/"

[[rule.threat.technique]]
id = "T1483"
name = "Domain Generation Algorithms"
reference = "https://attack.mitre.org/techniques/T1483/"


[rule.threat.tactic]
id = "TA0010"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0010/"
