[metadata]
creation_date = "2020/02/18"
maturity = "production"
updated_date = "2021/03/03"

[rule]
author = ["Elastic"]
description = """
This rule detects events that may indicate use of SMTP on TCP port 26. This port is commonly used by several popular
mail transfer agents to deconflict with the default SMTP port 25. This port has also been used by a malware family
called BadPatch for command and control of Windows systems.
"""
false_positives = [
    """
    Servers that process email traffic may cause false positives and should be excluded from this rule as this is
    expected behavior.
    """,
]
from = "now-9m"
index = ["auditbeat-*", "filebeat-*", "packetbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License v2"
name = "SMTP on Port 26/TCP"
references = [
    "https://unit42.paloaltonetworks.com/unit42-badpatch/",
    "https://isc.sans.edu/forums/diary/Next+up+whats+up+with+TCP+port+26/25564/",
]
risk_score = 21
rule_id = "d7e62693-aab9-4f66-a21a-3d79ecdd603d"
severity = "low"
tags = ["Elastic", "Host", "Network", "Threat Detection", "Command and Control", "Host"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.category:(network or network_traffic) and network.transport:tcp and (destination.port:26 or (event.dataset:zeek.smtp and destination.port:26))
'''


[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"
id = "TA0011"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
name = "Exfiltration Over Alternative Protocol"
reference = "https://attack.mitre.org/techniques/T1048/"
id = "T1048"


[rule.threat.tactic]
name = "Exfiltration"
reference = "https://attack.mitre.org/tactics/TA0010/"
id = "TA0010"
