[metadata]
creation_date = "2020/10/16"
maturity = "production"
min_stack_comments = "New fields available: new_terms_fields and window_start_history"
min_stack_version = "8.4.0"
updated_date = "2022/10/16"

[rule]
author = ["Elastic"]
description = "This rule detects outbound network connections to a well known port that has not been seen within the last 30 days."
false_positives = [
    """
    Introducing new services that used well-known ports may cause outbound traffic to specific ports that would meet the
    criteria of this rule.
    """,
]
from = "now-9m"
history_window_start = "now-30d"
index = ["logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License v2"
name = "Outbound Traffic to Uncommon Well Known Port"
new_terms_fields = ["destination.port"]
risk_score = 21
rule_id = "34fde489-94b0-4500-a76f-b8a157cf9269"
severity = "low"
tags = ["Elastic", "Host", "Network", "Threat Detection", "Command and Control", "Host"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.category:(network or network_traffic) and destination.port < 1024
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1021"
name = "Remote Services"
reference = "https://attack.mitre.org/techniques/T1021/"


[rule.threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"

