[metadata]
creation_date = "2021/08/13"
maturity = "production"
updated_date = "2021/08/13"
integration = "azure"

[rule]
author = ["Austin Songer"]
description = """
Identifies when a Kubernetes account accesses sensitive objects such as configmaps or secrets. Sensitive data may be
stored on these objects that an adversary could take advantage of.
"""
false_positives = [
    """
    Sensitive objects may be accessed by a system administrator. Verify whether the user identity, user 
    agent, and/or hostname should be making changes in your environment. Sensitive objects accessed from 
    unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted 
    from the rule.
    """,
]
from = "now-25m"
index = ["filebeat-*", "logs-azure*"]
language = "kuery"
license = "Elastic License v2"
name = "Azure Kubernetes Secret or Config Object Accessed"
note = """## Config

The Azure Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."""
references = [
    "https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations#microsoftkubernetes",
    "https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/azure/azure_kubernetes_secret_or_config_object_access.yml",
]
risk_score = 21
rule_id = "c1cab008-0fc9-487e-a29d-2ef956367ad9"
severity = "low"
tags = ["Elastic", "Cloud", "Azure", "Continuous Monitoring", "SecOps", "Identity and Access"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset:azure.activitylogs and azure.activitylogs.operation_name:
    (
        "MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/CONFIGMAPS/WRITE" or
        "MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/CONFIGMAPS/DELETE" or
        "MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/SECRETS/WRITE" or
        "MICROSOFT.KUBERNETES/CONNECTEDCLUSTERS/SECRETS/DELETE"
    ) and 
event.outcome:(Success or success)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"
