[metadata]
creation_date = "2021/05/05"
integration = ["azure"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2023/06/22"

[rule]
author = ["Elastic", "Austin Songer"]
description = """
Identifies when new Service Principal credentials have been added in Azure. In most organizations, credentials will be
added to service principals infrequently. Hijacking an application (by adding a rogue secret or certificate) with
granted permissions will allow the attacker to access data that is normally protected by MFA requirements.
"""
false_positives = [
    """
    Service principal credential additions may be done by a system or network administrator. Verify whether the
    username, hostname, and/or resource name should be making changes in your environment. Credential additions from
    unfamiliar users or hosts should be investigated. If known behavior is causing false positives, it can be exempted
    from the rule.
    """,
]
from = "now-25m"
index = ["filebeat-*", "logs-azure*"]
interval = "10m"
language = "kuery"
license = "Elastic License v2"
name = "Azure Service Principal Credentials Added"
note = """## Setup

The Azure Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."""
references = ["https://www.fireeye.com/content/dam/collateral/en/wp-m-unc2452.pdf"]
risk_score = 47
rule_id = "f766ffaf-9568-4909-b734-75d19b35cbf4"
severity = "medium"
tags = ["Domain: Cloud", "Data Source: Azure", "Use Case: Identity and Access Audit", "Tactic: Impact"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset:azure.auditlogs and azure.auditlogs.operation_name:"Add service principal credentials" and event.outcome:(success or Success)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1496"
name = "Resource Hijacking"
reference = "https://attack.mitre.org/techniques/T1496/"


[rule.threat.tactic]
id = "TA0040"
name = "Impact"
reference = "https://attack.mitre.org/tactics/TA0040/"

