[metadata]
creation_date = "2020/09/01"
maturity = "production"
updated_date = "2022/02/20"
integration = "azure"

[rule]
author = ["Elastic"]
description = """
Identifies when an Azure Conditional Access policy is modified. Azure Conditional Access policies control access to
resources via if-then statements. For example, if a user wants to access a resource, then they must complete an action
such as using multi-factor authentication to access it. An adversary may modify a Conditional Access policy in order to
weaken their target's security controls.
"""
from = "now-25m"
index = ["filebeat-*", "logs-azure*"]
language = "kuery"
license = "Elastic License v2"
name = "Azure Conditional Access Policy Modified"
note = """## Config

The Azure Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."""
references = ["https://docs.microsoft.com/en-us/azure/active-directory/conditional-access/overview"]
risk_score = 47
rule_id = "bc48bba7-4a23-4232-b551-eca3ca1e3f20"
severity = "medium"
tags = ["Elastic", "Cloud", "Azure", "Continuous Monitoring", "SecOps", "Configuration Audit"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset:(azure.activitylogs or azure.auditlogs) and
event.action:"Update conditional access policy" and event.outcome:(Success or success)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1098"
name = "Account Manipulation"
reference = "https://attack.mitre.org/techniques/T1098/"


[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

