[metadata]
creation_date = "2021/11/27"
maturity = "production"
integration = "azure"
updated_date = "2021/12/14"

[rule]
author = ["Austin Songer"]
description = """
Identifies when a user has been elevated to manage all Azure Subscriptions. This setting could allow an attacker access to Azure 
subscriptions in your environment.
"""
false_positives = [
    """
    If this was approved by System Administrator.
    """,
]
from = "now-25m"
index = ["filebeat-*", "logs-azure*"]
language = "kuery"
license = "Elastic License v2"
name = "Azure "
note = """## Config

The Azure Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule."""
references = [
    "https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts#assignment-and-elevation",
    "https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations#microsoftauthorization",
    "https://docs.microsoft.com/en-us/azure/role-based-access-control/built-in-roles#user-access-administrator",
]
risk_score = 47
rule_id = "c9576b84-aec1-4269-b2b8-c9c23f857e84"
severity = "medium"
tags = ["Elastic", "Cloud", "Azure", "Continuous Monitoring", "SecOps"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset:azure.activitylogs and (azure.activitylogs.operation_name:*/ROLEASSIGNMENTS/WRITE and 
azure.activitylogs.properties:*18d7d88d-d35e-4fb5-a5c3-7773c20a72d9*) or 
(azure.activitylogs.operation_name: 
    (
    MICROSOFT.AUTHORIZATION/ELEVATEACCESS/ACTION or 
    MICROSOFT.AUTHORIZATION/CLASSICADMINISTRATORS/WRITE
    ))
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1078"
name = "Valid Accounts"
reference = "https://attack.mitre.org/techniques/T1078/"
[rule.threat.tactic]
id = "TA0001"
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0001/"



[rule.threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"
