[metadata]
creation_date = "2020/09/02"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/09/02"

[rule]
author = ["Elastic"]
description = """
Identifies InstallUtil.exe making outbound network connections. This may indicate adversarial activity as InstallUtil is
often leveraged by adversaries to execute code and evade detection.
"""
from = "now-9m"
index = ["logs-endpoint.events.*", "winlogbeat-*"]
language = "eql"
license = "Elastic License"
name = "InstallUtil Making Network Connections"
risk_score = 21
rule_id = "a13167f1-eec2-4015-9631-1fee60406dcf"
severity = "medium"
tags = ["Elastic", "Windows"]
type = "eql"

query = '''
// this can be done without a sequence however, this does include more info on the process

sequence by process.entity_id, process.pid, process.name
  [process where event.type in ("start", "process_started") and process.name == "installutil.exe"]
  [network where event.type == "connection" and network.direction == "outgoing"]
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1118"
name = "InstallUtil"
reference = "https://attack.mitre.org/techniques/T1118/"


[rule.threat.tactic]
id = "TA0010"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0010/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1118"
name = "InstallUtil"
reference = "https://attack.mitre.org/techniques/T1118/"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1118"
name = "InstallUtil"
reference = "https://attack.mitre.org/techniques/T1118/"


[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"

