[metadata]
creation_date = "2020/09/02"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/09/02"

[rule]
author = ["Elastic"]
description = """
Identifies Mshta.exe making outbound network connections. This may indicate adversarial activity as Mshta is often
leveraged by adversaries to execute malicious scripts and evade detection.
"""
from = "now-9m"
index = ["logs-endpoint.events.*", "winlogbeat-*"]
language = "eql"
license = "Elastic License"
name = "Mshta Making Network Connections"
risk_score = 21
rule_id = "c2d90150-0133-451c-a783-533e736c12d7"
severity = "medium"
tags = ["Elastic", "Windows"]
type = "eql"

query = '''
sequence by process.entity_id, process.pid, process.name with maxspan=2h
  [process where event.type in ("start", "process_started") and process.name == "mshta.exe" and
     process.parent.name != "Microsoft.ConfigurationManagement.exe" and
     process.parent.executable not in ("C:\\Amazon\\Amazon Assistant\\amazonAssistantService.exe",
                                       "C:\\TeamViewer\\TeamViewer.exe") and
     process.args != "ADSelfService_Enroll.hta"]
  [network where process.name == "mshta.exe"]
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1170"
name = "Mshta"
reference = "https://attack.mitre.org/techniques/T1170/"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"
