[metadata]
creation_date = "2020/09/02"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/09/02"

[rule]
author = ["Elastic"]
description = """
Identifies unusual instances of Rundll32.exe making outbound network connections. This may indicate adversarial activity
and may identify malicious DLLs.
"""
from = "now-9m"
index = ["logs-endpoint.events.*", "winlogbeat-*"]
language = "eql"
license = "Elastic License"
name = "Unusual Network Connection via RunDLL32: Sequence"
risk_score = 21
rule_id = "2b347f66-6739-4ae3-bd94-195036dde8b3"
severity = "low"
tags = ["Elastic", "Windows"]
type = "eql"

query = '''
sequence by process.entity_id with maxspan=2h
  [process where event.type in ("start", "process_started") and
     (process.name == "rundll32.exe" or process.pe.original_file_name == "rundll32.exe") and

     /* zero arguments excluding the binary itself (and accounting for when the binary may not be logged in args) */
     ((process.args == "rundll32.exe" and process.args_count == 1) or
      (process.args != "rundll32.exe" and process.args_count == 0))]

  [network where event.type == "connection" and
     (process.name == "rundll32.exe" or process.pe.original_file_name == "rundll32.exe")]
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1085"
name = "Rundll32"
reference = "https://attack.mitre.org/techniques/T1085/"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"
