[metadata]
creation_date = "2020/12/15"
maturity = "production"
updated_date = "2020/12/15"

[rule]
author = ["Elastic"]
description = """
Identifies use of PowerShell Exchange Set-CASMailbox Command to add a new ActiveSync Allowed Device. Adversaries may
target user email to collect sensitive information.
"""
false_positives = ["Legitimate exchange system administration activity."]
index = ["logs-endpoint.events.*", "winlogbeat-*"]
language = "eql"
license = "Elastic License"
name = "New ActiveSync Allowed Device Added via PowerShell"
references = [
    "https://www.volexity.com/blog/2020/12/14/dark-halo-leverages-solarwinds-compromise-to-breach-organizations/",
    "https://docs.microsoft.com/en-us/powershell/module/exchange/set-casmailbox?view=exchange-ps",
]
risk_score = 47
rule_id = "ce64d965-6cb0-466d-b74f-8d2c76f47f05"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Collection"]
type = "eql"

query = '''
process where event.type in ("start", "process_started") and
  process.name: "powershell.exe" and process.args : "Set-CASMailbox*ActiveSyncAllowedDeviceIDs*"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1114"
name = "Email Collection"
reference = "https://attack.mitre.org/techniques/T1114/"


[rule.threat.tactic]
id = "TA0009"
name = "Collection"
reference = "https://attack.mitre.org/tactics/TA0009/"

