[metadata]
creation_date = "2020/12/14"
maturity = "production"
updated_date = "2021/04/14"

[rule]
author = ["Elastic"]
description = """
The malware known as SUNBURST targets the SolarWind's Orion business software for command and control. This rule detects
post-exploitation command and control activity of the SUNBURST backdoor.
"""
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "eql"
license = "Elastic License v2"
name = "SUNBURST Command and Control Activity"
note = "The SUNBURST malware attempts to hide within the Orion Improvement Program (OIP) network traffic. As this rule detects post-exploitation network traffic, investigations into this should be prioritized."
references = [
    "https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html",
]
risk_score = 73
rule_id = "22599847-5d13-48cb-8872-5796fee8692b"
severity = "high"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Command and Control"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
network where event.type == "protocol" and network.protocol == "http" and
  process.name : ("ConfigurationWizard.exe",
                  "NetFlowService.exe",
                  "NetflowDatabaseMaintenance.exe",
                  "SolarWinds.Administration.exe",
                  "SolarWinds.BusinessLayerHost.exe",
                  "SolarWinds.BusinessLayerHostx64.exe",
                  "SolarWinds.Collector.Service.exe",
                  "SolarwindsDiagnostics.exe") and
  (http.request.body.content : "*/swip/Upload.ashx*" and http.request.body.content : ("POST*", "PUT*")) or
  (http.request.body.content : "*/swip/SystemDescription*" and http.request.body.content : ("GET*", "HEAD*")) or
  (http.request.body.content : "*/swip/Events*" and http.request.body.content : ("GET*", "HEAD*")) and
  not http.request.body.content : "*solarwinds.com*"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1071"
reference = "https://attack.mitre.org/techniques/T1071/"
name = "Application Layer Protocol"
[[rule.threat.technique.subtechnique]]
id = "T1071.001"
reference = "https://attack.mitre.org/techniques/T1071/001/"
name = "Web Protocols"



[rule.threat.tactic]
id = "TA0011"
reference = "https://attack.mitre.org/tactics/TA0011/"
name = "Command and Control"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1195"
reference = "https://attack.mitre.org/techniques/T1195/"
name = "Supply Chain Compromise"
[[rule.threat.technique.subtechnique]]
id = "T1195.002"
reference = "https://attack.mitre.org/techniques/T1195/002/"
name = "Compromise Software Supply Chain"



[rule.threat.tactic]
id = "TA0001"
reference = "https://attack.mitre.org/tactics/TA0001/"
name = "Initial Access"

