[metadata]
creation_date = "2020/09/02"
maturity = "production"
updated_date = "2021/04/14"

[rule]
author = ["Elastic"]
description = "Identifies an executable or script file remotely downloaded via a TeamViewer transfer session."
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Remote File Copy via TeamViewer"
references = ["https://blog.menasec.net/2019/11/hunting-for-suspicious-use-of.html"]
risk_score = 47
rule_id = "b25a7df2-120a-4db2-bd3f-3e4b86b24bee"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Command and Control"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
file where event.type == "creation" and process.name : "TeamViewer.exe" and
  file.extension : ("exe", "dll", "scr", "com", "bat", "ps1", "vbs", "vbe", "js", "wsh", "hta")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1105"
reference = "https://attack.mitre.org/techniques/T1105/"
name = "Ingress Tool Transfer"


[rule.threat.tactic]
id = "TA0011"
reference = "https://attack.mitre.org/tactics/TA0011/"
name = "Command and Control"

