[metadata]
creation_date = "2020/09/03"
maturity = "production"
updated_date = "2021/04/14"

[rule]
author = ["Elastic"]
description = "Identifies the Windows Defender configuration utility (MpCmdRun.exe) being used to download a remote file."
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Remote File Download via MpCmdRun"
note = """### Investigating Remote File Download via MpCmdRun
Verify details such as the parent process, URL reputation, and downloaded file details. Additionally, `MpCmdRun` logs this information in the Appdata Temp folder in `MpCmdRun.log`."""
references = [
    "https://twitter.com/mohammadaskar2/status/1301263551638761477",
    "https://www.bleepingcomputer.com/news/microsoft/microsoft-defender-can-ironically-be-used-to-download-malware/",
]
risk_score = 47
rule_id = "c6453e73-90eb-4fe7-a98c-cde7bbfc504a"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Command and Control"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type == "start" and
  (process.name : "MpCmdRun.exe" or process.pe.original_file_name == "MpCmdRun.exe") and
  (process.args : ("-DownloadFile", "-downloadfile") and process.args : "-url" and process.args : "-path")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1105"
reference = "https://attack.mitre.org/techniques/T1105/"
name = "Ingress Tool Transfer"


[rule.threat.tactic]
id = "TA0011"
reference = "https://attack.mitre.org/tactics/TA0011/"
name = "Command and Control"

