[metadata]
creation_date = "2020/12/14"
maturity = "production"
updated_date = "2021/02/16"

[rule]
author = ["Elastic"]
description = """
The malware known as SUNBURST targets the SolarWind's Orion business software for command and control. This rule detects
post-exploitation command and control activity of the SUNBURST backdoor.
"""
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "SUNBURST Command and Control Activity"
note = "The SUNBURST malware attempts to hide within the Orion Improvement Program (OIP) network traffic. As this rule detects post-exploitation network traffic, investigations into this should be prioritized."
references = [
    "https://www.fireeye.com/blog/threat-research/2020/12/evasive-attacker-leverages-solarwinds-supply-chain-compromises-with-sunburst-backdoor.html",
]
risk_score = 73
rule_id = "22599847-5d13-48cb-8872-5796fee8692b"
severity = "high"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Command and Control"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.category:network and event.type:protocol and network.protocol:http and
	process.name:(
		ConfigurationWizard.exe or
		NetFlowService.exe or
		NetflowDatabaseMaintenance.exe or
		SolarWinds.Administration.exe or
		SolarWinds.BusinessLayerHost.exe or
		SolarWinds.BusinessLayerHostx64.exe or
		SolarWinds.Collector.Service.exe or
		SolarwindsDiagnostics.exe) and
  http.request.body.content:((
    (*/swip/Upload.ashx* and (POST* or PUT*)) or
    (*/swip/SystemDescription* and (GET* or HEAD*)) or
    (*/swip/Events* and (GET* or HEAD*))) and not
    *solarwinds.com*)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1071"
name = "Application Layer Protocol"
reference = "https://attack.mitre.org/techniques/T1071/"
[[rule.threat.technique.subtechnique]]
id = "T1071.001"
name = "Web Protocols"
reference = "https://attack.mitre.org/techniques/T1071/001/"



[rule.threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1195"
name = "Supply Chain Compromise"
reference = "https://attack.mitre.org/techniques/T1195/"
[[rule.threat.technique.subtechnique]]
id = "T1195.002"
name = "Compromise Software Supply Chain"
reference = "https://attack.mitre.org/techniques/T1195/002/"



[rule.threat.tactic]
id = "TA0001"
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0001/"

