[metadata]
creation_date = "2023/01/18"
integration = ["endpoint", "windows"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2023/01/18"

[rule]
author = ["Elastic"]
description = """
Identifies instances of common browsers (iexplore.exe, chrome and firefox.exe) with no process arguments and making
network connections. Adversaries could abuse this behavior to avoid suspicious processes making network connections 
and bypass host-based firewall restrictions.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Potential Command and Control via a Browser"
risk_score = 47
rule_id = "dd4a1971-39b0-4977-b593-03b62d072bb6"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Command and Control"]
type = "eql"

query = '''
sequence by process.entity_id with maxspan=3m
 [process where event.action : "start" and process.name : ("iexplore.exe", "chrome.exe", "firefox.exe") and process.args_count <=1 and 
  not startswith~(process.name, process.parent.name)]
 [network where process.name : ("iexplore.exe", "chrome.exe", "firefox.exe") and not destination.address in ("127.0.0.1", "::1")]
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1071"
name = "Application Layer Protocol"
reference = "https://attack.mitre.org/techniques/T1071/"


[rule.threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"
