[metadata]
creation_date = "2023/03/02"
integration = ["endpoint"]
maturity = "production"
min_stack_comments = "New fields added: Lsass access events added in Elastic Endpoint 8.7."
min_stack_version = "8.7.0"
updated_date = "2023/03/02"

[rule]
author = ["Elastic"]
description = """
Identifies access attempts to the LSASS handle, which may indicate an attempt to dump credentials from LSASS memory.
"""
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "eql"
license = "Elastic License v2"
name = "LSASS Process Access via Windows API"
references = ["https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.001/T1003.001.md"]
risk_score = 47
rule_id = "ff4599cb-409f-4910-a239-52e4e6f532ff"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Credential Access"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
api where host.os.type == "windows" and Target.process.name : "lsass.exe"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1003"
name = "OS Credential Dumping"
reference = "https://attack.mitre.org/techniques/T1003/"
[[rule.threat.technique.subtechnique]]
id = "T1003.001"
name = "LSASS Memory"
reference = "https://attack.mitre.org/techniques/T1003/001/"



[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"
