[metadata]
creation_date = "2022/01/24"
maturity = "production"
updated_date = "2022/02/28"

[rule]
author = ["Elastic"]
description = """
Identifies the modification of account Kerberos preauthentication options. An adversary with GenericWrite/GenericAll rights over
the account can maliciously modify these settings to perform offline password cracking attacks such as AS-REP roasting.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-windows.*", "logs-system.*"]
language = "kuery"
license = "Elastic License v2"
name = "Kerberos Preauthentication Disabled for User"
note = """## Triage and analysis

### Investigating Kerberos Preauthentication Disabled for User

Kerberos Preauthentication is an account protection against offline Password Cracking. When enabled, a user requesting
access to a resource initiates communication with the Domain Controller (DC) by sending an Authentication Server Request
(AS-REQ) message with a timestamp that is encrypted with the hash of their password. If and only if the DC is able to
successfully decrypt the timestamp with the hash of the user’s password, it will then send an Authentication Server
Response (AS-REP) message that contains the Ticket Granting Ticket (TGT) to the user. Part of the AS-REP message is
signed with the user’s password.

AS-REP roasting is an attack against Kerberos for user accounts that do not require preauthentication, which means that
if the target user has preauthentication disabled, an attacker can request authentication data for it and get a TGT that
can be brute-forced offline, similarly to Kerberoasting.

#### Possible investigation steps:

- Identify the account that performed the action.
- Check whether this user should be doing this kind of activity.
- Investigate if the target account is Privileged.
- Contact the account owner and confirm whether they are aware of this activity.

### False Positive Analysis

- Disabling the preauthentication is a bad security practice and should not be allowed in the domain. The security team
should map and monitor any potential B-TP (Benign True Positive), especially if the target account is privileged.

### Response and Remediation

- Initiate the incident response process based on the outcome of the triage.
- Reset the target account's password if there is any risk of TGTs have been retrieved.
- Reset the password of the origin user if the activity was not recognized by the account owner.
- Re-enable the preauthentication option for the account.

## Config

The 'Audit User Account Management' logging policy must be configured for (Success, Failure).
Steps to implement the logging policy with Advanced Audit Configuration:

```
Computer Configuration > 
Policies > 
Windows Settings > 
Security Settings > 
Advanced Audit Policies Configuration > 
Audit Policies > 
Account Management > 
Audit User Account Management (Success,Failure)
```
"""
references = [
    "https://www.harmj0y.net/blog/activedirectory/roasting-as-reps",
    "https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4738",
    "https://github.com/atc-project/atomic-threat-coverage/blob/master/Atomic_Threat_Coverage/Logging_Policies/LP_0026_windows_audit_user_account_management.md"
]
risk_score = 47
rule_id = "e514d8cd-ed15-4011-84e2-d15147e059f1"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Credential Access"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.code:4738 and message:"'Don't Require Preauth' - Enabled"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1558"
name = "Steal or Forge Kerberos Tickets"
reference = "https://attack.mitre.org/techniques/T1558/"

  [[rule.threat.technique.subtechnique]]
  name = "AS-REP Roasting"
  id = "T1558.004"
  reference = "https://attack.mitre.org/techniques/T1558/004/"

[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

