[metadata]
creation_date = "2022/01/24"
maturity = "production"
updated_date = "2022/01/24"

[rule]
author = ["Elastic"]
description = """
Identifies the modification of the account option "Do not require Kerberos preauthentication" to enabled,
which exposes the account to offline Password Cracking attacks such as AS-REP roasting.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-windows.*", "logs-system.*"]
language = "kuery"
license = "Elastic License v2"
name = "Kerberos Preauthentication Disabled for User"
references = [
    "https://www.harmj0y.net/blog/activedirectory/roasting-as-reps",
]
risk_score = 47
rule_id = "b83a7e96-2eb3-4edf-8346-427b6858d3bd"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Credential Access"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.code:4738 and message:"'Don't Require Preauth' - Enabled"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1558"
name = "Steal or Forge Kerberos Tickets"
reference = "https://attack.mitre.org/techniques/T1558/"

  [[rule.threat.technique.subtechnique]]
  name = "AS-REP Roasting"
  id = "T1558.004"
  reference = "https://attack.mitre.org/techniques/T1558/004/"

[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

