[metadata]
creation_date = "2020/08/31"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/08/31"

[rule]
author = ["Elastic"]
description = "Identifies the default Mimikatz Memssp Module passwords logs file."
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Mimikatz Memssp Logs File Detected"
risk_score = 73
rule_id = "ebb200e8-adf0-43f8-a0bb-4ee5b5d852c6"
severity = "high"
tags = ["Elastic", "Windows"]
type = "query"

query = '''
event.category:file and file.name:mimilsa.log and process.name:lsass.exe
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1003"
name = "Credential Dumping"
reference = "https://attack.mitre.org/techniques/T1003/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

