[metadata]
creation_date = "2020/08/13"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/08/13"

[rule]
author = ["Elastic"]
description = """
Identifies creation of Domain Backup private keys, which may indicate activity related to Domain Backdup DPAPI
decryption keys access.
"""
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Creation or Modification of Domain Backup DPAPI private key"
note = "### Domain DPAPI Backup keys are stored on domain controllers and can be dumped remotely with tools such as Mimikatz. The resulting .pvk private key can be used to decrypt ANY domain user masterkeys, which then can be used to decrypt any secrets protected by those keys."
references = ["https://www.dsinternals.com/en/retrieving-dpapi-backup-keys-from-active-directory/"]
risk_score = 73
rule_id = "b83a7e96-2eb3-4edf-8346-427b6858d3bd"
severity = "high"
tags = ["Elastic", "Windows"]
type = "query"

query = '''
event.category:file and not event.type:deletion and 
 file.name:(ntds_capi_*.pfx or ntds_capi_*.pvk)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1145"
name = "Private Keys"
reference = "https://attack.mitre.org/techniques/T1145/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"
