[metadata]
creation_date = "2020/11/24"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/24"

[rule]
author = ["Elastic"]
description = """
Identifies copy operation of the Active Directory Domain Database file (ntds.dit) or Security Account Manager (SAM).
Those file contains sensitive information including hashed domain and/or local credentials.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "eql"
license = "Elastic License"
max_signals = 33
name = "NTDS or SAM Database File Copied"
references = ["https://thedfirreport.com/2020/11/23/pysa-mespinoza-ransomware/"]
risk_score = 73
rule_id = "3bc6deaa-fbd4-433a-ae21-3e892f95624f"
severity = "high"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Credential Access"]
type = "eql"

query = '''
process where event.type in ("start", "process_started") and
process.pe.original_file_name in ("Cmd.Exe", "PowerShell.EXE", "XCOPY.EXE") and
(process.args:"copy" or process.args : "xcopy" or process.args : "Copy-Item") and
wildcard(process.args, "*\\ntds.dit", "*\\config\\SAM", "\\*\\GLOBALROOT\\Device\\HarddiskVolumeShadowCopy*\\*")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1003"
name = "OS Credential Dumping"
reference = "https://attack.mitre.org/techniques/T1003/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

