[metadata]
creation_date = "2020/11/12"
maturity = "development"
updated_date = "2020/11/12"

[rule]
author = ["Anabella Cristaldi"]
description = """
Identifies attempts to clear Windows event log stores. This is often done by attackers in an attempt to evade
detection or destroy forensic evidence on a system.
"""
from = "now-9m"
index = ["winlogbeat-*"]
language = "kuery"
license = "Elastic License"
name = "Windows Event Logs Cleared"
risk_score = 21
rule_id = "45ac4800-840f-414c-b221-53dd36a5aaf7"
severity = "low"
tags = ["Host", "Windows", "Threat Detection", "Defense Evasion"]
type = "query"

query = '''
event.action:("audit-log-cleared" or "Log clear")
'''
