[metadata]
creation_date = "2020/10/13"
maturity = "production"
updated_date = "2020/10/13"

[rule]
author = ["Elastic"]
description = "Identifies abuse of the Windows Update Auto Update Client (wuauclt.exe) to load an arbitrary DLL."
from = "now-9m"
index = ["logs-endpoint.events.*", "winlogbeat-*"]
language = "eql"
license = "Elastic License"
name = "ImageLoad via Windows Update Auto Update Client"
references = ["https://dtm.uk/wuauclt/"]
risk_score = 47
rule_id = "edf8ee23-5ea7-4123-ba19-56b41e424ae3"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]
type = "eql"

query = '''

process where event.type in ("start", "process_started") and
  (process.pe.original_file_name == "wuauclt.exe" or process.name : "wuauclt.exe") and
  
   /* necessary windows update client args to load a dll */
   
   process.args : "/RunHandlerComServer" and process.args : "/UpdateDeploymentProvider" and
   
   /* common paths writeable by a standard user where the target DLL can be placed */
   
   process.args : ("C:\\Users\\*.dll", "C:\\ProgramData\\*.dll", "C:\\Windows\\Temp\\*.dll", "C:\\Windows\\Tasks\\*.dll")
  
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1218"
name = "Signed Binary Proxy Execution"
reference = "https://attack.mitre.org/techniques/T1218/"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"
