[metadata]
creation_date = "2025/11/12"
integration = ["windows"]
maturity = "production"
updated_date = "2025/11/12"

[rule]
author = ["Elastic"]
description = """
Identifies the creation of a svchost process with an unusual parent. This may indicate an attempt to masquerade a
malicious process.
"""
from = "now-9m"
language = "esql"
license = "Elastic License v2"
name = "Potential Masquerading as Svchost"
note = """ ## Triage and analysis

### Investigating Potential Masquerading as Svchost

PowerShell, a powerful scripting language in Windows environments, can be exploited by adversaries using obfuscation techniques like backtick-escaped variable expansion to evade detection. This method involves disguising malicious scripts to bypass security measures. The detection rule identifies scripts with excessive length and specific obfuscation patterns, flagging potential threats for further analysis.

### Possible investigation steps

- Review the `powershell.file.script_block_text` field to understand the content of the script and identify any suspicious or malicious commands.
- Examine the `file.path` and `file.name` fields to determine the origin and context of the script execution, which may provide insights into whether the script is part of a legitimate process or potentially malicious activity.
- Check the `host.name` and `agent.id` fields to identify the affected system and correlate with other security events or logs from the same host for additional context.
- Analyze the `user.id` field to determine which user account executed the script, and assess whether this activity aligns with the user's typical behavior or role.
- Investigate the `powershell.file.script_block_id` and `powershell.sequence` fields to trace the execution flow of the script and identify any related script blocks that may have been executed in sequence.
- Consider the `count` field to evaluate the extent of obfuscation used in the script, which may indicate the level of sophistication or intent behind the script.

### False positive analysis

- Scripts with legitimate administrative functions may use backtick-escaped variable expansion for complex string manipulations. Review the script's context and purpose to determine if it aligns with expected administrative tasks.
- Automated scripts generated by trusted software might include obfuscation patterns as part of their normal operation. Verify the source and integrity of the software to ensure it is from a reputable vendor.
- Developers and IT professionals may use obfuscation techniques during testing or development phases. Establish a process to whitelist known development environments or user accounts to reduce unnecessary alerts.
- PowerShell scripts that are part of legitimate security tools or monitoring solutions may trigger the rule. Identify and exclude these tools by their file path or script block ID to prevent false positives.
- Regularly update the list of known false positives based on historical data and feedback from users to refine the detection rule and improve its accuracy.

### Response and remediation

- Isolate the affected host immediately to prevent further spread of the potentially malicious script across the network.
- Terminate any suspicious PowerShell processes identified by the alert to halt the execution of obfuscated scripts.
- Conduct a thorough review of the script block text and associated file paths to identify and remove any malicious scripts or files from the system.
- Reset credentials for any user accounts involved in the alert to mitigate the risk of compromised credentials being used for further attacks.
- Escalate the incident to the security operations team for a deeper investigation into potential lateral movement or additional compromised systems.
- Implement enhanced monitoring on the affected host and similar systems to detect any recurrence of obfuscation techniques or related suspicious activities.
- Update endpoint protection and intrusion detection systems with indicators of compromise (IOCs) derived from the analysis to improve detection capabilities for similar threats in the future.
"""
risk_score = 73
rule_id = "32f95776-6498-4f3c-a90c-d4f6083e3901"
severity = "high"
tags = [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Defense Evasion",
    "Resources: Investigation Guide",
]
timestamp_override = "event.ingested"
type = "esql"

query = '''
FROM logs-* metadata _id, _version, _index
| WHERE QSTR("event.category:process and event.type:start and process.name:svchost.exe~1 AND NOT process.name:svchost.exe") OR
  (to_lower(process.name) == "svchost.exe" and
   not to_lower(process.executable) like """c:\\windows\\system32\\svchost.exe""" and
   not to_lower(process.executable) like """c:\\windows\\syswow64\\svchost.exe""" and
   not process.executable like """\\Device\\HarddiskVolume*\\Windows\\System32\\svchost.exe""" and
   not process.executable like """\\Device\\HarddiskVolume*\\Windows\\SysWOW64\\svchost.exe""")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1036"
name = "Masquerading"
reference = "https://attack.mitre.org/techniques/T1036/"
[[rule.threat.technique.subtechnique]]
id = "T1036.005"
name = "Match Legitimate Resource Name or Location"
reference = "https://attack.mitre.org/techniques/T1036/005/"



[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

