[metadata]
creation_date = "2020/11/12"
ecs_version = ["1.6.0"]
maturity = "development"
updated_date = "2020/11/12"

[rule]
author = ["Anabella Cristaldi"]
description = "Looks for events related to clearing security logs"
index = ["winlogbeat-*"]
language = "kuery"
license = "Elastic License"
name = "Clearing Windows Security Logs"
risk_score = 21
rule_id = "95ba057e-4a9c-41af-9dda-510516fdfbe4"
severity = "low"
tags = ["Windows"]
type = "query"

query = '''
event.module:security and event.action:audit-log-cleared
'''

