[metadata]
creation_date = "2021/07/20"
maturity = "production"
updated_date = "2022/03/28"

[rule]
author = ["Elastic"]
description = """
Identifies modifications to the Windows Defender configuration settings using PowerShell to add exclusions at the folder directory or process level.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Windows Defender Exclusions Added via PowerShell"
note = """## Triage and analysis 
 
### Investigating Windows Defender Exclusions 
 
Microsoft Windows Defender is an anti-virus product built into Microsoft Windows. Since this software product is 
used to prevent and stop malware, it's important to monitor what specific exclusions are made to the product's configuration 
settings. These can often be signs of an adversary or malware trying to bypass Windows Defender's capabilities. One of the more 
notable [examples](https://www.cyberbit.com/blog/endpoint-security/latest-trickbot-variant-has-new-tricks-up-its-sleeve/) was observed in 2018 where Trickbot incorporated mechanisms to disable Windows Defender to avoid detection. 
 
#### Possible investigation steps: 
- With this specific rule, it's completely possible to incorrectly match on network administrative activity or benign users 
using scripting and PowerShell to configure the different exclusions for Windows Defender. Therefore, it's important to 
identify the source of the activity first and determine if there is any mal-intent behind the events. 
- The actual exclusion such as the process, file, or directory should be reviewed in order to determine the 
intent behind the exclusion. Is the excluded file or process malicious in nature or is it related to software that needs 
to be legitimately allowlisted from Windows Defender? 
 
### False Positive Analysis 
- This rule has a high chance to produce false positives due to how often network administrators legitimately configure exclusions. 
In order to validate the activity further, review the specific exclusion and its intent. There 
are many legitimate reasons for exclusions, so it's important to gain context. 
 
### Related Rules 
- Windows Defender Disabled via Registry Modification 
- Disabling Windows Defender Security Settings via PowerShell 
 
### Response and Remediation 
- Since this is related to post-exploitation activity, take immediate action to review, investigate and 
potentially isolate further activity. 
- If further analysis showed malicious intent was behind the Defender exclusions, administrators should remove 
the exclusions and ensure antimalware has not been disabled or deleted. 
- Exclusion lists for antimalware capabilities should always be routinely monitored for review. 
""" 
references = ["https://www.bitdefender.com/files/News/CaseStudies/study/400/Bitdefender-PR-Whitepaper-MosaicLoader-creat5540-en-EN.pdf"]
risk_score = 47
rule_id = "2c17e5d7-08b9-43b2-b58a-0270d65ac85b"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type == "start" and
 (process.name : ("powershell.exe", "pwsh.exe", "powershell_ise.exe") or process.pe.original_file_name in ("powershell.exe", "pwsh.dll", "powershell_ise.exe")) and
  process.args : ("*Add-MpPreference*", "*Set-MpPreference*") and
  process.args : ("*-Exclusion*")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1562"
name = "Impair Defenses"
reference = "https://attack.mitre.org/techniques/T1562/"
[[rule.threat.technique.subtechnique]]
id = "T1562.006"
name = "Indicator Blocking"
reference = "https://attack.mitre.org/techniques/T1562/006/"

[[rule.threat.technique.subtechnique]]
id = "T1562.001"
name = "Disable or Modify Tools"
reference = "https://attack.mitre.org/techniques/T1562/001/"



[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[rule.threat.technique.subtechnique]]
id = "T1059.001"
name = "PowerShell"
reference = "https://attack.mitre.org/techniques/T1059/001/"


[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
