[metadata]
creation_date = "2020/02/18"
maturity = "production"
updated_date = "2022/03/14"

[rule]
author = ["Elastic"]
description = """
Identifies use of the netsh.exe to disable or weaken the local firewall. Attackers will use this command line tool to
disable the firewall during troubleshooting or to enable network mobility.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Disable Windows Firewall Rules via Netsh"
note = """## Triage and analysis

### Investigating Disable Windows Firewall Rules via Netsh

The Windows Defender Firewall is a native component which provides host-based, two-way network traffic filtering for a
device, and blocks unauthorized network traffic flowing into or out of the local device.

Attackers can disable firewall rules which are intended to prevent lateral movement and command and control traffic to
enable their operations.

This rule identifies patterns related to disabling firewall rules using the `netsh.exe` utility.

#### Possible investigation steps:

- Identify the user account which performed the action and whether it should perform this kind of action.
- Contact the user to check if it is aware of the operation.
- Investigate script execution chain (parent process tree).
- Investigate other alerts related to the user/host in the last 48 hours.
- Analyze the command run to determine what was allowed by it.

### False Positive Analysis

- This mechanism can be used legitimately. Check whether the user should be performing this kind of activity or is aware of it.
- Assess the need to disable the modification of the rule, and if these actions do not expose the environment to
unnecessary risks.

### Response and Remediation

- Initiate the incident response process based on the outcome of the triage.
- Quarantine the involved host to prevent further post-compromise behavior.
- Evaluate exceptions that can be added to the firewall rule and re-enable the rule.
- Review the privileges of the account involved.
"""
risk_score = 47
rule_id = "4b438734-3793-4fda-bd42-ceeada0be8f9"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type in ("start", "process_started") and
  process.name : "netsh.exe" and
  (process.args : "disable" and process.args : "firewall" and process.args : "set") or
  (process.args : "advfirewall" and process.args : "off" and process.args : "state")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1562"
reference = "https://attack.mitre.org/techniques/T1562/"
name = "Impair Defenses"
[[rule.threat.technique.subtechnique]]
id = "T1562.004"
reference = "https://attack.mitre.org/techniques/T1562/004/"
name = "Disable or Modify System Firewall"



[rule.threat.tactic]
id = "TA0005"
reference = "https://attack.mitre.org/tactics/TA0005/"
name = "Defense Evasion"

