[metadata]
creation_date = "2021/10/15"
maturity = "production"
updated_date = "2021/10/15"


[rule]
author = ["Elastic"]
description = """
Identifies when a user disables the Windows Firewall Profile to help evade defense.
"""
from = "now-9m"
index = ["logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Windows Firewall Profile Disabled"
references = [
    "https://docs.microsoft.com/en-us/powershell/module/netsecurity/set-netfirewallprofile?view=windowsserver2019-ps",
    "https://www.tutorialspoint.com/how-to-get-windows-firewall-profile-settings-using-powershell",
    "http://powershellhelp.space/commands/set-netfirewallrule-psv5.php",
    "http://woshub.com/manage-windows-firewall-powershell/",
]
risk_score = 47
rule_id = "f63c8e3c-d396-404f-b2ea-0379d3942d73"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Execution"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type == "start" and
 (process.name : ("powershell.exe", "pwsh.exe") or process.pe.original_file_name == "PowerShell.EXE") and
  process.args : "Set-NetFirewallProfile" and 
  process.args : ("-Profile*", "-Enabled*", "False")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1562"
name = "Impair Defenses"
reference = "https://attack.mitre.org/techniques/T1562"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

