[metadata]
creation_date = "2021/05/28"
maturity = "production"
updated_date = "2021/05/28"

[rule]
author = ["Elastic"]
description = """
Identifies when a script interpreter or signed binary is launched via a non-standard working directory. An attacker may
use this technique to evade defenses.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Suspicious Execution from a Mounted Device"
references = [
    "https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/",
    "https://www.volexity.com/blog/2021/05/27/suspected-apt29-operation-launches-election-fraud-themed-phishing-campaigns/",
]
risk_score = 47
rule_id = "8a1d4831-3ce6-4859-9891-28931fa6101d"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type == "start" and process.executable : "C:\\*" and
  (process.working_directory : "?:\\" and not process.working_directory: "C:\\") and
  process.parent.name : "explorer.exe" and
  process.name : ("rundll32.exe", "mshta.exe", "powershell.exe", "pwsh.exe", "cmd.exe", "regsvr32.exe",
                  "cscript.exe", "wscript.exe")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
reference = "https://attack.mitre.org/techniques/T1218/"
id = "T1218"
name = "Signed Binary Proxy Execution"
[[rule.threat.technique.subtechnique]]
reference = "https://attack.mitre.org/techniques/T1218/011/"
id = "T1218.011"
name = "Rundll32"

[[rule.threat.technique.subtechnique]]
reference = "https://attack.mitre.org/techniques/T1218/005/"
id = "T1218.005"
name = "Mshta"

[[rule.threat.technique.subtechnique]]
reference = "https://attack.mitre.org/techniques/T1218/010/"
id = "T1218.010"
name = "Regsvr32"



[rule.threat.tactic]
reference = "https://attack.mitre.org/tactics/TA0005/"
id = "TA0005"
name = "Defense Evasion"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
reference = "https://attack.mitre.org/techniques/T1059/"
id = "T1059"
name = "Command and Scripting Interpreter"
[[rule.threat.technique.subtechnique]]
reference = "https://attack.mitre.org/techniques/T1059/001/"
id = "T1059.001"
name = "PowerShell"



[rule.threat.tactic]
reference = "https://attack.mitre.org/tactics/TA0002/"
id = "TA0002"
name = "Execution"
