[metadata]
creation_date = "2020/08/31"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/10/27"

[rule]
author = ["Elastic"]
description = "Identifies a suspicious Conhost child process which may be an indication of code injection activity."
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Suspicious Process from Conhost"
references = [
    "https://modexp.wordpress.com/2018/09/12/process-injection-user-data/",
    "https://github.com/sbousseaden/EVTX-ATTACK-SAMPLES/blob/master/Defense%20Evasion/evasion_codeinj_odzhan_conhost_sysmon_10_1.evtx",
]
risk_score = 73
rule_id = "28896382-7d4f-4d50-9b72-67091901fd26"
severity = "high"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]
timeline_id = "76e52245-7519-4251-91ab-262fb1a1728c"
type = "query"

query = '''
event.category:process and event.type:(start or process_started) and
  process.parent.name:conhost.exe
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1055"
name = "Process Injection"
reference = "https://attack.mitre.org/techniques/T1055/"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

