[metadata]
creation_date = "2021/01/21"
maturity = "production"
updated_date = "2021/01/21"

[rule]
author = ["Elastic"]
description = """
Identifies suspicious creation of Alternate Data Streams on highly targeted files. This is uncommon for legitimate files
and sometimes done by adversaries to hide malware.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "eql"
license = "Elastic License"
name = "Unusual File Creation - Alternate Data Stream"
risk_score = 47
rule_id = "71bccb61-e19b-452f-b104-79a60e546a95"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]
type = "eql"

query = '''
file where event.type:"creation" and
  file.name:"*:*" and not
  file.name:"*:zone.identifier*" and
  file.extension:(
    "pdf",
    "dll",
    "png",
    "exe",
    "dat",
    "com",
    "bat",
    "cmd",
    "sys",
    "vbs",
    "ps1",
    "hta",
    "txt",
    "vbe",
    "js",
    "wsh",
    "docx",
    "doc",
    "xlsx",
    "xls",
    "pptx",
    "ppt",
    "rtf",
    "gif",
    "jpg",
    "png",
    "bmp",
    "img",
    "iso")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1564"
name = "Hide Artifacts"
reference = "https://attack.mitre.org/techniques/T1564/"
[[rule.threat.technique.subtechnique]]
id = "T1564.004"
name = "NTFS File Attributes"
reference = "https://attack.mitre.org/techniques/T1564/004/"



[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

