[metadata]
creation_date = "2020/03/16"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/02"

[rule]
author = ["Elastic"]
description = """
Identifies use of bcdedit.exe to delete boot configuration data. This tactic is sometimes used as by malware or an
attacker as a destructive technique.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Modification of Boot Configuration"
risk_score = 21
rule_id = "69c251fb-a5d6-4035-b5ec-40438bd829ff"
severity = "low"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]
timeline_id = "76e52245-7519-4251-91ab-262fb1a1728c"
timeline_title = "Generic Process Timeline"
type = "query"

query = '''
event.category:process and event.type:(start or process_started) and
  process.name:bcdedit.exe and
  process.args:(/set and
    (bootstatuspolicy and ignoreallfailures or no and recoveryenabled))
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1107"
name = "File Deletion"
reference = "https://attack.mitre.org/techniques/T1107/"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

