[metadata]
creation_date = "2021/05/28"
maturity = "production"
updated_date = "2021/05/28"

[rule]
author = ["Elastic"]
description = """
Identifies when a script interpreter or signed binary proxy process is launched via a non-standard working directory. An
attacker may use this technique to evade defenses.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Suspicious Execution from a Mounted Device"
references = [
    "https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/",
    "https://www.volexity.com/blog/2021/05/27/suspected-apt29-operation-launches-election-fraud-themed-phishing-campaigns/",
]
risk_score = 47
rule_id = "8a1d4831-3ce6-4859-9891-28931fa6101d"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type : "start" and process.executable : "C:\\*" and
  process.working_directory : "?:\\" and not process.working_directory: "C:\\" and
  process.parent.name : "explorer.exe" and
  process.name : ("rundll32.exe", "mshta.exe", "powershell.exe", "pwsh.exe", "cmd.exe", "regsvr32.exe",
                  "cscript.exe", "wscript.exe")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
name = "Signed Binary Proxy Execution"
id = "T1218"
reference = "https://attack.mitre.org/techniques/T1218/"
[[rule.threat.technique.subtechnique]]
name = "Rundll32"
id = "T1218.011"
reference = "https://attack.mitre.org/techniques/T1218/011/"

[[rule.threat.technique.subtechnique]]
name = "Mshta"
id = "T1218.005"
reference = "https://attack.mitre.org/techniques/T1218/005/"

[[rule.threat.technique.subtechnique]]
name = "Regsvr32"
id = "T1218.010"
reference = "https://attack.mitre.org/techniques/T1218/010/"



[rule.threat.tactic]
name = "Defense Evasion"
id = "TA0005"
reference = "https://attack.mitre.org/tactics/TA0005/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
name = "Command and Scripting Interpreter"
id = "T1059"
reference = "https://attack.mitre.org/techniques/T1059/"
[[rule.threat.technique.subtechnique]]
name = "PowerShell"
id = "T1059.001"
reference = "https://attack.mitre.org/techniques/T1059/001/"



[rule.threat.tactic]
name = "Execution"
id = "TA0002"
reference = "https://attack.mitre.org/tactics/TA0002/"

