[metadata]
creation_date = "2020/10/13"
maturity = "production"
updated_date = "2022/03/14"

[rule]
author = ["Elastic"]
description = """
Identifies use of the network shell utility (netsh.exe) to enable inbound Remote Desktop Protocol (RDP) connections in
the Windows Firewall.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Remote Desktop Enabled in Windows Firewall by Netsh"
note = """## Triage and analysis

### Investigating Remote Desktop Enabled in Windows Firewall

Microsoft Remote Desktop Protocol (RDP) is a proprietary Microsoft protocol that enables remote connections to other
computers, typically over TCP port 3389.

Attackers use RDP in operations to conduct their actions interactively. Ransomware operators heavily use RDP to access
victim servers, often using privileged accounts.

This rule detects a Windows Firewall inbound rule being added, which will allow RDP traffic to the host using the
`netsh.exe` utility.

#### Possible investigation steps:

- Identify the user account which performed the action and whether it should perform this kind of action.
- Contact the user to check if it is aware of the operation.
- Investigate script execution chain (parent process tree).
- Investigate other alerts related to the user/host in the last 48 hours.
- Check whether it makes sense to enable RDP to this host and the host role in the environment.
- Check if the server is directly exposed to the internet.
- Check whether privileged accounts have accessed the host in a short period after the modification.

### False Positive Analysis

- This mechanism can be used legitimately. Check whether the user should be performing this kind of activity, is aware
of it, assess the need to have RDP open, and if the action does not expose the environment to unnecessary risks.

### Response and Remediation

- Initiate the incident response process based on the outcome of the triage.
- If RDP is needed, make sure to secure it:
  - Allowlist RDP traffic to specific trusted hosts.
  - Restrict RDP logins to authorized non-administrator accounts, where possible.
- Quarantine the involved host to prevent further post-compromise behavior.
- Review the privileges of the account involved.
"""
risk_score = 47
rule_id = "074464f9-f30d-4029-8c03-0ed237fffec7"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type in ("start", "process_started") and
 (process.name : "netsh.exe" or process.pe.original_file_name == "netsh.exe") and
 process.args : ("localport=3389", "RemoteDesktop", "group=\"remote desktop\"") and
 process.args : ("action=allow", "enable=Yes", "enable")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1562"
name = "Impair Defenses"
reference = "https://attack.mitre.org/techniques/T1562/"
[[rule.threat.technique.subtechnique]]
id = "T1562.004"
reference = "https://attack.mitre.org/techniques/T1562/004/"
name = "Disable or Modify System Firewall"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

