[metadata]
creation_date = "2025/11/12"
integration = ["windows"]
maturity = "production"
updated_date = "2025/11/12"

[rule]
author = ["Elastic"]
description = """
Identifies attempts to masquerade as the Service Host process `svchost.exe` to evade detection and blend in with normal system activity.
"""
from = "now-9m"
language = "esql"
license = "Elastic License v2"
name = "Potential Masquerading as Svchost"
risk_score = 73
rule_id = "32f95776-6498-4f3c-a90c-d4f6083e3901"
severity = "high"
tags = [
    "Domain: Endpoint",
    "OS: Windows",
    "Use Case: Threat Detection",
    "Tactic: Defense Evasion"
]
timestamp_override = "event.ingested"
type = "esql"

query = '''
FROM logs-* metadata _id, _version, _index
| WHERE QSTR("event.category:process and event.type:start and process.name:svchost.exe~1 AND NOT process.name:svchost.exe") OR
  (to_lower(process.name) == "svchost.exe" and
   not to_lower(process.executable) like """c:\\windows\\system32\\svchost.exe""" and
   not to_lower(process.executable) like """c:\\windows\\syswow64\\svchost.exe""" and
   not process.executable like """\\Device\\HarddiskVolume*\\Windows\\System32\\svchost.exe""" and
   not process.executable like """\\Device\\HarddiskVolume*\\Windows\\SysWOW64\\svchost.exe""")
| keep host.id, user.id, user.name, process.executable, process.parent.executable, process.command_line
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1036"
name = "Masquerading"
reference = "https://attack.mitre.org/techniques/T1036/"
[[rule.threat.technique.subtechnique]]
id = "T1036.005"
name = "Match Legitimate Resource Name or Location"
reference = "https://attack.mitre.org/techniques/T1036/005/"



[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

