[metadata]
creation_date = "2020/08/31"
maturity = "production"
updated_date = "2021/04/14"

[rule]
author = ["Elastic"]
description = "Identifies a suspicious Conhost child process which may be an indication of code injection activity."
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Suspicious Process from Conhost"
references = [
    "https://modexp.wordpress.com/2018/09/12/process-injection-user-data/",
    "https://github.com/sbousseaden/EVTX-ATTACK-SAMPLES/blob/master/Defense%20Evasion/evasion_codeinj_odzhan_conhost_sysmon_10_1.evtx",
]
risk_score = 73
rule_id = "28896382-7d4f-4d50-9b72-67091901fd26"
severity = "high"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type in ("start", "process_started") and
  process.parent.name : "conhost.exe" and
  not process.executable : ("?:\\Windows\\splwow64.exe", "?:\\Windows\\System32\\WerFault.exe", "?:\\Windows\\System32\\conhost.exe")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1055"
reference = "https://attack.mitre.org/techniques/T1055/"
name = "Process Injection"


[rule.threat.tactic]
id = "TA0005"
reference = "https://attack.mitre.org/tactics/TA0005/"
name = "Defense Evasion"

