[metadata]
creation_date = "2020/02/18"
maturity = "production"
updated_date = "2021/04/14"

[rule]
author = ["Elastic"]
description = """
Identifies the use of certutil.exe to encode or decode data. CertUtil is a native Windows component which is part of
Certificate Services. CertUtil is often abused by attackers to encode or decode base64 data for stealthier command and
control or exfiltration.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Encoding or Decoding Files via CertUtil"
risk_score = 47
rule_id = "fd70c98a-c410-42dc-a2e3-761c71848acf"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type in ("start", "process_started") and
  process.name : "certutil.exe" and process.args : ("-decode", "-encode", "/decode", "/encode")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1140"
reference = "https://attack.mitre.org/techniques/T1140/"
name = "Deobfuscate/Decode Files or Information"


[rule.threat.tactic]
id = "TA0005"
reference = "https://attack.mitre.org/tactics/TA0005/"
name = "Defense Evasion"

