[metadata]
creation_date = "2020/11/12"
maturity = "production"
updated_date = "2020/01/28"

[rule]
author = ["Elastic", "Anabella Cristaldi"]
description = """
Identifies attempts to clear Windows event log stores. This is often done by attackers in an attempt to evade detection
or destroy forensic evidence on a system.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-windows.*"]
language = "kuery"
license = "Elastic License"
name = "Windows Event Logs Cleared"
risk_score = 21
rule_id = "45ac4800-840f-414c-b221-53dd36a5aaf7"
severity = "low"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]
type = "query"

query = '''
event.action:("audit-log-cleared" or "Log clear")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1070"
name = "Indicator Removal on Host"
reference = "https://attack.mitre.org/techniques/T1070/"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

