[metadata]
creation_date = "2021/10/19"
maturity = "production"
updated_date = "2022/02/16"

[rule]
author = ["Elastic"]
description = """
Identifies the use of .NET functionality for decompression and base64 decoding combined in PowerShell scripts, which 
malware and security tools heavily use to deobfuscate payloads and load them directly in memory to bypass defenses.
"""
false_positives = ["Legitimate PowerShell Scripts which makes use of compression and encoding."]
from = "now-9m"
index = ["winlogbeat-*", "logs-windows.*"]
language = "kuery"
license = "Elastic License v2"
name = "PowerShell Suspicious Payload Encoded and Compressed"
risk_score = 47
rule_id = "81fe9dc6-a2d7-4192-a2d8-eed98afc766a"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Defense Evasion"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.category:process and 
  powershell.file.script_block_text : (
    (System.IO.Compression.DeflateStream or System.IO.Compression.GzipStream or IO.Compression.DeflateStream or IO.Compression.GzipStream) and
    FromBase64String
  )
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1140"
name = "Deobfuscate/Decode Files or Information"
reference = "https://attack.mitre.org/techniques/T1140/"

[[rule.threat.technique]]
id = "T1027"
name = "Obfuscated Files or Information"
reference = "https://attack.mitre.org/techniques/T1027/"

[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"


[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1059"
reference = "https://attack.mitre.org/techniques/T1059/"
name = "Command and Scripting Interpreter"

  [[rule.threat.technique.subtechnique]]
  id = "T1059.001"
  reference = "https://attack.mitre.org/techniques/T1059/001/"
  name = "PowerShell"

[rule.threat.tactic]
id = "TA0002"
reference = "https://attack.mitre.org/tactics/TA0002/"
name = "Execution"

