[metadata]
creation_date = "2020/11/12"
ecs_version = ["1.6.0"]
maturity = "development"
updated_date = "2020/11/12"

[rule]
author = ["Anabella Cristaldi"]
description = "Identifies attempts to clear Windows Security log stores"
from = "now-9m"
index = ["winlogbeat-*"]
interval = "6m"
language = "kuery"
license = "Elastic License"
max_signals = 99
name = "Clearing Windows Security Logs"
risk_score = 21
rule_id = "45ac4800-840f-414c-b221-53dd36a5aaf7"
severity = "low"
tags = ["Windows", "Elastic"]
to = "now-1s"
type = "query"

query = '''
event.module:security and event.action:audit-log-cleared
'''

