[metadata]
creation_date = "2020/02/18"
ecs_version = ["1.5.0"]
maturity = "production"
updated_date = "2020/08/03"

[rule]
author = ["Elastic"]
description = """
Identifies use of the wbadmin.exe to delete the backup catalog. Ransomware and other malware may do this to prevent
system recovery.
"""
index = ["winlogbeat-*", "logs-endpoint.events*"]
language = "kuery"
license = "Elastic License"
name = "Deleting Backup Catalogs with Wbadmin"
risk_score = 21
rule_id = "581add16-df76-42bb-af8e-c979bfb39a59"
severity = "low"
tags = ["Elastic", "Windows"]
type = "query"

query = '''
event.category:process and event.type:(start or process_started) and
  process.name:wbadmin.exe and process.args:(catalog and delete)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1107"
name = "File Deletion"
reference = "https://attack.mitre.org/techniques/T1107/"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

