[metadata]
creation_date = "2020/10/15"
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2022/09/20"

[rule]
author = ["Elastic"]
description = """
Identifies instances of an unusual process enumerating built-in Windows privileged local groups membership like
Administrators or Remote Desktop users.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-system.*"]
language = "eql"
license = "Elastic License v2"
name = "Enumeration of Privileged Local Groups Membership"
note = """## Triage and analysis

### Investigating Enumeration of Privileged Local Groups Membership

After successfully compromising an environment, attackers may try to gain situational awareness to plan their next steps.
This can happen by running commands to enumerate network resources, users, connections, files, and installed security
software.

This rule looks for the enumeration of privileged local groups' membership by suspicious processes, and excludes known
legitimate utilities and programs installed. Attackers can use this information to decide the next steps of the attack,
such as mapping targets for credential compromise and other post-exploitation activities.

#### Possible investigation steps

- Identify the process, host and user involved on the event.
- Investigate the process execution chain (parent process tree) for unknown processes. Examine their executable files
for prevalence, whether they are located in expected locations, and if they are signed with valid digital signatures.
- Investigate other alerts associated with the user/host during the past 48 hours.
- Investigate any abnormal account behavior, such as command executions, file creations or modifications, and network
connections.
- Retrieve the process executable and determine if it is malicious:
  - Check if the file belongs to the operating system or has a valid digital signature.
  - Use a private sandboxed malware analysis system to perform analysis.
    - Observe and collect information about the following activities:
      - Attempts to contact external domains and addresses.
      - File and registry access, modification, and creation activities.
      - Service creation and launch activities.
      - Scheduled task creation.

### False positive analysis

- Discovery activities are not inherently malicious if they occur in isolation. As long as the analyst did not identify
suspicious activity related to the user or host, such alerts can be dismissed.
- If this rule is noisy in your environment due to expected activity, consider adding exceptions — preferably with a combination
of user and command line conditions.

### Response and remediation

- Initiate the incident response process based on the outcome of the triage.
- Isolate the involved hosts to prevent further post-compromise behavior.
- Investigate credential exposure on systems compromised or used by the attacker to ensure all compromised accounts are
identified. Reset passwords for these accounts and other potentially compromised credentials, such as email, business
systems, and web services.
- Run a full antimalware scan. This may reveal additional artifacts left in the system, persistence mechanisms, and
malware components.
- Determine the initial vector abused by the attacker and take action to prevent reinfection through the same vector.
- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the
mean time to respond (MTTR).

## Setup

The 'Audit Security Group Management' audit policy must be configured (Success).
Steps to implement the logging policy with with Advanced Audit Configuration:

```
Computer Configuration >
Policies >
Windows Settings >
Security Settings >
Advanced Audit Policies Configuration >
Audit Policies >
Account Management >
Audit Security Group Management (Success)
```

Microsoft introduced the [event used](https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4799) in this detection rule on Windows 10 and Windows Server 2016 or later operating systems.

If enabling an EQL rule on a non-elastic-agent index (such as beats) for versions <8.2, events will not define `event.ingested` and default fallback for EQL rules was not added until 8.2, so you will need to add a custom pipeline to populate `event.ingested` to @timestamp for this rule to work.
"""
risk_score = 47
rule_id = "291a0de9-937a-4189-94c0-3e847c8b13e4"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Discovery", "has_guide"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
iam where event.action == "user-member-enumerated" and

  /* excluding machine account */
  not winlog.event_data.SubjectUserName: ("*$", "LOCAL SERVICE", "NETWORK SERVICE") and

  /* noisy and usual legit processes excluded */
  not winlog.event_data.CallerProcessName:
               ("-",
                "?:\\Windows\\System32\\VSSVC.exe",
                "?:\\Windows\\System32\\SearchIndexer.exe",
                "?:\\Windows\\System32\\CompatTelRunner.exe",
                "?:\\Windows\\System32\\oobe\\msoobe.exe",
                "?:\\Windows\\System32\\net1.exe",
                "?:\\Windows\\System32\\svchost.exe",
                "?:\\Windows\\System32\\Netplwiz.exe",
                "?:\\Windows\\System32\\msiexec.exe",
                "?:\\Windows\\SysWOW64\\msiexec.exe",
                "?:\\Windows\\System32\\CloudExperienceHostBroker.exe",
                "?:\\Windows\\System32\\wbem\\WmiPrvSE.exe",
                "?:\\Windows\\System32\\SrTasks.exe",
                "?:\\Windows\\System32\\lsass.exe",
                "?:\\Windows\\System32\\diskshadow.exe",
                "?:\\Windows\\System32\\dfsrs.exe",
                "?:\\Program Files\\*.exe",
                "?:\\Program Files (x86)\\*.exe",
                "?:\\WindowsAzure\\*\\WaAppAgent.exe",
                "?:\\Windows\\System32\\vssadmin.exe",
                "?:\\Windows\\VeeamVssSupport\\VeeamGuestHelper.exe",
                "?:\\Windows\\System32\\dllhost.exe",
                "?:\\Windows\\System32\\mmc.exe",
                "?:\\Windows\\System32\\SettingSyncHost.exe",
                "?:\\Windows\\ImmersiveControlPanel\\SystemSettings.exe",
                "?:\\Windows\\System32\\SystemSettingsAdminFlows.exe",
                "?:\\Windows\\Temp\\rubrik_vmware???\\snaptool.exe",
                "?:\\Windows\\System32\\inetsrv\\w3wp.exe",
                "?:\\$WINDOWS.~BT\\Sources\\*.exe",
                "?:\\Windows\\System32\\wsmprovhost.exe",
                "?:\\Windows\\System32\\spool\\drivers\\x64\\3\\x3jobt3?.exe",
                "?:\\Windows\\System32\\mstsc.exe",
                "?:\\Windows\\System32\\esentutl.exe",
                "?:\\Windows\\System32\\RecoveryDrive.exe",
                "?:\\Windows\\System32\\SystemPropertiesComputerName.exe") and

  /* privileged local groups */
  (group.name:("admin*","RemoteDesktopUsers") or
   winlog.event_data.TargetSid:("S-1-5-32-544","S-1-5-32-555"))
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
reference = "https://attack.mitre.org/techniques/T1069/"
id = "T1069"
name = "Permission Groups Discovery"
[[rule.threat.technique.subtechnique]]
reference = "https://attack.mitre.org/techniques/T1069/001/"
id = "T1069.001"
name = "Local Groups"



[rule.threat.tactic]
reference = "https://attack.mitre.org/tactics/TA0007/"
id = "TA0007"
name = "Discovery"

