[metadata]
creation_date = "2020/03/18"
maturity = "production"
updated_date = "2022/02/10"

[rule]
author = ["Elastic"]
description = """
Identifies the SYSTEM account using an account discovery utility. This could be a sign of discovery activity after an
adversary has achieved privilege escalation.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Net command via SYSTEM account"
risk_score = 21
rule_id = "2856446a-34e6-435b-9fb5-f8f040bfa7ed"
severity = "low"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Discovery"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type in ("start", "process_started") and 
  (process.Ext.token.integrity_level_name : "System" or
  winlog.event_data.IntegrityLevel : "System") and
  process.name : "whoami.exe" or
  (process.name : "net1.exe" and not process.parent.name : "net.exe")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1033"
reference = "https://attack.mitre.org/techniques/T1033/"
name = "System Owner/User Discovery"


[rule.threat.tactic]
id = "TA0007"
reference = "https://attack.mitre.org/tactics/TA0007/"
name = "Discovery"
