[metadata]
creation_date = "2023/09/21"
maturity = "production"
min_stack_comments = "Multiple field support in the New Terms rule type was added in Elastic 8.6"
min_stack_version = "8.6.0"
updated_date = "2023/09/21"

[rule]
author = ["Elastic"]
description = """
This rule leverages alert data from the building block rule "Windows System Information Discovery" to alert on signals
with unusual unique host.id, user.id and process.command_line entries. The original underlying rule identifies the
execution of commands used to discover information about the system, which attackers may use after compromising a system
to gain situational awareness.
"""
from = "now-9m"
index = [".alerts-security.*"]
language = "kuery"
license = "Elastic License v2"
name = "Unusual Signal Alert - Windows System Information Discovery"
risk_score = 21
rule_id = "5fbab7f5-c2e4-4186-9621-f2ab9deb6d6b"
severity = "low"
tags = ["Domain: Endpoint",
        "OS: Windows",
        "Use Case: Threat Detection",
        "Tactic: Discovery",
        "Rule Type: Higher-Order Rule"
        ]
timestamp_override = "event.ingested"
type = "new_terms"
query = '''
host.os.type:windows and event.kind:signal and kibana.alert.rule.rule_id:"51176ed2-2d90-49f2-9f3d-17196428b169"
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1082"
name = "System Information Discovery"
reference = "https://attack.mitre.org/techniques/T1082/"

[rule.threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"

[rule.new_terms]
field = "new_terms_fields"
value = ["host.id", "user.id", "process.command_line"]

[[rule.new_terms.history_window_start]]
field = "history_window_start"
value = "now-14d"
