[metadata]
creation_date = "2023/01/24"
integration = ["windows", "endpoint"]
maturity = "production"
min_stack_comments = "Multiple field support in the New Terms rule type was added in Elastic 8.6"
min_stack_version = "8.6.0"
updated_date = "2023/09/14"

[rule]
author = ["Elastic"]
description = """
Detects the usage of commonly used system service discovery techniques, which attackers may use during the reconnaissance phase 
after compromising a system in order to gain a better understanding of the environment and/or escalate privileges. 
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "kuery"
license = "Elastic License v2"
name = "System Service Discovery through built-in Windows Utilities"
risk_score = 21
rule_id = "e0881d20-54ac-457f-8733-fe0bc5d44c55"
severity = "low"
tags = ["Domain: Endpoint",
        "OS: Windows",
        "Use Case: Threat Detection",
        "Tactic: Discovery",
        "Data Source: Elastic Defend"
        ]
timestamp_override = "event.ingested"
type = "new_terms"

query = '''
host.os.type:windows and event.category:process and event.type:start and 
((process.name:net.exe or process.pe.original_file_name:net.exe or process.name:net1.exe and 
  not process.parent.name:net.exe) and process.args:(start or use) and process.args_count:2 or
(process.name:sc.exe or process.pe.original_file_name:sc.exe) and process.args:(query or q*) or
(process.name:tasklist.exe or process.pe.original_file_name:tasklist.exe) and process.args:/svc or
process.name:psservice.exe or process.pe.original_file_name:psservice.exe)
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1007"
name = "System Service Discovery"
reference = "https://attack.mitre.org/techniques/T1007/"

[rule.threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"

[rule.new_terms]
field = "new_terms_fields"
value = ["user.name", "process.command_line"]

[[rule.new_terms.history_window_start]]
field = "history_window_start"
value = "now-14d"
