[metadata]
creation_date = "2020/10/19"
ecs_version = ["1.6.0"]
maturity = "production"
query_schema_validation = false
updated_date = "2020/10/19"

[rule]
author = ["Elastic"]
description = "Identifies use of WMIC to discover certain System Security Settings such as AntiVirus or Host Firewall details."
from = "now-9m"
index = ["logs-endpoint.events.*", "winlogbeat-*"]
language = "eql"
license = "Elastic License"
name = "Security Software Discovery using WMIC"
risk_score = 21
rule_id = "6ea55c81-e2ba-42f2-a134-bccf857ba922"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Discovery"]
type = "eql"

query = '''
process where event.type in ("start", "process_started") and
   (process.name : "wmic.exe" or process.pe.original_file_name : "wmic.exe") and
    process.args : "/namespace:\\\\root\\SecurityCenter2" and process.args : "Get"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1518"
name = "Software Discovery"
reference = "https://attack.mitre.org/techniques/T1518/"


[rule.threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"

