[metadata]
creation_date = "2023/09/21"
maturity = "production"
min_stack_comments = "Multiple field support in the New Terms rule type was added in Elastic 8.6"
min_stack_version = "8.6.0"
updated_date = "2023/09/21"

[rule]
author = ["Elastic"]
description = """
This rule leverages alert data from the building block rule "System Time Discovery" to alert on signals with unusual
unique host.id, user.id and process.command_line entries. The original underlying rule identifies the usage of commonly
used system time discovery techniques, which attackers may use during the reconnaissance phase after compromising a
system. 
"""
from = "now-9m"
index = [".alerts-security.*"]
language = "kuery"
license = "Elastic License v2"
name = "Unusual Signal Alert - System Time Discovery"
risk_score = 21
rule_id = "894b6996-31ba-44b7-8d70-a6c3b4d1723c"
severity = "low"
tags = ["Domain: Endpoint",
        "OS: Windows",
        "Use Case: Threat Detection",
        "Tactic: Discovery"
        ]
timestamp_override = "event.ingested"
type = "new_terms"
query = '''
host.os.type:windows and event.kind:signal and kibana.alert.rule.rule_id:"06568a02-af29-4f20-929c-f3af281e41aa"
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1124"
name = "System Time Discovery"
reference = "https://attack.mitre.org/techniques/T1124/"

[rule.threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"

[rule.new_terms]
field = "new_terms_fields"
value = ["host.id", "user.id", "process.command_line"]

[[rule.new_terms.history_window_start]]
field = "history_window_start"
value = "now-14d"
