[metadata]
creation_date = "2023/09/21"
maturity = "production"
min_stack_comments = "Multiple field support in the New Terms rule type was added in Elastic 8.6"
min_stack_version = "8.6.0"
updated_date = "2023/09/21"

[rule]
author = ["Elastic"]
description = """
This rule leverages alert data from the building block rule "Windows Network Enumeration" to alert on signals with 
unusual unique host.id, user.id and process.command_line entries. The original underlying rule identifies attempts to
enumerate hosts in a network using the built-in Windows net.exe tool.
"""
from = "now-9m"
index = [".alerts-security.*"]
language = "kuery"
license = "Elastic License v2"
name = "Unusual Signal Alert - Windows Network Enumeration"
risk_score = 21
rule_id = "7b3d3a1a-8865-422b-900d-ee5e725f8c30"
severity = "low"
tags = ["Domain: Endpoint",
        "OS: Windows",
        "Use Case: Threat Detection",
        "Tactic: Discovery",
        "Rule Type: Higher-Order Rule"
        ]
timestamp_override = "event.ingested"
type = "new_terms"
query = '''
host.os.type:windows and event.kind:signal and kibana.alert.rule.rule_id:"7b8bfc26-81d2-435e-965c-d722ee397ef1"
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1018"
name = "Remote System Discovery"
reference = "https://attack.mitre.org/techniques/T1018/"

[[rule.threat.technique]]
id = "T1135"
name = "Network Share Discovery"
reference = "https://attack.mitre.org/techniques/T1135/"

[rule.threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"

[rule.new_terms]
field = "new_terms_fields"
value = ["host.id", "user.id", "process.command_line"]

[[rule.new_terms.history_window_start]]
field = "history_window_start"
value = "now-14d"
