[metadata]
creation_date = "2020/09/02"
ecs_version = ["1.6.0"]
maturity = "development"
query_schema_validation = false
updated_date = "2020/09/02"

[rule]
author = ["Elastic"]
description = """
Identifies .url shortcut files downloaded from outside the local network. These shortcut files are commonly used in
phishing campaigns.
"""
from = "now-9m"
index = ["logs-endpoint.events.*", "winlogbeat-*"]
language = "eql"
license = "Elastic License"
name = "Downloaded URL Files"
risk_score = 21
rule_id = "cd82e3d6-1346-4afd-8f22-38388bbf34cb"
severity = "medium"
tags = ["Elastic", "Windows"]
type = "eql"

query = '''
/* leaving in development pending `file.Ext.windows.zone_identifier` landing in ECS then endpoint */

sequence by process.entity_id with maxspan=2s
  [file where event.type == "creation" and file.extension == "url" and
     not process.name == "explorer.exe"]
  [file where event.type == "creation" and file.extension == "url:Zone.Identifier" and
      /* non-ECS field - may disqualify conversion */
     file.Ext.windows.zone_identifier > 1 and not process.name == "explorer.exe"]
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1193"
name = "Spearphishing Attachment"
reference = "https://attack.mitre.org/techniques/T1193/"

[[rule.threat.technique]]
id = "T1192"
name = "Spearphishing Link"
reference = "https://attack.mitre.org/techniques/T1192/"

[[rule.threat.technique]]
id = "T1204"
name = "User Execution"
reference = "https://attack.mitre.org/techniques/T1204/"

[[rule.threat.technique]]
id = "T1064"
name = "Scripting"
reference = "https://attack.mitre.org/techniques/T1064/"


[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"

