[metadata]
creation_date = "2020/02/18"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/10/22"

[rule]
author = ["Elastic"]
description = """
Identifies unusual instances of rundll32.exe making outbound network connections. This may indicate adversarial activity
and may identify malicious DLLs.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Unusual Network Connection via RunDLL32"
risk_score = 21
rule_id = "52aaab7b-b51c-441a-89ce-4387b3aea886"
severity = "low"
tags = ["Elastic", "Windows"]
timeline_id = "76e52245-7519-4251-91ab-262fb1a1728c"
type = "query"

query = '''
event.category:network and event.type:connection and
  process.name:rundll32.exe and
  not destination.ip:(10.0.0.0/8 or 172.16.0.0/12 or 192.168.0.0/16 or 127.0.0.0/8)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1085"
name = "Rundll32"
reference = "https://attack.mitre.org/techniques/T1085/"


[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"

