[metadata]
creation_date = "2020/07/16"
ecs_version = ["1.5.0"]
maturity = "production"
updated_date = "2020/07/16"

[rule]
author = ["Elastic"]
description = """
An unexpected file was modified by dns.exe, which is responsible for DNS Server services. This could indicate that the
service has been maliciously modified or controlled.
"""
index = ["winlogbeat-*"]
language = "kuery"
license = "Elastic License"
name = "Unusual File Modification by dns.exe"
references = [
    "https://research.checkpoint.com/2020/resolving-your-way-into-domain-admin-exploiting-a-17-year-old-bug-in-windows-dns-servers/",
    "https://msrc-blog.microsoft.com/2020/07/14/july-2020-security-update-cve-2020-1350-vulnerability-in-windows-domain-name-system-dns-server/",
]
risk_score = 73
rule_id = "c7ce36c0-32ff-4f9a-bfc2-dcb242bf99f9"
severity = "high"
tags = ["CVE-2020-1350", "Elastic", "Windows"]
type = "query"

query = '''
event.category:file and process.name:dns.exe and
  not file.name:dns.log
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1133"
name = "External Remote Services"
reference = "https://attack.mitre.org/techniques/T1133/"


[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
