[metadata]
creation_date = "2020/02/18"
ecs_version = ["1.5.0"]
maturity = "production"
updated_date = "2020/08/03"

[rule]
author = ["Elastic"]
description = """
Identifies the native Windows tools regsvr32.exe, regsvr64.exe, or RegAsm.exe making a network connection. This may be indicative of
an attacker bypassing allowlists or running arbitrary scripts via a signed Microsoft binary.
"""
false_positives = [
    """
    Security testing may produce events like this. Activity of this kind performed by non-engineers and ordinary users
    is unusual.
    """,
]
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Network Connection via Regsvr"
risk_score = 21
rule_id = "fb02b8d3-71ee-4af1-bacd-215d23f17efa"
severity = "low"
tags = ["Elastic", "Windows"]
type = "query"

query = '''
event.category:network and event.type:connection and
  process.name:(regsvr32.exe or regsvr64.exe or RegAsm.exe) and
  not destination.ip:(10.0.0.0/8 or 169.254.169.254 or 172.16.0.0/12 or 192.168.0.0/16)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1117"
name = "Regsvr32"
reference = "https://attack.mitre.org/techniques/T1117/"


[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1117"
name = "Regsvr32"
reference = "https://attack.mitre.org/techniques/T1117/"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"
