[metadata]
creation_date = "2023/01/17"
integration = ["windows"]
maturity = "production"
updated_date = "2023/01/17"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"

[rule]
author = ["Elastic"]
description = """
Detects known PowerShell offensive tooling author's name in PowerShell scripts. Attackers commonly use out-of-the-box
offensive tools without modifying the code. This rule aim is to take advantage of that.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-windows.*", "logs-system.*"]
language = "kuery"
license = "Elastic License v2"
name = "Potential PowerShell HackTool Script by Author"
note = """## Setup

The 'PowerShell Script Block Logging' logging policy must be enabled.
Steps to implement the logging policy with with Advanced Audit Configuration:

```
Computer Configuration >
Administrative Templates >
Windows PowerShell >
Turn on PowerShell Script Block Logging (Enable)
```

Steps to implement the logging policy via registry:

```
reg add "hklm\\SOFTWARE\\Policies\\Microsoft\\Windows\\PowerShell\\ScriptBlockLogging" /v EnableScriptBlockLogging /t REG_DWORD /d 1
```
"""
references = [
    "https://github.com/atc-project/atc-data/blob/master/docs/Logging_Policies/LP_0109_windows_powershell_script_block_log.md",
]
risk_score = 47
rule_id = "ad84d445-b1ce-4377-82d9-7c633f28bf9a"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Execution", "PowerShell"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.category:process and
  powershell.file.script_block_text : (
    "JosephBialek" or "mattifestation" or
    "obscuresec" or "harmj0y" or
    "oddvarmoe" or "sixdub" or
    "darkoperator" or "funoverip" or
    "rvrsh3ll" or "ukstufus" or
    "kevin_robertson" or "dafthack" or
    "joff_thyer" or "r4wd3r" or
    "danielhbohannon" or "OneLogicalMyth" or
    "cobbr_io" or "xorrior" or
    "PetrMedonos" or "citronneur" or
    "eladshamir" or "_RastaMouse" or
    "enigma0x3" or "mvelazco" or
    "xP3nt4" or "FuzzySec" or
    "424f424f" or "jaredhaight" or
    "jamcut" or "fullmetalcache" or
    "Hubbl3" or "curi0usJack" or
    "Cx01N" or "itm4n"
    "nurfed1"
  )
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[rule.threat.technique.subtechnique]]
id = "T1059.001"
name = "PowerShell"
reference = "https://attack.mitre.org/techniques/T1059/001/"



[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"

