[metadata]
creation_date = "2020/02/18"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/10/26"

[rule]
author = ["Elastic"]
description = """
Identifies mshta.exe making a network connection. This may indicate adversarial activity as mshta.exe is often leveraged
by adversaries to execute malicious scripts and evade detection.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Network Connection via Mshta"
references = ["https://www.fireeye.com/blog/threat-research/2017/05/cyber-espionage-apt32.html"]
risk_score = 47
rule_id = "a4ec1382-4557-452b-89ba-e413b22ed4b8"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Execution"]
type = "query"

query = '''
event.category:network and event.type:connection and process.name:mshta.exe
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1170"
name = "Mshta"
reference = "https://attack.mitre.org/techniques/T1170/"


[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"

