[metadata]
creation_date = "2020/08/21"
ecs_version = ["1.5.0"]
maturity = "production"
updated_date = "2020/08/21"

[rule]
author = ["Elastic"]
description = """
Identifies Suspicious dotNet Code execution. Verify process details such as commandline, parent process and network
connections.
"""
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Suspicious dotNet code execution"
risk_score = 47
rule_id = "5968ab3b-5c7b-4808-915e-fbbdf7d2ca2b"
severity = "medium"
tags = ["Elastic", "Windows"]
type = "query"

query = '''
event.category:process and not event.type:end and
  process.name:(csc.exe or vbc.exe) and
  process.parent.name:(wscript.exe.log or mshta.exe.log or wscript.exe.log or wmic.exe.log or svchost.exe.log or rundll32.exe.log or cmstp.exe or regsvr32.exe)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1093"
name = "Process Injection"
reference = "https://attack.mitre.org/techniques/T1055/"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

