[metadata]
creation_date = "2020/02/18"
maturity = "production"
updated_date = "2022/02/04"

[rule]
author = ["Elastic"]
description = """
Identifies use of vssadmin.exe for shadow copy deletion or resizing on endpoints. This commonly occurs in tandem with
ransomware or other destructive attacks.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Volume Shadow Copy Deleted or Resized via VssAdmin"
note = """## Triage and analysis.

### Investigating Volume Shadow Copy Deletion via WMIC

The Volume Shadow Copy Service (VSS) is a Windows feature that enables system administrators to take snapshots of volumes
that can be later restored or mounted to recover specific files or folders.

A typical step in the playbooks of attackers that have the goal of deploying Ransomware is to delete Volume Shadow
Copies to ensure that victims have no alternative instead of paying the ransom, making any action that deletes shadow
copies worth monitoring.

This rule monitors the execution of Vssadmin.exe to either delete or resize shadow copies.

#### Possible investigation steps:

- Investigate program execution chain (parent process tree).
- Check whether the account is authorized to perform this operation.
- Confirm whether the account owner is aware of the operation.
- In the case of a resize operation, check if the resize value is equal to suspicious values like 401MB.
- Investigate other alerts related to the user/host in the last 48 hours.
- If unsigned files are found on the process tree:
  - Capture a copy of the file.
  - Use a sandboxed malware analysis system to perform analysis.
    - Observe attempts of contacting external domains and addresses.
  - Use the PowerShell Get-FileHash cmdlet to get the SHA-256 hash value of the file.
    - Search for the existence of this file in resources like VirusTotal, Hybrid-Analysis, CISCO Talos, Any.run, etc.
- Use process name, command line, and file hash to search for occurrences in other hosts.
- Check if any files on the host machine have been encrypted.


### False Positive Analysis

- This rule has chances of producing B-TPs (Benign True Positives). If this activity is expected and noisy in your
environment, consider working with Exceptions, preferably using a user and command line combination.

### Related Rules

- Volume Shadow Copy Deleted or Resized via VssAdmin - b5ea4bfe-a1b2-421f-9d47-22a75a6f2921
- Volume Shadow Copy Deletion via PowerShell - d99a037b-c8e2-47a5-97b9-170d076827c4

### Response and Remediation

- Initiate the incident response process based on the outcome of the triage.
- Priority should be given due to the advanced stage of this activity on the attack.
- If malware was found, Isolate the involved hosts to prevent the infection of other hosts.
- Disable the involved accounts, or restrict their ability to log on remotely.
- If data was encrypted, deleted, or modified, activate your data recovery plan.
- Reset the password of the involved accounts.
- Perform data recovery locally or restore the backups from replicated copies (Cloud, other servers, etc.).
"""
risk_score = 73
rule_id = "b5ea4bfe-a1b2-421f-9d47-22a75a6f2921"
severity = "high"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Impact"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type in ("start", "process_started")
  and (process.name : "vssadmin.exe" or process.pe.original_file_name == "VSSADMIN.EXE") and
  process.args in ("delete", "resize") and process.args : "shadows*"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
reference = "https://attack.mitre.org/techniques/T1490/"
name = "Inhibit System Recovery"
id = "T1490"


[rule.threat.tactic]
reference = "https://attack.mitre.org/tactics/TA0040/"
name = "Impact"
id = "TA0040"

