[metadata]
creation_date = "2020/02/18"
maturity = "production"
updated_date = "2021/04/14"

[rule]
author = ["Elastic"]
description = """
Identifies a PowerShell process launched by either cscript.exe or wscript.exe. Observing Windows scripting processes
executing a PowerShell script, may be indicative of malicious activity.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Windows Script Executing PowerShell"
risk_score = 21
rule_id = "f545ff26-3c94-4fd0-bd33-3c7f95a3a0fc"
severity = "low"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Initial Access"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type in ("start", "process_started") and
  process.parent.name : ("cscript.exe", "wscript.exe") and process.name : "powershell.exe"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1566"
reference = "https://attack.mitre.org/techniques/T1566/"
name = "Phishing"
[[rule.threat.technique.subtechnique]]
id = "T1566.001"
reference = "https://attack.mitre.org/techniques/T1566/001/"
name = "Spearphishing Attachment"



[rule.threat.tactic]
id = "TA0001"
reference = "https://attack.mitre.org/tactics/TA0001/"
name = "Initial Access"

