[metadata]
creation_date = "2021/03/04"
maturity = "development"
updated_date = "2021/03/04"

[rule]
author = ["Austin Songer"]
description = "desc"
from = "now-9m"
index = ["filebeat"]
language = "kuery"
license = "Elastic License v2"
name = "name"
note = "note"
references = [
    "https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers",
    "https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities",
]
risk_score = 47
rule_id = "483c4daf-b0c6-49e0-adf3-0bfa93231d6b"
severity = "medium"
tags = ["tags"]
type = "query"

query = '''
event.category:process
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1190"
name = "Exploit Public-Facing Application"
reference = "https://attack.mitre.org/techniques/T1190/"


[rule.threat.tactic]
id = "TA0001"
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0001/"

