[metadata]
creation_date = "2023/03/16"
integration = ["endpoint", "windows"]
maturity = "production"
min_stack_comments = "The New Term rule type used in this rule was added in Elastic 8.4"
min_stack_version = "8.4.0"
updated_date = "2023/06/29"

[rule]
author = ["Elastic"]
description = """
Identifies newly seen removable devices by device friendly name using registry modification events. While this activity
is not inherently malicious, analysts can use those events to aid monitoring for data exfiltration over those devices.
"""
from = "now-9m"
index = ["logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "endgame-*"]
language = "kuery"
license = "Elastic License v2"
name = "First Time Seen Removable Device"
risk_score = 21
rule_id = "0859355c-0f08-4b43-8ff5-7d2a4789fc08"
severity = "low"
references = [
"https://winreg-kb.readthedocs.io/en/latest/sources/system-keys/USB-storage.html", 
"https://learn.microsoft.com/en-us/windows-hardware/drivers/usbcon/usb-device-specific-registry-settings"
]
tags = ["Domain: Endpoint", "OS: Windows", "Use Case: Threat Detection", "Tactic: Initial Access", "Tactic: Exfiltration", "Data Source: Elastic Endgame", "Data Source: Elastic Defend"]
timestamp_override = "event.ingested"
type = "new_terms"

query = '''
event.category:"registry" and host.os.type:"windows" and registry.value:"FriendlyName" and registry.path:*USBSTOR*
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1091"
name = "Replication Through Removable Media"
reference = "https://attack.mitre.org/techniques/T1091/"

[rule.threat.tactic]
id = "TA0001"
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0001/"


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1052"
name = "Exfiltration Over Physical Medium"
reference = "https://attack.mitre.org/techniques/T1052/"

  [[rule.threat.technique.subtechnique]]
  id = "T1052.001"
  name = "Exfiltration over USB"
  reference = "https://attack.mitre.org/techniques/T1052/001/"


[rule.threat.tactic]
id = "TA0010"
name = "Exfiltration"
reference = "https://attack.mitre.org/tactics/TA0010/"


[rule.new_terms]
field = "new_terms_fields"
value = ["registry.path"]
[[rule.new_terms.history_window_start]]
field = "history_window_start"
value = "now-7d"
