[metadata]
creation_date = "2021/03/04"
maturity = "production"
updated_date = "2021/03/04"

[rule]
author = ["Austin Songer"]
description = """
This rule identifies suspicious files being written by the Microsoft Exchange Server Unified Messaging (UM) service. This
activity has been observed from the CVE-2021-26858 exploit.
"""
from = "now-9m"
index = ["logs-*", "winlogbeat-*"]
language = "eql"
license = "Elastic License v2"
name = "Microsoft Exchange Server UM Writing Suspicius Files"
references = [
    "https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers",
    "https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities",
]
risk_score = 47
rule_id = "6cd1779c-560f-4b68-a8f1-11009b27fe63"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Execution"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
file where event.type in "start" and
  process.parent.name in ("UMWorkerProcess.exe", "umservice.exe") and
  file.extension in ("php", "jsp", "js", "aspx", "asmx", "asax", "cfm", "shtml")
'''
#event.type:start and winlog.channel:Security and winlog.event_id:4663 and process.executable:(UMWorkerProcess.exe or UMService.exe) and
# winlog.event_data.ObjectName:(*.php or *.jsp or *.js or *.aspx or *.asmx or *.asax or *.cfm or *.shtml) and winlog.event_data.AccessMask:(0x100 or 0x10 or 0x4)
# not sure how to reflect "winlog.event_data.AccessMask:(0x100 or 0x10 or 0x4)"


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1190"
name = "Exploit Public-Facing Application"
reference = "https://attack.mitre.org/techniques/T1190/"


[rule.threat.tactic]
id = "TA0001"
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0001/"
