[metadata]
creation_date = "2020/11/02"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/02"

[rule]
author = ["Elastic"]
description = """
Identifies use of net.exe to mount a WebDav or hidden remote share. This may indicate lateral movement or data
exfiltration preparation attempts.
"""
from = "now-9m"
index = ["logs-endpoint.events.*", "winlogbeat-*"]
language = "eql"
license = "Elastic License"
name = "Mounting Hidden or WebDav Remote Shares"
risk_score = 21
rule_id = "c4210e1c-64f2-4f48-b67e-b5a8ffe3aa14"
severity = "medium"
type = "eql"

query = '''
process where event.type in ("start", "process_started") and
 ((process.name == "net.exe" or process.pe.original_file_name == "net.exe") or ((process.name == "net1.exe" or process.pe.original_file_name == "net1.exe") and
 not process.parent.name == "net.exe")) and
 wildcard(process.args,"use") and
 /* including hidden and webdav based online shares such as onedrive  */
 wildcard(process.args, "*\\*$*", "*@SSL\\*", "http*") and
 /* excluding shares deletion operation */
 not wildcard(process.args, "/d*")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1077"
name = "Windows Admin Shares"
reference = "https://attack.mitre.org/techniques/T1077/"


[rule.threat.tactic]
id = "TA0008"
name = "Lateral Movement"
reference = "https://attack.mitre.org/tactics/TA0008/"

