[metadata]
creation_date = "2020/11/03"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/03"

[rule]
author = ["Elastic"]
description = """
Identifies the execution of a file that was created by the virtual System process. This may indicate lateral movement
via network file shares.
"""
from = "now-9m"
index = ["logs-endpoint.events.*", "winlogbeat-*"]
language = "eql"
license = "Elastic License"
name = "Remote Execution via File Shares"
references = ["https://blog.menasec.net/2020/08/new-trick-to-detect-lateral-movement.html"]
risk_score = 47
rule_id = "ab75c24b-2502-43a0-bf7c-e60e662c811e"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Lateral Movement"]"
type = "eql"

query = '''
sequence with maxspan=1m
  [file where event.type in ("creation", "change") and process.pid == 4] by host.id, file.path
  [process where event.type in ("start", "process_started")] by host.id, process.executable
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1077"
name = "Windows Admin Shares"
reference = "https://attack.mitre.org/techniques/T1077/"


[rule.threat.tactic]
id = "TA0008"
name = "Lateral Movement"
reference = "https://attack.mitre.org/tactics/TA0008/"

