[metadata]
creation_date = "2020/11/25"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/25"

[rule]
author = ["Elastic"]
description = """
Identifies registry write modification to enable RDP access. This could be indicative of adversary lateral movement
preparation.
"""
from = "now-9m"
index = ["logs-endpoint.events.*", "winlogbeat-*"]
language = "eql"
license = "Elastic License"
name = "Enable RDP Through Registry"
risk_score = 43
rule_id = "58aa72ca-d968-4f34-b9f7-bea51d75eb50"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Lateral Movement"]
type = "eql"

query = '''
registry where
wildcard(registry.path, "HKLM\\SYSTEM\\ControlSet*\\Control\\Terminal Server\\fDenyTSConnections") and
registry.data.strings == "0" and not (process.name == "svchost.exe" and user.domain == "NT AUTHORITY") and
process.executable != "C:\\Windows\\System32\\SystemPropertiesRemote.exe"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1021"
name = "Remote Services"
reference = "https://attack.mitre.org/techniques/T1021/"


[rule.threat.tactic]
id = "TA0008"
name = "Lateral Movement"
reference = "https://attack.mitre.org/tactics/TA0008/"

