[metadata]
creation_date = "2020/11/16"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/16"

[rule]
author = ["Elastic"]
description = """
Identifies remote execution of Windows services over Remote Procedure Call (RPC). This could be indicative of lateral
movement but will be noisy if commonly done by admins."
"""
from = "now-9m"
index = ["logs-endpoint.events.*", "winlogbeat-*"]
language = "eql"
license = "Elastic License"
name = "Remotely Started Services"
risk_score = 47
rule_id = "aa9a274d-6b53-424d-ac5e-cb8ca4251650"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Lateral Movement", "Execution"]
type = "eql"

query = '''
sequence with maxspan = 1s
   [network where process.name == "services.exe" and
    network.direction == "incoming" and network.transport == "tcp" and network.direction == "incoming" and
	source.port > 49151 and destination.port > 49151 and not source.address in ("127.0.0.1", "::1")
   ] by host.id, process.entity_id

   [process where event.type in ("start", "process_started") and process.parent.name == "services.exe" and
   not (process.name == "svchost.exe" and process.args == "tiledatamodelsvc") and 
   not (process.name == "msiexec.exe" and process.args == "/V")
   /* uncomment if psexec is noisy in your environment */
   /* and process.name != "PSEXESVC.exe" */
   ] by host.id, process.parent.entity_id
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1035"
name = "Service Execution"
reference = "https://attack.mitre.org/techniques/T1035/"


[rule.threat.tactic]
id = "TA0008"
name = "Lateral Movement"
reference = "https://attack.mitre.org/tactics/TA0008/"

