[metadata]
creation_date = "2020/11/18"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/18"

[rule]
author = ["Elastic"]
description = """
Identifies files written or modified in the Startup Folder by commonly abused processes. Adversaries may use this
technique to maintain persistence.
"""
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "eql"
license = "Elastic License"
name = "Shortcut File Written or Modified for Persistence"
risk_score = 41
rule_id = "440e2db4-bc7f-4c96-a068-65b78da59bde"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]
type = "eql"

query = '''
file where event.type != "deletion" and
  user.domain != "NT AUTHORITY" and
  file.path : ("C:\\Users\\*\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\*", 
               "C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp\\*") and
  process.name : ( "cmd.exe",
                   "powershell.exe",
                   "wmic.exe",
                   "mshta.exe",
                   "pwsh.exe",
                   "cscript.exe",
                   "wscript.exe",
                   "regsvr32.exe",
                   "RegAsm.exe",
                   "rundll32.exe",
                   "EQNEDT32.EXE",
                   "WINWORD.EXE",
                   "EXCEL.EXE",
                   "POWERPNT.EXE",
                   "MSPUB.EXE",
                   "MSACCESS.EXE",
                   "iexplore.exe",
                   "InstallUtil.exe")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1060"
name = "Registry Run Keys / Startup Folder"
reference = "https://attack.mitre.org/techniques/T1060/"


[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

