[metadata]
creation_date = "2020/11/18"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/18"

[rule]
author = ["Elastic"]
description = "Identifies script engines creating files in the startup folder, or creation of script files in the startup folder."
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "eql"
license = "Elastic License"
name = "Persistent Scripts in the Startup Directory"
risk_score = 41
rule_id = "f7c4dc5a-a58d-491d-9f14-9b66507121c0"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]
type = "eql"

query = '''
file where event.type != "deletion" and user.domain != "NT AUTHORITY"
  and (
    // detect shortcuts created by wscript.exe or cscript.exe
      file.path : "C:\\*\\Programs\\Startup\\*.lnk" and
      process.name : ("wscript.exe", "cscript.exe")
      ) or
     // detect vbs or js files created by any process
     file.path : ("C:\\*\\Programs\\Startup\\*.vbs", 
                  "C:\\*\\Programs\\Startup\\*.vbe", 
                  "C:\\*\\Programs\\Startup\\*.wsh", 
                  "C:\\*\\Programs\\Startup\\*.wsf", 
                  "C:\\*\\Programs\\Startup\\*.js")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1060"
name = "Registry Run Keys / Startup Folder"
reference = "https://attack.mitre.org/techniques/T1060/"


[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

