[metadata]
creation_date = "2020/11/19"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/19"

[rule]
author = ["Elastic"]
description = """
Identifies execution of suspicious persistent program (Scripts, Rundll32, etc.) by looking at process lineage and
command line usage. In order to survive reboots and other system interrupts, attackers will modify run keys within the
registry or leverage startup folder items as a form of persistence.
"""
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "eql"
license = "Elastic License"
name = "Execution of Persistent Suspicious Program"
risk_score = 43
rule_id = "e7125cea-9fe1-42a5-9a05-b0792cf86f5a"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]
type = "eql"

query = '''
/* userinit followed by explorer followed by early child process of explorer (unlikely to be launched interactively) within 1m */
sequence by host.id, user.name with maxspan = 2m
  [process where event.type in ("start", "process_started") and process.name == "userinit.exe" and process.parent.name == "winlogon.exe"]
  [process where event.type in ("start", "process_started") and process.name == "explorer.exe"]
  [process where event.type in ("start", "process_started") and process.parent.name == "explorer.exe" and
   /* add suspicious programs here */
   process.pe.original_file_name in ("cscript.exe",
                                     "wscript.exe",
                                     "PowerShell.EXE",
                                     "Cmd.Exe",
                                     "MSHTA.EXE",
                                     "RUNDLL32.EXE",
                                     "regsvr32.exe",
                                     "MSBuild.exe",
                                     "InstallUtil.exe") and
    /* add potential suspicious paths here */
    wildcard(process.args, "C:\\Users\\*", "C:\\ProgramData\\*", "C:\\Windows\\Temp\\*", "C:\\Windows\\Temp\\*", "C:\\PerfLogs\\*", "C:\\Intel\\*")
   ]
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1060"
name = "Registry Run Keys / Startup Folder"
reference = "https://attack.mitre.org/techniques/T1060/"


[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

