[metadata]
creation_date = "2020/11/23"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/23"

[rule]
author = ["Elastic"]
description = """
Identifies the creation of a suspicious ImagePath value. This could be an indication of an adversary attempting to
stealthily persist or elevate privileges through abnormal service creation.
"""
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "eql"
license = "Elastic License"
name = "Suspicious Service ImagePath Created"
risk_score = 71
rule_id = "36a8e048-d888-4f61-a8b9-0f9e2e40f317"
severity = "high"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]
type = "eql"

query = '''
registry where wildcard(registry.path, "HKLM\\SYSTEM\\ControlSet*\\Services\\*\\ImagePath") and
 /* add suspicious registry ImagePath values here */
 wildcard(registry.data.strings, "%COMSPEC%*", "*\\.\\pipe\\*")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1543.003"
name = "Windows Service"
reference = "https://attack.mitre.org/techniques/T1543/003/"


[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1543.003"
name = "Create or Modify System Process: Windows Service"
reference = "https://attack.mitre.org/techniques/T1543/003/"


[rule.threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"
