[metadata]
creation_date = "2020/02/18"
maturity = "production"
updated_date = "2021/03/15"

[rule]
author = ["Elastic"]
description = "A scheduled task can be used by an adversary to establish persistence, move laterally, and/or escalate privileges."
false_positives = ["Legitimate scheduled tasks may be created during installation of new software."]
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Scheduled Task Creation via Script Interpreter"
risk_score = 21
rule_id = "afcce5ad-65de-4ed2-8516-5e093d3ac99a"
severity = "low"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Persistence"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type == "start" and
  (process.name : "schtasks.exe" or process.pe.original_file_name : "schtasks.exe") and
  process.parent.name : ("cmd.exe", "wscript.exe", "rundll32.exe", "regsvr32.exe",
                         "wmic.exe", "mshta.exe","powershell.exe", "pwsh.exe") and
  process.args : "/create" and
  process.args : ("*/RU*", "*/SC*", "*/TN*", "*/TR*", "*/F*") and
  /* exclude SYSTEM SID - look for task creations by non-SYSTEM user */
  not user.id : "S-1-5-18"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1053"
name = "Scheduled Task/Job"
reference = "https://attack.mitre.org/techniques/T1053/"


[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

