id = "0012dc30-1e01-11ed-83df-bb9ef390e8d1"
created_at = "2022-12-12T07:48:36.785Z"
created_by = "prashanth.pulisetti@gmail.com"
name = "Possible Sharphound Tool Patterns (via cmdline)"
tags = [ "Windows", "Alert", ]
interval = "5m"
enabled = true
description = "SharpHound is the official data collector for BloodHound, written in C# and uses Windows API functions and LDAP namespace functions to collect data from domain controllers and domain-joined Windows systems."
risk_score = 73
severity = "high"
license = "https://github.com/Neo23x0/sigma/blob/master/LICENSE.Detection.Rules.md"
author = [ "Sai Prashanth Pulisetti" ]
false_positives = [ ]
from = "now-360s"
rule_id = "50564f8d-9a69-477f-be24-0a81116dbcff"
max_signals = 100
risk_score_mapping = [ ]
severity_mapping = [ ]
to = "now"
version = 8
immutable = false
related_integrations = [ ]
required_fields = [ ]
setup = ""
type = "query"
language = "kuery"
index = [ "*:winlogbeat-*" ]
query = """
process.command_line.text:("CollectionMethod" OR "Loopduration" OR "LoopInterval" OR "LDAPFilter" OR "SearchBase" OR "RealDNSName" OR "OutputPrefix" OR "PortScanTimeout" OR "CacheFileName")
"""
filters = [ ]
throttle = "no_actions"
actions = [ ]

[meta]
from = "1m"

[[threat]]
framework = "MITRE ATT&CK"

  [threat.tactic]
  id = "TA0007"
  reference = "https://attack.mitre.org/tactics/TA0007"
  name = "Discovery"

  [[threat.technique]]
  id = "T1615"
  reference = "https://attack.mitre.org/techniques/T1615"
  name = "Group Policy Discovery"
  subtechnique = [ ]

