[metadata]
creation_date = "2020/11/23"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/23"

[rule]
author = ["Elastic"]
description = """
Identifies privileges escalation attempt via Named Pipe Impersonation. This is a known technique implemented in several
pentesting frameworks such as Meterpreter getsystem command.
"""
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "eql"
license = "Elastic License"
name = "Privilege Escalation via Named Pipe Impersonation"
references = ["https://www.ired.team/offensive-security/privilege-escalation/windows-namedpipes-privilege-escalation"]
risk_score = 71
rule_id = "3ecbdc9e-e4f2-43fa-8cca-63802125e582"
severity = "high"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]
type = "eql"

query = '''
process where event.type in ("start", "process_started") and
process.pe.original_file_name in ("Cmd.Exe", "PowerShell.EXE") and process.args:"echo" and process.args:">" and wildcard(process.args, "\\\\.\\pipe\\*")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1134"
name = "Access Token Manipulation"
reference = "https://attack.mitre.org/techniques/T1134/"


[rule.threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"

