[metadata]
creation_date = "2020/03/17"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/02"

[rule]
author = ["Elastic"]
description = """
Identifies User Account Control (UAC) bypass via eventvwr.exe. Attackers bypass UAC to stealthily execute code with
elevated permissions.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License"
name = "Bypass UAC via Event Viewer"
risk_score = 21
rule_id = "31b4c719-f2b4-41f6-a9bd-fce93c2eaf62"
severity = "low"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]
timeline_id = "76e52245-7519-4251-91ab-262fb1a1728c"
timeline_title = "Generic Process Timeline"
type = "query"

query = '''
event.category:process and event.type:(start or process_started) and
  process.parent.name:eventvwr.exe and
  not process.executable:("C:\Windows\SysWOW64\mmc.exe" or "C:\Windows\System32\mmc.exe")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1088"
name = "Bypass User Account Control"
reference = "https://attack.mitre.org/techniques/T1088/"


[rule.threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"

