[metadata]
creation_date = "2020/11/26"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/26"

[rule]
author = ["Elastic"]
description = """
Detects attempts to exploit privilege escalation vulnerabilities related to the Print Spooler service via chaining
multiples primitives to load an arbitrary DLL on the Spoolsv.exe process running as System. For more information refer
to the following CVE-2020-1030 and verify that the impacted system is patched.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "eql"
license = "Elastic License"
name = "Suspicious PrintSpooler Point and Print DLL"
references = [
    "https://www.accenture.com/us-en/blogs/cyber-defense/discovering-exploiting-shutting-down-dangerous-windows-print-spooler-vulnerability",
]
risk_score = 74
rule_id = "bd7eefee-f671-494e-98df-f01daf9e5f17"
severity = "high"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]
type = "eql"

query = '''
registry where
wildcard(registry.path, "HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Print\\Printers\\*\\CopyFiles\\Payload\\Module") and
wildcard(registry.data.strings, "C:\\Windows\\System32\\spool\\drivers\\x64\\4\\*")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1068"
name = "Exploitation for Privilege Escalation"
reference = "https://attack.mitre.org/techniques/T1068/"


[rule.threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"

