[metadata]
creation_date = "2021/01/21"
maturity = "production"
updated_date = "2021/01/21"

[rule]
author = ["Elastic"]
description = """
A port monitor can be configured to load a DLL at startup. An arbitrary DLL can be added to the Monitors registry path
and executed as SYSTEM for privilege escalation or persistence, if permissions allow writing a fully-qualified pathname
for that DLL.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "eql"
license = "Elastic License"
name = "Port Monitor Registration"
risk_score = 47
rule_id = "8f3e91c7-d791-4704-80a1-42c160d7aa27"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]
type = "eql"

query = '''
registry where event.type in ("creation", "change") and
  registry.path:"HKLM\\SYSTEM\\*ControlSet*\\Control\\Print\\Monitors\\*" and
  registry.data.strings:"*.dll" and not
  /* exclude SYSTEM SID - look for changes by non-SYSTEM user */
  user.id:"S-1-5-18"
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1547"
name = "Boot or Logon Autostart Execution"
reference = "https://attack.mitre.org/techniques/T1547/"
[[rule.threat.technique.subtechnique]]
id = "T1547.010"
name = "Port Monitors"
reference = "https://attack.mitre.org/techniques/T1547/010/"



[rule.threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1547"
name = "Boot or Logon Autostart Execution"
reference = "https://attack.mitre.org/techniques/T1547/"
[[rule.threat.technique.subtechnique]]
id = "T1547.010"
name = "Port Monitors"
reference = "https://attack.mitre.org/techniques/T1547/010/"



[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

