[metadata]
creation_date = "2020/08/18"
maturity = "production"
updated_date = "2020/10/27"

[rule]
author = ["Elastic"]
description = """
Identifies User Account Control (UAC) bypass via hijacking DiskCleanup Scheduled Task. Attackers bypass UAC to
stealthily execute code with elevated permissions.
"""
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*"]
language = "eql"
license = "Elastic License"
name = "UAC Bypass via DiskCleanup Scheduled Task Hijack"
risk_score = 47
rule_id = "1dcc51f6-ba26-49e7-9ef4-2655abb2361e"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]
timeline_id = "76e52245-7519-4251-91ab-262fb1a1728c"
type = "eql"

query = '''
process where event.type in ("start", "process_started") and
process.args:"/autoclean" and process.args:"/d" and
not process.executable : ("C:\\Windows\\System32\\cleanmgr.exe", "C:\\Windows\\SysWOW64\\cleanmgr.exe")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1088"
name = "Bypass User Account Control"
reference = "https://attack.mitre.org/techniques/T1088/"


[rule.threat.tactic]
id = "TA0004"
name = "Privilege Escalation"
reference = "https://attack.mitre.org/tactics/TA0004/"

