[metadata]
creation_date = "2021/07/06"
maturity = "production"
updated_date = "2022/02/14"

[rule]
author = ["Elastic"]
description = """
Detects unusual Print Spooler service (spoolsv.exe) child processes. This may indicate an attempt to exploit privilege
escalation vulnerabilities related to the Printing Service on Windows.
"""
false_positives = [
    """
    Install or update of a legitimate printing driver. Verify the printer driver file metadata such as manufacturer and signature
    information.
    """,
]
from = "now-9m"
index = ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*"]
language = "eql"
license = "Elastic License v2"
name = "Unusual Print Spooler Child Process"
references = [
    "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34527",
    "https://github.com/afwu/PrintNightmare",
]
risk_score = 47
rule_id = "ee5300a7-7e31-4a72-a258-250abb8b3aa1"
severity = "medium"
tags = ["Elastic", "Host", "Windows", "Threat Detection", "Privilege Escalation"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type == "start" and
 process.parent.name : "spoolsv.exe" and
 (process.Ext.token.integrity_level_name : "System" or
 winlog.event_data.IntegrityLevel : "System") and

 /* exclusions for FP control below */
 not process.name : ("splwow64.exe", "PDFCreator.exe", "acrodist.exe", "spoolsv.exe", "msiexec.exe", "route.exe", "WerFault.exe") and
 not process.command_line : "*\\WINDOWS\\system32\\spool\\DRIVERS*" and
 not (process.name : "net.exe" and process.command_line : ("*stop*", "*start*")) and
 not (process.name : ("cmd.exe", "powershell.exe") and process.command_line : ("*.spl*", "*\\program files*", "*route add*")) and
 not (process.name : "netsh.exe" and process.command_line : ("*add portopening*", "*rule name*")) and
 not (process.name : "regsvr32.exe" and process.command_line : "*PrintConfig.dll*")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
reference = "https://attack.mitre.org/techniques/T1068/"
name = "Exploitation for Privilege Escalation"
id = "T1068"


[rule.threat.tactic]
reference = "https://attack.mitre.org/tactics/TA0004/"
name = "Privilege Escalation"
id = "TA0004"
