[metadata]
creation_date = "2020/11/30"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/30"

[rule]
author = ["Elastic"]
description = """
Identifies attempts to brute force an O365 user account. An adversary may attempt a brute force attack to obtain
unauthorized access to user accounts.
"""
false_positives = [
    """
    Automated processes that attempt to authenticate using expired credentials and unbounded retries may lead to false
    positives.
    """,
]
from = "now-30m"
index = ["filebeat-*"]
language = "kuery"
license = "Elastic License"
name = "Attempts to Brute Force an O365 User Account"
note = "The O365 Fleet integration or Filebeat module must be enabled to use this rule."
risk_score = 73
rule_id = "26f68dba-ce29-497b-8e13-b4fde1db5a2d"
severity = "high"
tags = ["Elastic", "Cloud", "Office 365", "Continuous Monitoring", "SecOps", "Identity and Access"]
type = "threshold"

query = '''
event.dataset:o365.audit and event.provider:AzureActiveDirectory and event.category:authentication and event.action:UserLoginFailed and event.outcome:failure
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1110"
name = "Brute Force"
reference = "https://attack.mitre.org/techniques/T1110/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

[rule.threshold]
field = "user.id"
value = 10

