[metadata]
creation_date = "2020/02/18"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/10/27"

[rule]
author = ["Elastic"]
description = """
Endpoint Security prevented Credential Dumping. Click the Endpoint Security icon in the event.module column or the link
in the rule.reference column for additional information.
"""
from = "now-15m"
index = ["endgame-*"]
interval = "10m"
language = "kuery"
license = "Elastic License"
name = "Credential Dumping - Prevented - Endpoint Security"
risk_score = 47
rule_id = "db8c33a8-03cd-4988-9e2c-d0a4863adb13"
severity = "medium"
tags = ["Elastic", "Endpoint Security"]
timeline_id = "db366523-f1c6-4c1f-8731-6ce5ed9e5717"
type = "query"

query = '''
event.kind:alert and event.module:endgame and endgame.metadata.type:prevention and (event.action:cred_theft_event or endgame.event_subtype_full:cred_theft_event)
'''

