[metadata]
creation_date = "2020/02/18"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/10/26"

[rule]
author = ["Elastic"]
description = """
This is an example of how to detect an unwanted web client user agent. This search matches the user agent for sqlmap
1.3.11, which is a popular FOSS tool for testing web applications for SQL injection vulnerabilities.
"""
false_positives = [
    """
    This rule does not indicate that a SQL injection attack occurred, only that the `sqlmap` tool was used. Security
    scans and tests may result in these errors. If the source is not an authorized security tester, this is generally
    suspicious or malicious activity.
    """,
]
index = ["apm-*-transaction*"]
language = "kuery"
license = "Elastic License"
name = "Web Application Suspicious Activity: sqlmap User Agent"
references = ["http://sqlmap.org/"]
risk_score = 47
rule_id = "d49cc73f-7a16-4def-89ce-9fc7127d7820"
severity = "medium"
tags = ["Elastic", "APM"]
type = "query"

query = '''
user_agent.original:"sqlmap/1.3.11#stable (http://sqlmap.org)"
'''

