[metadata]
creation_date = "2020/02/18"
deprecation_date = "2022/07/25"
maturity = "deprecated"
updated_date = "2022/07/25"

[rule]
author = ["Elastic"]
description = "Identifies processes running in a temporary folder. This is sometimes done by adversaries to hide malware."
false_positives = [
    """
    Build systems, like Jenkins, may start processes in the `/tmp` directory. These can be exempted by name or by
    username.
    """,
]
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License v2"
name = "Unusual Process Execution - Temp"
risk_score = 47
rule_id = "df959768-b0c9-4d45-988c-5606a2be8e5a"
severity = "medium"
tags = ["Elastic", "Host", "Linux", "Threat Detection", "Execution"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.category:process and event.type:(start or process_started) and process.working_directory:/tmp and
  not process.parent.name:(update-motd-updates-available or
                           apt or apt-* or
                           cnf-update-db or
                           appstreamcli or
                           unattended-upgrade or
                           packagekitd) and
  not process.args:(/usr/lib/update-notifier/update-motd-updates-available or
                    /var/lib/command-not-found/)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"

