[metadata]
creation_date = "2022/03/15"
deprecation_date = "2022/05/09"
maturity = "deprecated"
updated_date = "2022/05/09"

[rule]
author = ["Elastic"]
description = """
Identifies Linux binary busybox abuse to break out from restricted environments by spawning an interactive system
shell.The busybox is software utility suite that provides several Unix utilities in a single executable file and the
activity of spawing a shell is not a standard use of this binary by a user or system administrator. It indicates a
potentially malicious actor attempting to improve the capabilities or stability of their access.
"""
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "eql"
license = "Elastic License v2"
name = "Linux Restricted Shell Breakout via busybox Shell Evasion"
references = ["https://gtfobins.github.io/gtfobins/busybox/"]
risk_score = 47
rule_id = "e9b4a3c7-24fc-49fd-a00f-9c938031eef1"
severity = "medium"
tags = ["Elastic", "Host", "Linux", "Threat Detection", "Execution", "GTFOBins"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where event.type == "start" and process.name == "busybox" and process.args_count == 2 and process.args in ("/bin/sh", "/bin/ash", "sh", "ash")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[rule.threat.technique.subtechnique]]
id = "T1059.004"
name = "Unix Shell"
reference = "https://attack.mitre.org/techniques/T1059/004/"



[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"

