[metadata]
creation_date = "2022/02/24"
maturity = "development"
updated_date = "2022/02/24"

[rule]
author = ["Elastic"]
description = """
Identifies Unix binary apt/apt-get abuse to breakout out of restricted shells or environments by spawning an
interactive system shell.
"""
from = "now-5m"
index = ["logs-*"]
language = "eql"
license = "Elastic License v2"
name = "GTFOBins IOC - apt /apt-get Changelog Escape"
references = [
    "https://gtfobins.github.io/gtfobins/apt/",
    "https://gtfobins.github.io/gtfobins/apt-get/"
]
risk_score = 47
rule_id = "8fed8450-847e-43bd-874c-3bbf0cd425f3"
severity = "medium"
tags = ["Elastic","Host","Linux","Threat Detection","GTFOBins"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
sequence by process.pid with maxspan=1m
[process where process.name : ("apt", "apt-get") and process.args : "changelog"]
[process where process.parent.name : ("apt", "apt-get") and process.name : "sensible-pager" and process.args : "/bin/sh"]
'''

