[metadata]
creation_date = "2023/06/14"
integration = ["endpoint"]
maturity = "production"
min_stack_comments = "Multiple field support in the New Terms rule type was added in Elastic 8.6"
min_stack_version = "8.6.0"
updated_date = "2023/07/31"

[transform]
[[transform.osquery]]
label = "Osquery - Retrieve Listening Ports"
query = "SELECT pid, address, port, socket, protocol, path FROM listening_ports"

[[transform.osquery]]
label = "Osquery - Retrieve Open Sockets"
query = "SELECT pid, family, remote_address, remote_port, socket, state FROM process_open_sockets"

[[transform.osquery]]
label = "Osquery - Retrieve Information for a Specific User"
query = "SELECT * FROM users WHERE username = {{user.name}}"

[[transform.osquery]]
label = "Osquery - Investigate the Account Authentication Status"
query = "SELECT * FROM logged_in_users WHERE user = {{user.name}}"

[[transform.osquery]]
label = "Osquery - Retrieve Running Processes by User"
query = "SELECT pid, username, name FROM processes p JOIN users u ON u.uid = p.uid ORDER BY username"

[[transform.osquery]]
label = "Osquery - Retrieve Process Info"
query = "SELECT name, cmdline, parent, path, uid FROM processes"

[rule]
author = ["Elastic"]
description = """
This rule monitors for network connectivity to the internet from a previously unknown executable located in a suspicious
directory to a previously unknown destination ip. An alert from this rule can indicate the presence of potentially
malicious activity, such as the execution of unauthorized or suspicious processes attempting to establish connections to
unknown or suspicious destinations such as a command and control server. Detecting and investigating such behavior can
help identify and mitigate potential security threats, protecting the system and its data from potential compromise.
"""
from = "now-59m"
index = ["auditbeat-*", "filebeat-*", "packetbeat-*", "logs-endpoint.events.*", "endgame-*"]
language = "kuery"
license = "Elastic License v2"
name = "Suspicious Network Activity to the Internet by Previously Unknown Executable"
note = """## Triage and analysis

### Investigating Suspicious Network Activity to the Internet by Previously Unknown Executable

Malware will often, after being installed, call out to its command and control server to receive further instructions by its operators.

This rule leverages the new_terms rule type to detect previously unknown processes, initiating network connections to external IP-addresses. 

> **Note**:
> This investigation guide uses the [Osquery Markdown Plugin](https://www.elastic.co/guide/en/security/master/invest-guide-run-osquery.html) introduced in Elastic Stack version 8.5.0. Older Elastic Stack versions will display unrendered Markdown in this guide.
> This investigation guide uses [placeholder fields](https://www.elastic.co/guide/en/security/current/osquery-placeholder-fields.html) to dynamically pass alert data into Osquery queries. Placeholder fields were introduced in Elastic Stack version 8.7.0. If you're using Elastic Stack version 8.6.0 or earlier, you'll need to manually adjust this investigation guide's queries to ensure they properly run.

#### Possible investigation steps

- Identify any signs of suspicious network activity or anomalies that may indicate malicious behavior. This could include unexpected traffic patterns or unusual network behavior.
  - Investigate listening ports and open sockets to look for potential malicious processes, reverse shells or data exfiltration.
    - $osquery_0
    - $osquery_1
- Identify the user account that performed the action, analyze it, and check whether it should perform this kind of action.
  - $osquery_2
- Investigate whether the user is currently logged in and active.
  - $osquery_3
- Investigate the script execution chain (parent process tree) for unknown processes. Examine their executable files for prevalence and whether they are located in expected locations.
  - $osquery_4
  - $osquery_5
- Investigate other alerts associated with the user/host during the past 48 hours.
  - If scripts or executables were dropped, retrieve the files and determine if they are malicious:
    - Use a private sandboxed malware analysis system to perform analysis.
      - Observe and collect information about the following activities:
        - Attempts to contact external domains and addresses.
          - Check if the domain is newly registered or unexpected.
          - Check the reputation of the domain or IP address.
        - File access, modification, and creation activities.

### Related Rules

- Network Activity Detected via cat - afd04601-12fc-4149-9b78-9c3f8fe45d39

### False Positive Analysis

- If this activity is related to new benign software installation activity, consider adding exceptions — preferably with a combination of user and command line conditions.
- Try to understand the context of the execution by thinking about the user, machine, or business purpose. A small number of endpoints, such as servers with unique software, might appear unusual but satisfy a specific business need.

### Response and remediation

- Initiate the incident response process based on the outcome of the triage.
- Isolate the involved host to prevent further post-compromise behavior.
- If the triage identified malware, search the environment for additional compromised hosts.
  - Implement temporary network rules, procedures, and segmentation to contain the malware.
  - Stop suspicious processes.
  - Immediately block the identified indicators of compromise (IoCs).
  - Inspect the affected systems for additional malware backdoors like reverse shells, reverse proxies, or droppers that attackers could use to reinfect the system.
- Remove and block malicious artifacts identified during triage.
- Investigate credential exposure on systems compromised or used by the attacker to ensure all compromised accounts are identified. Reset passwords for these accounts and other potentially compromised credentials, such as email, business systems, and web services.
- Run a full antimalware scan. This may reveal additional artifacts left in the system, persistence mechanisms, and malware components.
- Determine the initial vector abused by the attacker and take action to prevent reinfection through the same vector.
- Leverage the incident response data and logging to improve the mean time to detect (MTTD) and the mean time to respond (MTTR).
"""
risk_score = 21
rule_id = "53617418-17b4-4e9c-8a2c-8deb8086ca4b"
severity = "low"
tags = [
        "Domain: Endpoint",
        "OS: Linux",
        "Use Case: Threat Detection",
        "Tactic: Command and Control",
        "Data Source: Elastic Endgame",
        "Data Source: Elastic Defend"
        ]
timestamp_override = "event.ingested"
type = "new_terms"

query = '''
host.os.type:linux and event.category:network and 
event.action:(connection_attempted or ipv4_connection_attempt_event) and 
process.executable : ( 
    (/etc/crontab or 
     /etc/rc.local or 
     /boot/* or 
     /dev/shm/* or 
     /etc/cron.*/* or 
     /etc/init.d/* or 
     /etc/rc*.d/* or 
     /etc/update-motd.d/* or 
     /home/*/.* or 
     /run/* or 
     /srv/* or 
     /tmp/* or 
     /usr/lib/update-notifier/* or 
     /var/tmp/*) and 
     not (/usr/bin/apt or 
          /usr/bin/curl or 
          /usr/bin/dnf or 
          /usr/bin/dockerd or 
          /usr/bin/dpkg or 
          /usr/bin/rpm or 
          /usr/bin/wget or 
          /usr/bin/yum) 
    ) 
and source.ip : ( 
    10.0.0.0/8 or 
    127.0.0.0/8 or 
    172.16.0.0/12 or 
    192.168.0.0/16) and 
    not destination.ip : ( 
        10.0.0.0/8 or 
        100.64.0.0/10 or 
        127.0.0.0/8 or 
        169.254.0.0/16 or 
        172.16.0.0/12 or 
        192.0.0.0/24 or 
        192.0.0.0/29 or 
        192.0.0.10/32 or 
        192.0.0.170/32 or 
        192.0.0.171/32 or 
        192.0.0.8/32 or 
        192.0.0.9/32 or 
        192.0.2.0/24 or 
        192.168.0.0/16 or 
        192.175.48.0/24 or 
        192.31.196.0/24 or 
        192.52.193.0/24 or 
        192.88.99.0/24 or 
        198.18.0.0/15 or 
        198.51.100.0/24 or 
        203.0.113.0/24 or 
        224.0.0.0/4 or 
        240.0.0.0/4 or 
        "::1" or 
        "FE80::/10" or 
        "FF00::/8")
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1071"
name = "Application Layer Protocol"
reference = "https://attack.mitre.org/techniques/T1071/"

[rule.threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"

[rule.new_terms]
field = "new_terms_fields"
value = ["destination.ip", "process.executable"]

[[rule.new_terms.history_window_start]]
field = "history_window_start"
value = "now-7d"
