[metadata]
creation_date = "2023/07/06"
integration = ["auditd_manager"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2023/09/27"

[rule]
author = ["Elastic"]
description = """
An RDP (Remote Desktop Protocol) brute force attack involves an attacker repeatedly attempting various username and 
password combinations to gain unauthorized access to a remote computer via RDP, and if successful, the potential impact
can include unauthorized control over the compromised system, data theft, or the ability to launch further attacks 
within the network, jeopardizing the security and confidentiality of the targeted system and potentially compromising 
the entire network infrastructure. This rule identifies multiple consecutive authentication failures targeting a 
specific user account within a short time interval, followed by a successful authentication.
"""
from = "now-9m"
index = ["auditbeat-*", "logs-auditd_manager.auditd-*"]
language = "eql"
license = "Elastic License v2"
name = "Potential Successful Linux RDP Brute Force Attack Detected"
note = """## Setup
This rule requires the use of the `auditd_manager` integration.
The Auditd Manager Integration receives audit events from the Linux Audit Framework that is a part of the Linux kernel.
Auditd Manager provides a user-friendly interface and automation capabilities for configuring and monitoring system
auditing through the auditd daemon. With `auditd_manager`, administrators can easily define audit rules,
track system events, and generate comprehensive audit reports, improving overall security and compliance in the system.

The following steps should be executed in order to add the
Elastic Agent System integration "auditd_manager" on a Linux System.

- Go to the Kibana home page and click Add integrations.
- In the query bar, search for Auditd Manager and select the integration to see more details about it.
- Click Add Auditd Manager
- Configure the integration name and optionally add a description.
- Review optional and advanced settings accordingly.
- Add the newly installed `auditd manager` to an existing or a new agent policy, and deploy the agent on a Linux system
  from which auditd log files are desirable.
- Click Save and Continue.

Auditd Manager subscribes to the kernel and receives events as they occur without any additional configuration.
However, if more advanced configuration is required to detect specific behavior, audit rules can be added
to the integration in either the "audit rules" configuration box or the "auditd rule files" box by specifying a file
to read the audit rules from.
For more details on the integeration refer - https://docs.elastic.co/integrations/auditd_manager

Rule Specific Setup Note
- For this detection rule no additional audit rules are required to be added to the integration.

"""
risk_score = 47
rule_id = "521fbe5c-a78d-4b6b-a323-f978b0e4c4c0"
severity = "medium"
tags = ["Domain: Endpoint", "OS: Linux", "Use Case: Threat Detection", "Tactic: Credential Access"]
type = "eql"
query = '''
sequence by host.id, related.user with maxspan=5s
  [authentication where host.os.type == "linux" and event.dataset == "auditd_manager.auditd" and 
   event.action == "authenticated" and auditd.data.terminal : "*rdp*" and event.outcome == "failure"] with runs=10
  [authentication where host.os.type == "linux" and event.dataset == "auditd_manager.auditd" and 
   event.action  == "authenticated" and auditd.data.terminal : "*rdp*" and event.outcome == "success"] | tail 1
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1110"
name = "Brute Force"
reference = "https://attack.mitre.org/techniques/T1110/"

[[rule.threat.technique.subtechnique]]
id = "T1110.001"
name = "Password Guessing"
reference = "https://attack.mitre.org/techniques/T1110/001/"

[[rule.threat.technique.subtechnique]]
id = "T1110.003"
name = "Password Spraying"
reference = "https://attack.mitre.org/techniques/T1110/003/"

[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"
