[metadata]
creation_date = "2026/05/28"
integration = ["system"]
maturity = "production"
updated_date = "2026/05/28"

[rule]
author = ["Elastic"]
description = """
Monitors kernel logs for segfault messages from sensitive processes. A segfault, or segmentation fault, is an error
that occurs when a program tries to access a memory location that it's not allowed to access, typically leading to
program termination. A segfault can be an indication of malicious behavior if it results from attempts to exploit
buffer overflows, inject shared objects, or other vulnerabilities in software to execute arbitrary code or disrupt
its normal operation.
"""
from = "now-9m"
index = ["logs-system.syslog-*", "filebeat-*"]
language = "kuery"
license = "Elastic License v2"
name = "Segfault from Sensitive Process Detected"
risk_score = 47
rule_id = "01e244f0-fef9-4102-903f-9788052b2c91"
severity = "medium"
tags = [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Credential Access",
    "Tactic: Execution"
]
timestamp_override = "event.ingested"
type = "query"
query = '''
host.os.type:linux and event.dataset:"system.syslog" and process.name:kernel and message:segfault and
message:(
  "sshd" or "ssh" or "su" or "sudo" or "sudoedit" or "passwd" or "chage" or "chsh" or "chfn" or "newgrp" or "gpasswd" or
  "login" or "agetty" or "getty" or "unix_chkpwd" or "polkitd" or "pkexec" or
  "sssd" or "sssd_pam" or "sssd_nss" or "krb5_child" or "ldap_child" or "nslcd" or "winbindd" or
  "dbus-daemon" or "dbus-broker" or "systemd-logind" or
  "nginx" or "apache2" or "httpd" or "smbd" or "vsftpd" or "proftpd" or "named" or "dnsmasq" or "openvpn" or
  "auditd" or "auditbeat" or "elastic-agent" or "osqueryd" or "systemd-journald" or "rsyslogd" or
  "cron" or "crond" or "atd" or "logrotate" or
  "geth" or "op-geth" or "erigon" or "reth" or "nethermind" or "besu" or "ethrex" or
  "lighthouse" or "prysm" or "beacon-chain" or "teku" or "nimbus_beacon_node" or "nimbus_validator_client" or "lodestar" or "grandine" or
  "op-node" or "op-batcher" or "op-proposer" or "op-challenger" or "op-conductor" or
  "clef" or "web3signer" or "ethsigner"
)
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1003"
name = "OS Credential Dumping"
reference = "https://attack.mitre.org/techniques/T1003/"

[[rule.threat.technique]]
id = "T1212"
name = "Exploitation for Credential Access"
reference = "https://attack.mitre.org/techniques/T1212/"

[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1203"
name = "Exploitation for Client Execution"
reference = "https://attack.mitre.org/techniques/T1203/"

[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
