[metadata]
creation_date = "2023/02/27"
integration = ["endpoint"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2023/07/17"

[rule]
author = ["Elastic"]
description = """
Identifies the execution of the unshadow utility which is part of John the Ripper,
a password-cracking tool on the host machine. Malicious actors can use the utility to retrieve
the combined contents of the '/etc/shadow' and '/etc/password' files.
Using the combined file generated from the utility, the malicious threat actors can use them as input
for password-cracking utilities or prepare themselves for future operations by gathering
credential information of the victim.
"""
from = "now-9m"
index = ["logs-endpoint.events.*", "endgame-*"]
language = "eql"
license = "Elastic License v2"
name = "Potential Linux Credential Dumping via Unshadow"
references = [
    "https://www.cyberciti.biz/faq/unix-linux-password-cracking-john-the-ripper/",
]
note = """## Triage and analysis

### Investigating Credential Dumping via Unshadow

The rule identifies execution of the unshadow utility which is part of John the Ripper, a password-cracking tool
on the host machine.Malicious actors can use the utility to retrieve the combined contents of the '/etc/shadow' and
'/etc/password' files.Using the combined file generated from the utility, the malicious threat actors can use them
as input for password-cracking utilities or prepare themselves for future operations by gathering
credential information of the victim.

#### Possible investigation steps

- Identify the session entry leader and session user
- Examine the contents of session leading to the unshadow activity via the Session View.
- Examine the command execution pattern in the session, which may lead to suspicious activities
- Examine the command execution post unshadow activity to indicate any exfiltration of shadow file data.
- If the analysis has shown exfiltration of cracked password data, analyse the impact of data that has been exfiltrated.
- Investigate other alerts associated with the user/host during the past 48 hours.

### Response and remediation

- Initiate the incident response process based on the outcome of the triage.
- Ensure the suspicious active session on the host from a malicious user from a cracked password be terminated.
- Isolate the involved host to prevent further post-compromise behavior.
- Perform a comprehensive examination of the compromised credentials that might have been used for unauthorized access or data exfiltration, and temporarily prevent their usage until a thorough analysis is conducted. Additionally, change those passwords before allowing any further usage.
- Determine the initial vector abused by the attacker and take action to prevent reinfection through the same vector.
- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the mean time to respond (MTTR).
"""
risk_score = 47
rule_id = "e7cb3cfd-aaa3-4d7b-af18-23b89955062c"
severity = "medium"
tags = ["Data Source: Elastic Endgame", "Domain: Endpoint", "OS: Linux", "Use Case: Threat Detection", "Tactic: Credential Access", "Resources: Investigation Guide"]
timestamp_override = "event.ingested"
type = "eql"
query = '''
process where host.os.type == "linux" and process.name == "unshadow" and
  event.type == "start" and event.action in ("exec", "exec_event") and process.args_count >= 2
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1003"
name = "OS Credential Dumping"
reference = "https://attack.mitre.org/techniques/T1003/"
[[rule.threat.technique.subtechnique]]
id = "T1003.008"
name = "/etc/passwd and /etc/shadow"
reference = "https://attack.mitre.org/techniques/T1003/008/"



[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

