[metadata]
creation_date = "2020/12/21"
maturity = "production"
updated_date = "2020/12/21"

[rule]
author = ["Elastic"]
description = """
Identifies SSH client or server process creating or writing to a known SSH Backdoor Log filename. Adversaries may modify
SSH related binaries for persistence or credential access via patching sensitive functions to enable unauthorized access
or log SSH credentials for exfiltration.
"""
false_positives = ["Trusted SSH Executables Updates."]
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "eql"
license = "Elastic License"
name = "Known SSH Backdoor Logging File"
references = ["https://github.com/eset/malware-ioc/tree/master/sshdoor"]
risk_score = 73
rule_id = "f28e2be4-6eca-4349-bdd9-381573730c22"
severity = "high"
tags = ["Elastic", "Host", "Linux", "Threat Detection", "Persistence", "Credential Access"]
type = "eql"

query = '''
file where event.type in ("create", "change") and process.name in ("sshd", "ssh") and
 file.path in ("/etc/X11/.pr", "/etc/gshadow--", "/usr/share/polkit-1/policy.in", "/usr/share/polkit-1/policy.out",
               "/usr/include/X11/sessmgr/coredump.in", "/usr/local/include/uconf.h", "/tmp/log", "/usr/lib/libsoftokn3.so.0",
               "/etc/ssh/.sshd_auth", "/usr/share/man/hu/sd", "/usr/share/man/man1/sd", "/usr/lib/libt1x.so.1.5", "/usr/lib/libcurl.a.2.1",
               "/usr/lib/libpanel.so.a.3", "/var/tmp/.pipe.sock", "/usr/share/lsx/.ig.swr", "/var/lib", "/usr/share/man/.urandom",
               "/usr/share/man/man0/.cache", "/dev/.ctrl", "/usr/include/netda.h", "/usr/include/pwd.h", "/usr/include/ide.h",
               "/usr/include/sys/record.h", "/usr/bin/ssd", "/usr/include/pwd2.h", "/usr/include/out.h", "/usr/lib/mozilla/extensions/mozzlia.ini",
               "/tmp/zilog", "/usr/tmp/~tmp441", "/var/opt/power", "/usr/local/share/man/man1/Openssh.1", "/usr/lib/gcc/x86_64-redhat-linux/.0",
               "/etc/ssh/ssh_known_hosts", "/usr/share/man/man1/.olog", "/usr/include/sn.h", "/usr/lib/libpanel.so.a.3", "/usr/share/boot.sync",
               "/usr/share/boot.sync", "/usr/include/mbstring.h", "/var/html/lol", "/usr/share/boot.sync", "/usr/share/boot.sync", "/var/log/utmp",
               "/usr/share/man/man5/ttyl.5.gz", "/usr/share/man/man5/ttyv.5.gz")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1556"
name = "Modify Authentication Process"
reference = "https://attack.mitre.org/techniques/T1556/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1543"
name = "Create or Modify System Process"
reference = "https://attack.mitre.org/techniques/T1543/"


[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

