[metadata]
creation_date = "2024/08/22"
integration = ["endpoint"]
maturity = "production"
updated_date = "2024/08/22"

[rule]
author = ["Elastic"]
description = """
This rule identifies potentially malicious processes attempting to access the cloud service provider's instance metadata service (IMDS) API
endpoint, which is typically used to retrieve sensitive instance-specific information such as instance ID, public IP
address, and even temporary security credentials if role's are assumed by that instance. The rule monitors for various tools and scripts like curl, wget,
python, and perl that might be used to interact with the metadata API.
"""
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License v2"
name = "Unusual Instance Metadata Service (IMDS) API Request"
references = ["https://hackingthe.cloud/aws/general-knowledge/intro_metadata_service/"]
risk_score = 47
rule_id = "ecc0cd54-608e-11ef-ab6d-f661ea17fbce"
severity = "medium"
tags = [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Credential Access",
    "Tactic: Discovery",
    "Data Source: Elastic Defend",
]
timestamp_override = "event.ingested"
type = "query"

query = '''
host.os.type: "linux" and event.category:process and event.type:start and event.action:exec and
(
    (
        (
            process.name:(
                curl or wget or python* or perl* or php* or ruby* or lua* or telnet or pwsh or
                openssl or nc or ncat or netcat or awk or gawk or mawk or nawk or socat or node
            ) or
            process.executable: (
                ./* or /tmp/* or /var/tmp/* or /var/www/* or /dev/shm/* or /etc/init.d/* or
                /etc/rc*.d/* or /etc/cron* or /etc/update-motd.d/* or /boot/* or /srv/* or
                /run/* or /etc/rc.local
            )
        ) and destination.ip: (169.254.169.254 or "fd00:ec2::254")
    ) or process.command_line: (*169.254.169.254* or "*fd00:ec2::254*")
) and not (
    process.working_directory: (
        /opt/rapid7* or
        /opt/nessus* or
        /snap/amazon-ssm-agent* or
        /srv/snp/docker/overlay2* or
        /var/log/amazon/ssm*
) or
    process.parent.executable: /opt/oracle* or
    process.command_line: *Rapid7* or
    process.executable: (/srv/snp/docker/overlay2* or /tmp/newroot/*)
)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1552"
name = "Unsecured Credentials"
reference = "https://attack.mitre.org/techniques/T1552/"
[[rule.threat.technique.subtechnique]]
id = "T1552.005"
name = "Cloud Instance Metadata API"
reference = "https://attack.mitre.org/techniques/T1552/005/"



[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

