[metadata]
creation_date = "2020/05/04"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/11/03"

[rule]
author = ["Elastic"]
description = """
Adversaries may attempt to clear the bash command line history in an attempt to evade detection or forensic
investigations.
"""
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "lucene"
license = "Elastic License"
name = "Deletion of Bash Command Line History"
risk_score = 47
rule_id = "7bcbb3ac-e533-41ad-a612-d6c3bf666aba"
severity = "medium"
tags = ["Elastic", "Host", "Linux", "Threat Detection", "Defense Evasion"]
type = "query"

query = '''
event.category:process AND event.type:(start or process_started) AND process.name:rm AND
  process.args:/\/(home\/.{1,255}|root)\/\.bash_history/
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1146"
name = "Clear Command History"
reference = "https://attack.mitre.org/techniques/T1146/"


[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

