[metadata]
creation_date = "2022/03/15"
maturity = "production"
updated_date = "2022/03/15"

[rule]
author = ["Elastic"]
description = """
Identifies Linux binary nice abuse to break out from restricted environments by spawning an interactive system
shell.This activity is not standard use with this binary for a user or system administrator. It indicates a potentially
malicious actor attempting to improve the capabilities or stability of their access
"""
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "eql"
license = "Elastic License v2"
name = "Linux Restricted Shell Breakout via c89/c99 Shell evasion"
references = ["https://gtfobins.github.io/gtfobins/c89/"]
risk_score = 47
rule_id = "1859ce38-6a50-422b-a5e8-636e231ea0cd"
severity = "medium"
tags = ["Elastic", "Host", "Linux", "Threat Detection", "Defense Evasion", "GTFOBins"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
sequence by host.id, process.pid with maxspan=1m
[process where process.name :("c89","c99") and process.args == "-wrapper" and process.args : ("sh,-s", "bash,-s", "dash,-s", "/bin/sh,-s", "/bin/bash,-s", "/bin/dash,-s")]
[process where process.parent.name : ("bash", "sh", "dash")]
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1548"
name = "Abuse Elevation Control Mechanism"
reference = "https://attack.mitre.org/techniques/T1548/"
[[rule.threat.technique.subtechnique]]
id = "T1548.004"
name = "Elevated Execution with Prompt"
reference = "https://attack.mitre.org/techniques/T1548/004/"



[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

