[metadata]
creation_date = "2022/02/28"
maturity = "production"
updated_date = "2022/02/28"

[rule]
author = ["Elastic"]
description = "Identifies Linux binary find abuse to break out from restricted environments by spawning an interactive system shell. This activity is not standard use with this binary for a user or system administrator. It indicates a potentially malicious actor attempting to improve the capabilities or stability of their access."
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "eql"
license = "Elastic License v2"
name = "Linux Restricted Shell Breakout via the find command"
references = ["https://gtfobins.github.io/gtfobins/find/"]
risk_score = 47
rule_id = "6f683345-bb10-47a7-86a7-71e9c24fb358"
severity = "medium"
tags = ["Elastic", "Host", "Linux", "Threat Detection", "Defense Evasion", "GTFOBins"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
sequence by host.id, process.pid with maxspan=1m
[process where process.name == "find" and process.args : "-exec" and process.args : ("/bin/bash", "/bin/sh", "bash", "sh") and process.args : ";"]
[process where process.parent.name == "find" and process.name : ("bash", "sh")]
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1548"
name = "Abuse Elevation Control Mechanism"
reference = "https://attack.mitre.org/techniques/T1548/"
[[rule.threat.technique.subtechnique]]
id = "T1548.004"
name = "Elevated Execution with Prompt"
reference = "https://attack.mitre.org/techniques/T1548/004/"



[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

