[metadata]
creation_date = "2022/03/07"
maturity = "development"
updated_date = "2022/03/07"

[rule]
author = ["Elastic"]
description =  """
Identifies Linux binary nice abuse to break out from restricted environments by spawning an interactive system shell.This
activity is not standard use with this binary for a user or system administrator. It indicates a potentially malicious
actor attempting to improve the capabilities or stability of their access
"""
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "eql"
license = "Elastic License v2"
name = "Linux Restricted Shell Breakout via nice Shell evasion"
references = ["https://gtfobins.github.io/gtfobins/nice/"]
risk_score = 47
rule_id = "22755f7f-1e1e-4528-a75f-bb3f4026d1b9"
severity = "medium"
tags = ["Elastic", "Host", "Linux", "Threat Detection", "Defense Evasion", "GTFOBins"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
sequence by host.id, process.pid with maxspan=1m
[process where event.type == "start" and process.name == "nice" and process.args : ("/bin/bash", "/bin/sh", "/bin/dash", "sh", "bash", "dash")]
[process where process.name : ("bash", "sh", "dash")]
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1548"
name = "Abuse Elevation Control Mechanism"
reference = "https://attack.mitre.org/techniques/T1548/"
[[rule.threat.technique.subtechnique]]
id = "T1548.004"
name = "Elevated Execution with Prompt"
reference = "https://attack.mitre.org/techniques/T1548/004/"



[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"

