[metadata]
creation_date = "2022/02/24"
maturity = "production"
updated_date = "2022/02/24"

[rule]
author = ["Elastic"]
description = """
Identifies Linux binary awk abuse to breakout out of restricted shells or environments by spawning an
interactive system shell. This activity is not standard use with this binary for a user or system administrator. It indicates a potentially malicious actor attempting to improve the capabilities or stability of their access.
"""
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "eql"
license = "Elastic License v2"
name = "Linux Restricted Shell Breakout via awk Commands"
references = ["https://gtfobins.github.io/gtfobins/nawk/",
              "https://gtfobins.github.io/gtfobins/mawk/"]
risk_score = 47
rule_id = "10754992-28c7-4472-be5b-f3770fd04f2d"
severity = "medium"
tags = ["Elastic", "Host", "Linux", "Threat Detection", "Defense Evasion", "GTFOBins"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
sequence by host.id, process.pid with maxspan=1m 
  [process where process.name : ("nawk", "mawk", "awk", "gawk") and process.args : "BEGIN {system(*)}"] 
  [process where process.parent.name : ("nawk", "mawk", "awk", "gawk") and process.name : ("sh", "bash")]
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1548"
name = "Abuse Elevation Control Mechanism"
reference = "https://attack.mitre.org/techniques/T1548/"
[[rule.threat.technique.subtechnique]]
id = "T1548.004"
name = "Elevated Execution with Prompt"
reference = "https://attack.mitre.org/techniques/T1548/004/"



[rule.threat.tactic]
id = "TA0005"
name = "Defense Evasion"
reference = "https://attack.mitre.org/tactics/TA0005/"