[metadata]
creation_date = "2025/04/30"
integration = ["endpoint"]
maturity = "production"
updated_date = "2025/04/30"

[rule]
author = ["Elastic"]
description = """
This rule detects the use of the LD_PRELOAD and LD_LIBRARY_PATH environment variables in a command line argument.
This behavior is unusual and may indicate an attempt to hijack the execution flow of a process. Threat actors may use
this technique to evade defenses, escalate privileges, or maintain persistence on a system.
"""
from = "now-9m"
index = ["logs-endpoint.events.process*"]
language = "kuery"
license = "Elastic License v2"
name = "Unusual LD_PRELOAD/LD_LIBRARY_PATH Command Line Arguments"
risk_score = 21
rule_id = "65613f5e-0d48-4b55-ad61-2fb9567cb1ad"
setup = """## Setup

This rule requires data coming in from Elastic Defend.

### Elastic Defend Integration Setup
Elastic Defend is integrated into the Elastic Agent using Fleet. Upon configuration, the integration allows the Elastic Agent to monitor events on your host and send data to the Elastic Security app.

#### Prerequisite Requirements:
- Fleet is required for Elastic Defend.
- To configure Fleet Server refer to the [documentation](https://www.elastic.co/guide/en/fleet/current/fleet-server.html).

#### The following steps should be executed in order to add the Elastic Defend integration on a Linux System:
- Go to the Kibana home page and click "Add integrations".
- In the query bar, search for "Elastic Defend" and select the integration to see more details about it.
- Click "Add Elastic Defend".
- Configure the integration name and optionally add a description.
- Select the type of environment you want to protect, either "Traditional Endpoints" or "Cloud Workloads".
- Select a configuration preset. Each preset comes with different default settings for Elastic Agent, you can further customize these later by configuring the Elastic Defend integration policy. [Helper guide](https://www.elastic.co/guide/en/security/current/configure-endpoint-integration-policy.html).
- We suggest selecting "Complete EDR (Endpoint Detection and Response)" as a configuration setting, that provides "All events; all preventions"
- Enter a name for the agent policy in "New agent policy name". If other agent policies already exist, you can click the "Existing hosts" tab and select an existing policy instead.
For more details on Elastic Agent configuration settings, refer to the [helper guide](https://www.elastic.co/guide/en/fleet/8.10/agent-policy.html).
- Click "Save and Continue".
- To complete the integration, select "Add Elastic Agent to your hosts" and continue to the next section to install the Elastic Agent on your hosts.
For more details on Elastic Defend refer to the [helper guide](https://www.elastic.co/guide/en/security/current/install-endpoint.html).
"""
severity = "low"
tags = [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Defense Evasion",
    "Tactic: Persistence",
    "Data Source: Elastic Defend",
]
timestamp_override = "event.ingested"
type = "new_terms"
query = '''
host.os.type:linux and event.category:process and event.type:start and event.action:exec and
process.parent.name:(* and not (
  awk or bwrap or cylancesvc or dbus-run-session or java or julia or make or matlab_helper or ninja or noproc_sandbox or
  nxrunner or nxserver or perl or rear or sapcontrol or setsid or spoold or sshd or steam or su or sudo or titanagent or
  vls_agent or zabbix_agentd
)) and
process.name:(bash or csh or dash or fish or ksh or sh or tcsh or zsh) and
process.args:-c and process.command_line:(*LD_LIBRARY_PATH=* or *LD_PRELOAD=*)
'''
[[rule.threat]]
framework = "MITRE ATT&CK"

  [rule.threat.tactic]
  name = "Defense Evasion"
  id = "TA0005"
  reference = "https://attack.mitre.org/tactics/TA0005/"

  [[rule.threat.technique]]
  name = "Hijack Execution Flow"
  id = "T1574"
  reference = "https://attack.mitre.org/techniques/T1574/"

  [[rule.threat.technique.subtechnique]]
  name = "Dynamic Linker Hijacking"
  id = "T1574.006"
  reference = "https://attack.mitre.org/techniques/T1574/006/"

[[rule.threat]]
framework = "MITRE ATT&CK"

  [rule.threat.tactic]
  name = "Persistence"
  id = "TA0003"
  reference = "https://attack.mitre.org/tactics/TA0003/"

  [[rule.threat.technique]]
  name = "Hijack Execution Flow"
  id = "T1574"
  reference = "https://attack.mitre.org/techniques/T1574/"

  [[rule.threat.technique.subtechnique]]
  name = "Dynamic Linker Hijacking"
  id = "T1574.006"
  reference = "https://attack.mitre.org/techniques/T1574/006/"

[[rule.threat]]
framework = "MITRE ATT&CK"

  [rule.threat.tactic]
  name = "Privilege Escalation"
  id = "TA0004"
  reference = "https://attack.mitre.org/tactics/TA0004/"

  [[rule.threat.technique]]
  name = "Hijack Execution Flow"
  id = "T1574"
  reference = "https://attack.mitre.org/techniques/T1574/"

  [[rule.threat.technique.subtechnique]]
  name = "Dynamic Linker Hijacking"
  id = "T1574.006"
  reference = "https://attack.mitre.org/techniques/T1574/006/"

[rule.new_terms]
field = "new_terms_fields"
value = ["process.parent.name", "process.command_line", "host.id"]

[[rule.new_terms.history_window_start]]
field = "history_window_start"
value = "now-7d"
