[metadata]
creation_date = "2023/09/04"
integration = ["endpoint"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2023/09/04"

[rule]
author = ["Elastic"]
description = """
This threshold rule monitors for the rapid execution of unix utilities that are capable of conducting network scans. 
Adversaries may leverage built-in tools such as ping, netcat or socat to execute ping sweeps across the network while 
attempting to evade detection or due to the lack of network mapping tools available on the compromised host. 
"""
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License v2"
name = "Potential Network Scan Executed From Host"
risk_score = 47
rule_id = "03c23d45-d3cb-4ad4-ab5d-b361ffe8724a"
severity = "medium"
tags = ["Domain: Endpoint", "OS: Linux", "Use Case: Threat Detection", "Tactic: Discovery", "Data Source: Elastic Defend"]
timestamp_override = "event.ingested"
type = "threshold"
query = '''
host.os.type:linux and event.action:exec and event.type:start and 
process.name:(ping or nping or hping or hping2 or hping3 or nc or ncat or netcat or socat)
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1046"
name = "Network Service Discovery"
reference = "https://attack.mitre.org/techniques/T1046/"

[rule.threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"

[rule.threshold]
field = ["host.id", "process.parent.entity_id", "process.executable"]
value = 1

[[rule.threshold.cardinality]]
field = "process.args"
value = 100
