[metadata]
creation_date = "2024/06/25"
integration = ["endpoint"]
maturity = "production"
updated_date = "2024/06/25"

[rule]
author = ["Elastic"]
description = """
This rule detects the execution of the `grep` command with the `plugins=1` argument on Linux systems. This command is
used to search for plugins in the `/etc/yum.conf`, `/usr/lib/yum-plugins/*`, and `/etc/yum/pluginconf.d/*` directories, 
that have plugins enabled. This behavior may indicate an attacker is attempting to establish persistence in a Yum plugin.
"""
from = "now-9m"
index = ["logs-endpoint.events.*", "endgame-*"]
language = "eql"
license = "Elastic License v2"
name = "Yum Plugin Status Discovery"
references = ["https://github.com/rapid7/metasploit-framework/blob/master/modules/exploits/linux/local/yum_package_manager_persistence.rb"]
risk_score = 21
rule_id = "78390eb5-c838-4c1d-8240-69dd7397cfb7"
severity = "low"
tags = [
    "Domain: Endpoint",
    "OS: Linux",
    "Use Case: Threat Detection",
    "Tactic: Discovery",
    "Data Source: Elastic Defend",
    "Data Source: Elastic Endgame",
]
timestamp_override = "event.ingested"
type = "eql"
query = '''
process where host.os.type == "linux" and event.type == "start" and event.action in ("exec", "exec_event") and
process.name == "grep" and process.args == "plugins=1" and
process.args : ("/etc/yum.conf", "/usr/lib/yum-plugins/*", "/etc/yum/pluginconf.d/*")
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1082"
name = "System Information Discovery"
reference = "https://attack.mitre.org/techniques/T1082/"

[rule.threat.tactic]
id = "TA0007"
name = "Discovery"
reference = "https://attack.mitre.org/tactics/TA0007/"
