[metadata]
creation_date = "2020/04/15"
integration = ["endpoint"]
maturity = "production"
updated_date = "2023/06/19"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"

[rule]
author = ["Elastic"]
description = """
Identifies when a terminal (tty) is spawned via Python. Attackers may upgrade a simple reverse shell to a fully
interactive tty after obtaining initial access to a host.
"""
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "eql"
license = "Elastic License v2"
name = "Interactive Terminal Spawned via Python"
risk_score = 73
rule_id = "d76b02ef-fc95-4001-9297-01cb7412232f"
severity = "high"
tags = ["Elastic", "Host", "Linux", "Threat Detection", "Execution", "Elastic Endgame"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
process where host.os.type == "linux" and event.action : ("exec", "exec_event") and
(
   (process.parent.name : "*sh" and process.name : "python*" and process.parent.args : "*pty.spawn*"
    and process.parent.args : "-c" and process.parent.args_count >= 3 )
    or
    (process.parent.name : "python*" and process.name : "*sh" and process.args : "*sh" and process.args_count == 1)
)
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"

  [[rule.threat.technique.subtechnique]]
  id = "T1059.006"
  name = "Python"
  reference = "https://attack.mitre.org/techniques/T1059/006/"

[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"
