[metadata]
creation_date = "2020/04/15"
integration = ["endpoint"]
maturity = "production"
updated_date = "2023/05/05"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"

[rule]
author = ["Elastic"]
description = """
Identifies when a terminal (tty) is spawned via Python. Attackers may upgrade a simple reverse shell to a fully
interactive tty after obtaining initial access to a host.
"""
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "kuery"
license = "Elastic License v2"
name = "Interactive Terminal Spawned via Python"
risk_score = 73
rule_id = "d76b02ef-fc95-4001-9297-01cb7412232f"
severity = "high"
tags = ["Elastic", "Host", "Linux", "Threat Detection", "Execution", "Elastic Endgame"]
timeline_id = "e70679c2-6cde-4510-9764-4823df18f7db"
timeline_title = "Comprehensive Process Timeline"
timestamp_override = "event.ingested"
type = "eql"

query = '''
sequence with maxspan=1m
  [process where event.type in ("start", "process_started") and process.name : "python*"] by process.entity_id
  [process where event.type in ("start", "process_started") and 
   process.executable : (
      "/bin/bash",
      "/bin/sh",
      "/bin/dash",
      "/bin/csh",
      "/bin/zsh",
      "/bin/ksh",
      "/bin/tcsh",
      "/bin/fish",
      "/bin/ash",
      "/bin/bsh"
   )
  ] by process.parent.entity_id
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"

  [[rule.threat.technique.subtechnique]]
  id = "T1059.006"
  name = "Python"
  reference = "https://attack.mitre.org/techniques/T1059/006/"

[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"

