[metadata]
creation_date = "2022/03/10"
maturity = "production"
updated_date = "2022/03/17"

[rule]
author = ["Elastic"]
description = """
Identifies Linux binary ssh abuse to break out from restricted environments by spawning an interactive system shell.This
activity is not standard use with this binary for a user or system administrator and could potentially indicate
malicious actor attempting to improve the capabilities or stability of their access.
"""
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "eql"
license = "Elastic License v2"
name = "Linux Restricted Shell Breakout via the ssh command"
references = ["https://gtfobins.github.io/gtfobins/ssh/"]
risk_score = 47
rule_id = "97da359b-2b61-4a40-b2e4-8fc48cf7a294"
severity = "medium"
tags = ["Elastic", "Host", "Linux", "Threat Detection", "Execution", "GTFOBins"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
sequence by host.id, process.pid with maxspan=1m
[process where process.name == "ssh" and process.args == "-o" and process.args : ("ProxyCommand=;sh*", "ProxyCommand=;bash*", "ProxyCommand=;dash*", "ProxyCommand=;/bin/sh*", "ProxyCommand=;/bin/bash*", "ProxyCommand=;/bin/dash*")]
[process where process.parent.name == "ssh" and process.name : ("bash", "sh", "dash")]
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"
[[rule.threat.technique.subtechnique]]
id = "T1059.004"
name = "Unix Shell"
reference = "https://attack.mitre.org/techniques/T1059/004/"



[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"

