[metadata]
creation_date = "2023/07/04"
integration = ["endpoint"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.3.0"
updated_date = "2023/07/04"

[rule]
author = ["Elastic"]
description = """
This detection rule detects the creation of a shell through a suspicious parent child relationship. Any reverse shells
spawned by the specified utilities that use a forked process to initialize the connection attempt will be captured 
through this rule. Attackers may spawn reverse shells to establish persistence onto a target system. 
"""
from = "now-9m"
index = ["logs-endpoint.events.*"]
language = "eql"
license = "Elastic License v2"
name = "Suspicious Shell and Network Activity by Potentially Malicious Parent Child Relationship Detected"
references = [
    "https://github.com/swisskyrepo/PayloadsAllTheThings/blob/master/Methodology%20and%20Resources/Reverse%20Shell%20Cheatsheet.md"
]
risk_score = 47
rule_id = "4b1a807a-4e7b-414e-8cea-24bf580f6fc5"
severity = "high"
tags = ["Domain: Endpoint", "OS: Linux", "Use Case: Threat Detection", "Tactic: Execution"]
timestamp_override = "event.ingested"
type = "eql"
query = '''
sequence by host.id with maxspan=5s
[ process where host.os.type == "linux" and event.action == "fork" and 
process.name : ("bash", "dash", "sh", "tcsh", "csh", "zsh", "ksh", "fish") and 
process.parent.name : ("bash", "dash", "sh", "tcsh", "csh", "zsh", "ksh", "fish") ] by process.entity_id
[ process where host.os.type == "linux" and event.action == "exec" and 
process.name : ("bash", "dash", "sh", "tcsh", "csh", "zsh", "ksh", "fish", "perl", "python*",
"nc", "ncat", "netcat", "php*", "ruby", "openssl", "awk", "telnet", "lua*", "socat") and 
process.parent.name : ("bash", "dash", "sh", "tcsh", "csh", "zsh", "ksh", "fish") ] by process.entity_id
[ process where host.os.type == "linux" and event.action == "fork" and 
process.name : ("bash", "dash", "sh", "tcsh", "csh", "zsh", "ksh", "fish", "perl", "python*",
"nc", "ncat", "netcat", "php*", "ruby", "openssl", "awk", "telnet", "lua*", "socat") and 
process.parent.name : ("bash", "dash", "sh", "tcsh", "csh", "zsh", "ksh", "fish", "perl", "python*",
"nc", "ncat", "netcat", "php*", "ruby", "openssl", "awk", "telnet", "lua*", "socat") ] by process.parent.entity_id
[ network where host.os.type == "linux" and event.action : ("connection_attempted", "connection_accepted") and 
process.name : ("bash", "dash", "sh", "tcsh", "csh", "zsh", "ksh", "fish", "perl", "python*",
"nc", "ncat", "netcat", "php*", "ruby", "openssl", "awk", "telnet", "lua*", "socat") ] by process.parent.entity_id
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
name = "Execution"
id = "TA0002"
reference = "https://attack.mitre.org/tactics/TA0002/"

[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"

[[rule.threat.technique.subtechnique]]
id = "T1059.004"
name = "Unix Shell"
reference = "https://attack.mitre.org/techniques/T1059/004/"

[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
name = "Command and Control"
id = "TA0011"
reference = "https://attack.mitre.org/tactics/TA0011/"

[[rule.threat.technique]]
name = "Application Layer Protocol"
id = "T1071"
reference = "https://attack.mitre.org/techniques/T1071/"
