[metadata]
creation_date = "2020/02/18"
ecs_version = ["1.4.0"]
maturity = "production"
updated_date = "2020/02/18"

[rule]
author = ["Elastic"]
description = "Identifies processes running in a temporary folder. This is sometimes done by adversaries to hide malware."
false_positives = [
    """
    Build systems, like Jenkins, may start processes in the `/tmp` directory. These can be exempted by name or by
    username.
    """,
]
index = ["auditbeat-*"]
language = "kuery"
license = "Elastic License"
name = "Unusual Process Execution - Temp"
risk_score = 47
rule_id = "df959768-b0c9-4d45-988c-5606a2be8e5a"
severity = "medium"
tags = ["Elastic", "Linux"]
type = "query"

query = '''
process.working_directory:/tmp and event.action:executed
'''

