[metadata]
creation_date = "2020/12/21"
maturity = "production"
updated_date = "2020/12/21"

[rule]
author = ["Elastic"]
description = """
Adversaries may modify SSH related binaries for persistence or credential access via patching sensitive functions to
enable unauthorized access or log SSH credentials for exfiltration.
"""
false_positives = ["Trusted SSH Executables Updates."]
from = "now-9m"
index = ["auditbeat-*", "logs-endpoint.events.*"]
language = "eql"
license = "Elastic License"
name = "Modification of SSH Binaries"
references = ["https://blog.angelalonso.es/2016/09/anatomy-of-real-linux-intrusion-part-ii.html"]
risk_score = 47
rule_id = "0415f22a-2336-45fa-ba07-618a5942e22c"
severity = "medium"
tags = ["Elastic", "Host", "Linux", "Threat Detection", "Credential Access", "Persistence"]
type = "eql"

query = '''
file where event.type == "change" and 
 file.path in ("/usr/sbin/sshd", "/usr/bin/ssh", "/usr/bin/sftp", "/usr/bin/scp") and process.name != null
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1556"
name = "Modify Authentication Process"
reference = "https://attack.mitre.org/techniques/T1556/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"
[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1543"
name = "Create or Modify System Process"
reference = "https://attack.mitre.org/techniques/T1543/"


[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

