[metadata]
creation_date = "2026/06/01"
integration = ["endpoint"]
maturity = "production"
updated_date = "2026/06/01"

[rule]
author = ["Elastic"]
description = """
This rule leverages the "new_terms" rule type to detect unusual child process executions originating
from web server processes on Linux systems. Attackers may exploit web servers to maintain persistence
on a compromised system, often resulting in atypical child process executions. As child process spawns
from web server parent processes are common, the "new_terms" rule type approach helps identify deviations
from normal behavior.
"""
from = "now-9m"
index = ["logs-endpoint.events.process*"]
language = "kuery"
license = "Elastic License v2"
name = "Unusual Child Execution via Web Server"
risk_score = 47
rule_id = "b2f0ea08-2b60-4a2d-93d7-fe996a30031a"
severity = "medium"
tags = [
  "Domain: Endpoint",
  "Domain: Web",
  "OS: Linux",
  "Use Case: Threat Detection",
  "Tactic: Persistence",
  "Data Source: Elastic Defend"
]
timestamp_override = "event.ingested"
type = "new_terms"
query = '''
event.category:process and host.os.type:linux and event.type:start and event.action:exec and (
  process.parent.name:(
    "nginx" or "apache2" or "httpd" or "caddy" or "mongrel_rails" or "uwsgi" or "daphne" or "httpd.worker" or "flask" or
    "php-cgi" or "php-fcgi" or "php-cgi.cagefs" or "lswsctrl" or "varnishd" or "uvicorn" or "waitress-serve" or "starman" or
    "frankenphp" or "zabbix_server" or "asterisk" or "sw-engine-fpm"
  ) or
  process.parent.name:(php-fpm* or gunicorn* or *.cgi or *.fcgi) or
  (
    process.parent.name:ruby* and
    process.parent.command_line:(*puma* or *rails* or *passenger*)
  ) or
  (
    process.parent.name:python* and
    process.parent.command_line:(
      *hypercorn* or *flask* or *uvicorn* or *django* or *app.py* or *server.py* or *wsgi.py* or *asgi.py*
    )
  ) or
  (process.parent.name:perl* and process.parent.command_line:*plackup*) or
  (
    process.parent.name:"java" and
    process.parent.args:(
      "org.apache.catalina.startup.Bootstrap" or -Dcatalina.base=* or
      "org.eclipse.jetty.start.Main" or -Djetty.home=* or
      "org.jboss.modules.Main" or -Djboss.home.dir=* or
      "weblogic.Server" or -Dweblogic.Name=* or *weblogic-launcher.jar* or
      "com.ibm.ws.runtime.WsServer" or "com.ibm.ws.kernel.boot.cmdline.Bootstrap" or
      "com.sun.enterprise.glassfish.bootstrap.ASMain" or
      "com.caucho.server.resin.Resin" or
      org.springframework.boot.loader.* or
      *quarkus-run.jar* or "io.quarkus.runner.GeneratedMain" or
      "io.micronaut.runtime.Micronaut" or
      "io.dropwizard.cli.ServerCommand" or
      "play.core.server.ProdServerStart" or
      "io.helidon.microprofile.server.Main" or io.helidon.webserver* or
      "io.vertx.core.Launcher" or
      org.keycloak* or
      org.apereo.cas* or
      "org.elasticsearch.bootstrap.Elasticsearch" or
      "com.atlassian.jira.startup.Launcher" or *BitbucketServerLauncher* or "com.google.gerrit.pgm.Daemon" or
      *-Dsolr.solr.home=* or
      *jenkins.war*
    )
  )
) and
process.executable:* and process.command_line:* and
not (
  process.name:(
    .* or *.elf or *.sh or *.py or *.rb or *.pl or *.lua* or *.php* or .js or *.bin or *.jar or *.mjs or
    "bash" or "dash" or "sh" or "tcsh" or "csh" or "zsh" or "ksh" or "fish" or "mksh" or "busybox" or
    "nc" or "netcat" or "ncat" or "telnet" or "socat" or "openssl" or "nc.openbsd" or "ngrok" or "nc.traditional" or
    "az" or "gcloud" or "aws" or "kubectl" or "helm" or "docker" or "ctr" or "crictl" or
    "whoami" or "ifconfig" or "ip" or "ss" or "top" or "htop" or "df" or "du" or "lsblk" or "lsof" or "tcpdump" or
    "strace" or "ltrace" or "curl" or "wget" or "dig" or "nslookup" or "host" or "nmap" or "arp" or "traceroute" or
    "cat" or "touch" or "cp" or "mv" or "rm" or "mkdir" or "ln" or "chmod" or "sudo" or "xxd" or "base64" or "basez" or
    "base64plain" or "base64url" or "base64mime" or "base64pem" or "basenc" or "base32" or "base16" or "chpasswd" or
    "passwd" or "uname"
  ) or
  process.executable:(
    /tmp/* or /var/tmp/* or /dev/shm/* or ./* or /run/* or /var/run/* or /boot/* or /sys/* or /lost+found/* or
    /proc/* or /var/mail/* or /var/www/* or /home/*/* or /root/*
  ) or
  (process.parent.name:java and not process.parent.executable:/u0*/*) or
  process.working_directory:(/u0*/*/sysman/emd or /u0*/app/oracle/product/*/dbhome_* or /u0*/app/oracle/product/*/db_* or /var/www/*edoc*) or
  process.args:(/usr/local/bin/wkhtmltopdf* or /usr/bin/rsvg-convert*) or
  process.command_line:*/opt/sc/bin/showvulns*
)
'''

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1505"
name = "Server Software Component"
reference = "https://attack.mitre.org/techniques/T1505/"

[[rule.threat.technique.subtechnique]]
id = "T1505.003"
name = "Web Shell"
reference = "https://attack.mitre.org/techniques/T1505/003/"

[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1059"
name = "Command and Scripting Interpreter"
reference = "https://attack.mitre.org/techniques/T1059/"

[[rule.threat.technique.subtechnique]]
id = "T1059.004"
name = "Unix Shell"
reference = "https://attack.mitre.org/techniques/T1059/004/"

[rule.threat.tactic]
id = "TA0002"
name = "Execution"
reference = "https://attack.mitre.org/tactics/TA0002/"

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1071"
name = "Application Layer Protocol"
reference = "https://attack.mitre.org/techniques/T1071/"

[rule.threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"

[[rule.threat]]
framework = "MITRE ATT&CK"

[[rule.threat.technique]]
id = "T1190"
name = "Exploit Public-Facing Application"
reference = "https://attack.mitre.org/techniques/T1190/"

[rule.threat.tactic]
id = "TA0001"
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0001/"

[rule.new_terms]
field = "new_terms_fields"
value = ["process.command_line", "host.id", "process.executable"]

[[rule.new_terms.history_window_start]]
field = "history_window_start"
value = "now-7d"
