[metadata]
creation_date = "2020/02/18"
ecs_version = ["1.4.0"]
maturity = "production"
updated_date = "2020/02/18"

[rule]
author = ["Elastic"]
description = "Identifies suspicious commands executed via a web server, which may suggest a vulnerability and remote shell access."
false_positives = [
    """
    Network monitoring or management products may have a web server component that runs shell commands as part of normal
    behavior.
    """,
]
index = ["auditbeat-*"]
language = "kuery"
license = "Elastic License"
name = "Potential Shell via Web Server"
references = ["https://pentestlab.blog/tag/web-shell/"]
risk_score = 47
rule_id = "231876e7-4d1f-4d63-a47c-47dd1acdc1cb"
severity = "medium"
tags = ["Elastic", "Linux"]
type = "query"

query = '''
process.name:(bash or dash) and user.name:(apache or nginx or www or "www-data") and event.action:executed
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1100"
name = "Web Shell"
reference = "https://attack.mitre.org/techniques/T1100/"


[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

