[metadata]
creation_date = "2020/05/21"
ecs_version = ["1.6.0"]
maturity = "production"
updated_date = "2020/09/15"

[rule]
author = ["Elastic"]
description = """
An adversary may attempt to bypass the Okta multi-factor authentication (MFA) policies configured for an organization in
order to obtain unauthorized access to an application. This rule detects when an Okta MFA bypass attempt occurs.
"""
index = ["filebeat-*", "logs-okta*"]
language = "kuery"
license = "Elastic License"
name = "Attempted Bypass of Okta MFA"
note = "The Okta Filebeat module must be enabled to use this rule."
references = [
    "https://developer.okta.com/docs/reference/api/system-log/",
    "https://developer.okta.com/docs/reference/api/event-types/",
]
risk_score = 73
rule_id = "3805c3dc-f82c-4f8d-891e-63c24d3102b0"
severity = "high"
tags = ["Elastic", "Okta", "SecOps", "Identity and Access", "Continuous Monitoring"]
type = "query"

query = '''
event.module:okta and event.dataset:okta.system and event.action:user.mfa.attempt_bypass
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1111"
name = "Two-Factor Authentication Interception"
reference = "https://attack.mitre.org/techniques/T1111/"


[rule.threat.tactic]
id = "TA0006"
name = "Credential Access"
reference = "https://attack.mitre.org/tactics/TA0006/"

