[metadata]
creation_date = "2021/05/14"
maturity = "development"
updated_date = "2021/05/14"

[rule]
author = ["Elastic", "Austin Songer"]
description = "Identifies when a user account attempted to access an Okta application in an unauthorized way."
index = ["filebeat-*", "logs-okta*"]
language = "kuery"
name = "Okta User Attempted Unauthorized Access"
risk_score = 21
rule_id = "4edd3e1a-3aa0-499b-8147-4d2ea43b1613"
severity = "low"
tags = ["Elastic", "Identity", "Okta", "Continuous Monitoring", "SecOps", "Identity and Access"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.module:okta.system and event.action:app.generic.unauth_app_access_attempt or (okta.displayMessage:"User attempted unauthorized access to app")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
name = "Valid Accounts"
id = "T1078"
reference = "https://attack.mitre.org/techniques/T1078/"


[rule.threat.tactic]
name = "Initial Access"
id = "TA0001"
reference = "https://attack.mitre.org/tactics/TA0001/"
[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
name = "Defense Evasion"
id = "TA0005"
reference = "https://attack.mitre.org/tactics/TA0005/"
[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
name = "Persistence"
id = "TA0003"
reference = "https://attack.mitre.org/tactics/TA0003/"
[[rule.threat]]
framework = "MITRE ATT&CK"

[rule.threat.tactic]
name = "Privilege Escalation"
id = "TA0004"
reference = "https://attack.mitre.org/tactics/TA0004/"
