[metadata]
creation_date = "2023/09/14"
integration = ["dga"]
maturity = "production"
min_stack_comments = "New rule"
min_stack_version = "8.3.0"
updated_date = "2023/09/14"

[rule]
author = ["Elastic"]
description = """
A supervised machine learning model has identified a DNS question name that used by the SUNBURST malware and is
predicted to be the result of a Domain Generation Algorithm.
"""
from = "now-10m"
index = ["logs-endpoint.events.*", "logs-network_traffic.*"]
language = "kuery"
license = "Elastic License v2"
name = "Machine Learning Detected DGA activity using a known SUNBURST DNS domain"
risk_score = 99
rule_id = "bcaa15ce-2d41-44d7-a322-918f9db77766"
severity = "critical"
tags = [
    "Domain: Network",
    "Use Case: Domain Generation Algorithm Detection",
    "Rule Type: ML",
    "Rule Type: Machine Learning",
    "Tactic: Command and Control",
]
type = "query"

query = '''
event.category:network and network.protocol:dns and 
ml_is_dga.malicious_prediction:1 and dns.question.registered_domain:avsvmcloud.com
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1568"
name = "Dynamic Resolution"
reference = "https://attack.mitre.org/techniques/T1568/"
[[rule.threat.technique.subtechnique]]
id = "T1568.002"
name = "Domain Generation Algorithms"
reference = "https://attack.mitre.org/techniques/T1568/002/"



[rule.threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"

