[metadata]
creation_date = "2023/09/22"
integration = ["beaconing", "endpoint", "network_traffic"]
maturity = "production"
min_stack_comments = "Beaconing package updates and support"
min_stack_version = "8.10.1"
updated_date = "2024/01/05"

[rule]
author = ["Elastic"]
description = """
A statistical model has identified command-and-control (C2) beaconing activity. Beaconing can help attackers maintain
stealthy communication with their C2 servers, receive instructions and payloads, exfiltrate data and maintain
persistence in a network.
"""
from = "now-1h"
index = ["ml_beaconing.all"]
language = "kuery"
license = "Elastic License v2"
name = "Statistical Model Detected C2 Beaconing Activity"
setup = """
The rule requires the Network Beaconing Identification integration assets to be installed, as well as network logs collected by the Elastic Defend or Network Packet Capture integrations.

### Network Beaconing Identification Setup
The Network Beaconing Identification integration consists of a statistical framework to identify C2 beaconing activity in network logs.

#### Prerequisite Requirements:
- Fleet is required for Network Beaconing Identification.
- To configure Fleet Server refer to the [documentation](https://www.elastic.co/guide/en/fleet/current/fleet-server.html).
- Network events collected by the [Elastic Defend](https://docs.elastic.co/en/integrations/endpoint) or [Network Packet Capture](https://docs.elastic.co/integrations/network_traffic) integration.
- To install Elastic Defend, refer to the [documentation](https://www.elastic.co/guide/en/security/current/install-endpoint.html).
- To add the Network Packet Capture integration to an Elastic Agent policy, refer to [this](https://www.elastic.co/guide/en/fleet/current/add-integration-to-policy.html) guide.

#### The following steps should be executed to install assets associated with the Network Beaconing Identification integration:
- Go to the Kibana homepage. Under Management, click Integrations.
- In the query bar, search for Network Beaconing Identification and select the integration to see more details about it.
- Under Settings, click "Install Network Beaconing Identification assets" and follow the prompts to install the assets.
"""
references = [
    "https://www.elastic.co/guide/en/security/current/prebuilt-ml-jobs.html",
    "https://docs.elastic.co/en/integrations/beaconing",
    "https://www.elastic.co/security-labs/identifying-beaconing-malware-using-elastic",
]
risk_score = 21
rule_id = "5397080f-34e5-449b-8e9c-4c8083d7ccc6"
severity = "low"
tags = ["Domain: Network", "Use Case: C2 Beaconing Detection", "Tactic: Command and Control"]
type = "query"
timestamp_override = "event.ingested"

query = '''
beacon_stats.is_beaconing: true and
not process.name: ("accountsd" or "Acrobat.exe" or "AcroCEF Helper" or "AcroCEF.exe" or "AddressBookSourceSync" or "Adobe CEF Helper.exe" or "Adobe CEF Helper" or "Adobe Desktop Service.exe" or "Adobe Desktop Service" or "Adobe_CCXProcess.node" or "AdobeCollabSync.exe" or "akd" or "appstoreagent" or "apsd" or "assistantd" or "atmgr.exe" or "backgroundTaskHost.exe" or "BackgroundTransferHost.exe" or "Brave Browser Helper" or "CalendarAgent" or "Camtasia 2020" or "CCXProcess" or "chrome.exe" or "cloudd" or "Code Helper (Renderer)" or "Code Helper" or "Code.exe" or "com.apple.geod" or "com.apple.ncplugin.stocks" or "com.apple.Safari.SafeBrowsing.Service" or "com.apple.WebKit.Networking" or "com.docker.vpnkit" or "commerce" or "CompatTelRunner.exe" or "Core Sync" or "CoreSync.exe" or "default-browser-agent.exe" or "DeliveryService.exe" or "DeviceCensus.exe" or "Docker" or "Dropbox" or "Dsapi.exe" or "elastic-agent.exe" or "elastic-agent" or "elastic-endpoint" or "esensor" or "EXCEL.EXE" or "explorer.exe" or "familycircled" or "filebeat.exe" or "filebeat" or "FileCoAuth.exe" or "firefox.exe" or "firefox" or "GCEWindowsAgent.exe" or "GitHub Desktop Helper" or "Google Chrome Helper" or "Google Drive" or "google_guest_agent" or "google_osconfig_agent.exe" or "google_osconfig_agent" or "GoogleDriveFS.exe" or "GoogleUpdate.exe" or "HealthService.exe" or "IMRemoteURLConnectionAgent" or "jamf" or "keybase" or "ksfetch" or "Lenovo.Modern.ImController.PluginHost.CompanionApp.exe" or "LenovoVantageService.exe" or "locationd" or "lsass.exe" or "Mail" or "mapspushd" or "mcautoreg.exe" or "mdmclient" or "metricbeat.exe" or "metricbeat" or "Microsoft Excel" or "Microsoft OneNote" or "Microsoft PowerPoint" or "Microsoft Teams Helper (Renderer)" or "Microsoft Teams Helper" or "Microsoft Update Assistant" or "Microsoft Word" or "Microsoft.Management.Services.IntuneWindowsAgent.exe" or "MMSSHOST.exe" or "ModuleCoreService.exe" or "msedge.exe" or "msedgewebview2.exe" or "node.exe" or "node" or "nsurlsessiond" or "OfficeC2RClient.exe" or "OfficeClickToRun.exe" or "officesvcmgr.exe" or "OneDrive.exe" or "ONENOTE.EXE" or "packetbeat.exe" or "parsec-fbf" or "parsecd" or "pingsender.exe" or "SDXHelper.exe" or "SearchApp.exe" or "ServiceLayer.exe" or "Skype for Business" or "Slack Helper" or "Slack.exe" or "smartscreen.exe" or "snapd" or "softwareupdated" or "Spotify Helper" or "Spotify.exe" or "ssm-agent-worker.exe" or "ssm-document-worker.exe" or "svchost.exe" or "syspolicyd" or "SystemIdleCheck.exe" or "taskhostw.exe" or "Teams.exe" or "Teams" or "trustd" or "updater" or "WaAppAgent.exe" or "WhatsApp Helper" or "Widgets.exe" or "WindowsAzureGuestAgent.exe" or "WINWORD.EXE" or "xpcproxy" or "Zoom.exe" or "zoom.us" or "ZoomPresence")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1102"
name = "Web Service"
reference = "https://attack.mitre.org/techniques/T1102/"
[[rule.threat.technique.subtechnique]]
id = "T1102.002"
name = "Bidirectional Communication"
reference = "https://attack.mitre.org/techniques/T1102/002/"



[rule.threat.tactic]
id = "TA0011"
name = "Command and Control"
reference = "https://attack.mitre.org/tactics/TA0011/"

