[metadata]
creation_date = "2022/08/24"
integration = ["google_workspace"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.4.0"
updated_date = "2023/02/09"

[rule]
author = ["Elastic"]
description = """
Drive and Docs is a Google Workspace service that allows users to leverage Google Drive and Google Docs. Access to files
is based on inherited permissions from the child organizational unit the user belongs to which is scoped by
administrators. Typically if a user is removed, their files can be transferred to another user by the administrator.
This service can also be abused by adversaries to transfer files to an adversary account for potential exfiltration.
"""
false_positives = [
    """
    Administrators may transfer file ownership during employee leave or absence to ensure continued operations by a new
    or existing employee.
    """,
]
from = "now-130m"
index = ["filebeat-*", "logs-google_workspace*"]
interval = "10m"
language = "kuery"
license = "Elastic License v2"
name = "Google Drive Ownership Transferred via Google Workspace"
note = """## Triage and analysis

### Investigating Google Drive Ownership Transferred via Google Workspace

Google Drive is a cloud storage service available to users with a Google Workspace account that allows users to store and access files.

Permissions to files or specific shared drives are typically established by a Google Workspace administrator based on roles and organizational units. Access to sensitive files and folders can be requested internally or externally where permission is granted by the owner. Adversaries abuse this trust system by accessing Google Drive resources with inproperly scoped permissions and shared settings. Distribution of phishing emails is a common approach to also sharing malicious Google Drive documents where the recipient's Google Workspace privileges are inherited when ownership is granted by an external entity.

This rule identifies when ownership of a shared drive, within a Google Workspace organization, is transferred to another internal user.

#### Possible investigation steps

- From the admin console, review admin logs for user accounts involved by searching in Security > Reporting > Audit and investigation > Admin log events
- From user accounts involved, determine if accounts are active under Directory > Users
- Check if the user accounts involved had been recently disabled and then re-enabled
- Review user accounts involved for potentially misconfigured permissions or roles
- Review the shared drive or files involved and related policies to determine if this action was expected and appropriate
- If a shared drive, access requirments based on Organizational Units in Apps > Google Workspace > Drive and Docs > Manage shared drives
- Triage potentially-related alerts from Security > Alert center based on the users involved

### False positive analysis

- Transferring drives requires Google Workspace administration permissions related to Google Drive. Review with the requester if this action was planned/expected and is appropriately targeting the correct receiver.

### Response and remediation

- Initiate the incident response process based on the outcome of the triage.
- Disable or limit the account during the investigation and response.
- Identify the possible impact of the incident and prioritize accordingly; the following actions can help you gain context:
    - Identify the account role in the cloud environment.
    - Assess the criticality of affected services and servers.
    - Work with your IT team to identify and minimize the impact on users.
    - Identify if the attacker is moving laterally and compromising other accounts, servers, or services.
    - Identify any regulatory or legal ramifications related to this activity.
- Investigate credential exposure on systems compromised or used by the attacker to ensure all compromised accounts are identified. Reset passwords or delete API keys as needed to revoke the attacker's access to the environment. Work with your IT teams to minimize the impact on business operations during these actions.
- Reactivate multi-factor authentication for the user.
- Review the permissions assigned to the implicated user to ensure that the least privilege principle is being followed.
- Implement security defaults [provided by Google](https://cloud.google.com/security-command-center/docs/how-to-investigate-threats).
- Determine the initial vector abused by the attacker and take action to prevent reinfection via the same vector.
- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the mean time to respond (MTTR).

## Setup

The Google Workspace Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.

### Important Information Regarding Google Workspace Event Lag Times
- As per Google's documentation, Google Workspace administrators may observe lag times ranging from minutes up to 3 days between the time of an event's occurrence and the event being visible in the Google Workspace admin/audit logs.
- This rule is configured to run every 10 minutes with a lookback time of 130 minutes.
- To reduce the risk of false negatives, consider reducing the interval that the Google Workspace (formerly G Suite) Filebeat module polls Google's reporting API for new events.
- By default, `var.interval` is set to 2 hours (2h). Consider changing this interval to a lower value, such as 10 minutes (10m).
- See the following references for further information:
  - https://support.google.com/a/answer/7061566
  - https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-google_workspace.html"""
references = ["https://support.google.com/a/answer/1247799?hl=en"]
risk_score = 47
rule_id = "07b5f85a-240f-11ed-b3d9-f661ea17fbce"
severity = "medium"
tags = ["Elastic", "Cloud", "Google Workspace", "Continuous Monitoring", "SecOps", "Collection"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset:"google_workspace.admin" and event.action:"CREATE_DATA_TRANSFER_REQUEST"
  and event.category:"iam" and google_workspace.admin.application.name:Drive*
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1074"
name = "Data Staged"
reference = "https://attack.mitre.org/techniques/T1074/"
[[rule.threat.technique.subtechnique]]
id = "T1074.002"
name = "Remote Data Staging"
reference = "https://attack.mitre.org/techniques/T1074/002/"



[rule.threat.tactic]
id = "TA0009"
name = "Collection"
reference = "https://attack.mitre.org/tactics/TA0009/"

