[metadata]
creation_date = "2023/03/07"
integration = ["google_workspace"]
maturity = "production"
min_stack_comments = "Breaking changes for Google Workspace integration."
min_stack_version = "8.4.0"
updated_date = "2023/03/07"

[rule]
author = ["Elastic"]
description = """
Detects when a user copies a Google spreadsheet, form, document or script from an external drive. An adversary may send
a phishing email to the victim with a Drive object link where "copy" is included in the URI, thus copying the object to
the victim's drive.
"""
false_positives = [
    """
    Google Workspace users typically share Drive resources with a shareable link where parameters are edited to indicate
    when it is viewable or editable by the intended recipient. It is uncommon for a user in an organization to manually
    copy a Drive object from an external drive to their corporate drive. This may happen where users find a useful
    spreadsheet in a public drive, for example, and replicate it to their Drive.
    """,
]
from = "now-130m"
index = ["filebeat-*", "logs-google_workspace*"]
interval = "10m"
language = "eql"
license = "Elastic License v2"
name = "Google Workspace Resource Copied from External Drive"
note = """## Setup

The Google Workspace Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.

### Important Information Regarding Google Workspace Event Lag Times
- As per Google's documentation, Google Workspace administrators may observe lag times ranging from minutes up to 3 days between the time of an event's occurrence and the event being visible in the Google Workspace admin/audit logs.
- This rule is configured to run every 10 minutes with a lookback time of 130 minutes.
- To reduce the risk of false negatives, consider reducing the interval that the Google Workspace (formerly G Suite) Filebeat module polls Google's reporting API for new events.
- By default, `var.interval` is set to 2 hours (2h). Consider changing this interval to a lower value, such as 10 minutes (10m).
- See the following references for further information:
  - https://support.google.com/a/answer/7061566
  - https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-google_workspace.html"""
references = [
    "https://www.elastic.co/security-labs/google-workspace-attack-surface-part-one",
    "https://developers.google.com/apps-script/guides/bound",
    "https://support.google.com/a/users/answer/13004165#share_make_a_copy_links",
]
risk_score = 47
rule_id = "f33e68a4-bd19-11ed-b02f-f661ea17fbcc"
severity = "medium"
tags = ["Elastic", "Cloud", "Google Workspace", "Continuous Monitoring", "SecOps", "Initial Access"]
timestamp_override = "event.ingested"
type = "eql"

query = '''
file where event.dataset == "google_workspace.drive" and event.action == "copy" and

    /* Should only match if the object lives in a Drive that is external to the user's GWS organization */
    google_workspace.drive.owner_is_team_drive == "false" and google_workspace.drive.copy_type == "external" and

    /* Google Script, Forms, Sheets and Document can have container-bound scripts */
    google_workspace.drive.file.type: ("script", "form", "spreadsheet", "document")
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1566"
name = "Phishing"
reference = "https://attack.mitre.org/techniques/T1566/"
[[rule.threat.technique.subtechnique]]
id = "T1566.004"
name = "Spearphishing Link"
reference = "https://attack.mitre.org/techniques/T1566/004/"



[rule.threat.tactic]
id = "TA0001"
name = "Initial Access"
reference = "https://attack.mitre.org/tactics/TA0001/"

