[metadata]
creation_date = "2020/11/17"
integration = ["google_workspace"]
maturity = "production"
min_stack_comments = "New fields added: required_fields, related_integrations, setup"
min_stack_version = "8.4.0"
updated_date = "2023/02/09"

[rule]
author = ["Elastic"]
description = """
Detects when a custom admin role is created in Google Workspace. An adversary may create a custom admin role in order to
elevate the permissions of other user accounts and persist in their target’s environment.
"""
false_positives = [
    """
    Custom Google Workspace admin roles may be created by system administrators. Verify that the configuration change
    was expected. Exceptions can be added to this rule to filter expected behavior.
    """,
]
from = "now-130m"
index = ["filebeat-*", "logs-google_workspace*"]
interval = "10m"
language = "kuery"
license = "Elastic License v2"
name = "Google Workspace Custom Admin Role Created"
note = """## Triage and analysis

### Investigating Google Workspace Custom Admin Role Created

Google Workspace roles allow administrators to assign specific permissions to users or groups where the principle of least privilege (PoLP) is recommended. Admin roles in Google Workspace grants users access to the Google Admin console, where further domain-wide settings are accessible. Google Workspace contains pre-built administrator roles for performing business functions related to users, groups and services. Custom administrator roles can be created where pre-built roles are not preferred.

Roles assigned to users will grant them additional permissions and privileges within the Google Workspace domain. Threat actors may create new admin roles with privileges to further their intrusion efforts and laterally move throughout the organization if existing roles or users do not have privileges aligned with their modus operandi. User's with unexpected privileges from new admin roles may also cause operational disfunction is unfamiliar settings are adjusted without warning. Administrators may create new roles, rather than modify existing to accomplish a short-term goal but unintentionally introduce additional risk exposure.

This rule identifies when a Google Workspace administrative role is added within the Admin Console.

#### Possible investigation steps

- Identify user account(s) associated by reviewing `user.name` or `user.email` in the alert
- Identify the role added by reviewing `google_workspace.admin.role.name` in the alert
- With the user identified, verify administrative privileges to add administrative roles is expected
- To identify if users have been assigned this role, search for `event.action: ASSIGN_ROLE`
    - Add `google_workspace.admin.role.name` with the role added as an additional filter
    - Adjust the relative time accordingly to identify all users that were possibly assigned this admin role
- Since a new role was added, monitor users assigned this role for the next 24 hours in an attempt to identify using related privileges
  - The `event.provider` field will help filter for specific services in Google Workspace such as Drive or Admin
  - The `event.action` field will help trace what actions are being taken by users

### False positive analysis

- With the user account whom created the role, verify this action was intentional
- Verify that the user whom created the role is expected to have administrative privileges in Google Workspace to create custom roles
- Review organizational units or groups the role may have been added to and ensure the new privileges align properly
- Use the `user.name` to filter for `event.action` where `CREATE_ROLE` has been seen before to check if these actions are new or historical

### Response and remediation

- Initiate the incident response process based on the outcome of the triage.
- Disable or limit the account during the investigation and response.
- Identify the possible impact of the incident and prioritize accordingly; the following actions can help you gain context:
    - Identify the account role in the cloud environment.
    - Assess the criticality of affected services and servers.
    - Work with your IT team to identify and minimize the impact on users.
    - Identify if the attacker is moving laterally and compromising other accounts, servers, or services.
    - Identify any regulatory or legal ramifications related to this activity.
- Investigate credential exposure on systems compromised or used by the attacker to ensure all compromised accounts are identified. Reset passwords or delete API keys as needed to revoke the attacker's access to the environment. Work with your IT teams to minimize the impact on business operations during these actions.
- Reactivate multi-factor authentication for the user.
- Review the permissions assigned to the implicated user to ensure that the least privilege principle is being followed.
- Implement security defaults [provided by Google](https://cloud.google.com/security-command-center/docs/how-to-investigate-threats).
- Determine the initial vector abused by the attacker and take action to prevent reinfection via the same vector.
- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the mean time to respond (MTTR).

## Setup

The Google Workspace Fleet integration, Filebeat module, or similarly structured data is required to be compatible with this rule.

### Important Information Regarding Google Workspace Event Lag Times
- As per Google's documentation, Google Workspace administrators may observe lag times ranging from minutes up to 3 days between the time of an event's occurrence and the event being visible in the Google Workspace admin/audit logs.
- This rule is configured to run every 10 minutes with a lookback time of 130 minutes.
- To reduce the risk of false negatives, consider reducing the interval that the Google Workspace (formerly G Suite) Filebeat module polls Google's reporting API for new events.
- By default, `var.interval` is set to 2 hours (2h). Consider changing this interval to a lower value, such as 10 minutes (10m).
- See the following references for further information:
  - https://support.google.com/a/answer/7061566
  - https://www.elastic.co/guide/en/beats/filebeat/current/filebeat-module-google_workspace.html"""
references = ["https://support.google.com/a/answer/2406043?hl=en"]
risk_score = 47
rule_id = "ad3f2807-2b3e-47d7-b282-f84acbbe14be"
severity = "medium"
tags = ["Elastic", "Cloud", "Google Workspace", "Continuous Monitoring", "SecOps", "Identity and Access"]
timestamp_override = "event.ingested"
type = "query"

query = '''
event.dataset:google_workspace.admin and event.provider:admin and event.category:iam and event.action:CREATE_ROLE
'''


[[rule.threat]]
framework = "MITRE ATT&CK"
[[rule.threat.technique]]
id = "T1098"
name = "Account Manipulation"
reference = "https://attack.mitre.org/techniques/T1098/"


[rule.threat.tactic]
id = "TA0003"
name = "Persistence"
reference = "https://attack.mitre.org/tactics/TA0003/"

